{"p2":"Saisissez votre message en clair dans le champ de texte et créez un mot de passe robuste dans le champ prévu. Cliquez sur Chiffrer pour transformer votre texte avec AES-256-GCM, une norme de chiffrement de niveau militaire. L'outil dérive une clé cryptographique de votre mot de passe en utilisant PBKDF2 avec 100 000 itérations et un sel aléatoire. La sortie chiffrée inclut le sel, le vecteur d'initialisation et le texte chiffré combinés dans une chaîne encodée en Base64. Pour déchiffrer, collez la chaîne chiffrée, entrez le même mot de passe et cliquez sur Déchiffrer. Si le mot de passe est incorrect ou les données corrompues, le déchiffrement échoue avec une erreur. Toutes les opérations cryptographiques utilisent l'API Web Crypto dans votre navigateur.","p3":"Les utilisateurs partagent en toute sécurité des informations sensibles comme des mots de passe ou des identifiants en chiffrant le texte, en l'envoyant via des canaux non sécurisés comme l'e-mail, et en partageant le mot de passe de déchiffrement séparément via un canal différent comme les SMS. Les développeurs testent leurs implémentations de chiffrement en chiffrant des données de test et en vérifiant que leur application peut les déchiffrer correctement. Les personnes soucieuses de la sécurité chiffrent les notes contenant des informations confidentielles avant de les stocker dans des applications de prise de notes cloud. Les services informatiques démontrent les concepts de chiffrement lors de formations à la sécurité en permettant aux employés de chiffrer et déchiffrer des messages d'exemple.","p4":"Choisissez un mot de passe fort et unique pour le chiffrement ; les mots de passe faibles peuvent être forcés par attaque brute quelle que soit la robustesse d'AES. N'envoyez jamais les données chiffrées et le mot de passe par le même canal ; si un attaquant intercepte les deux, le chiffrement est inutile. Conservez l'intégralité de la chaîne de sortie chiffrée incluant les métadonnées ; perdre une partie signifie que vous ne pourrez pas déchiffrer le message. Le mode GCM fournit un chiffrement authentifié, donc si quelqu'un altère le texte chiffré, le déchiffrement échouera plutôt que de produire un résultat corrompu. Cet outil convient pour un chiffrement manuel occasionnel, mais les applications de production devraient utiliser des systèmes de gestion de clés appropriés plutôt que des clés dérivées de mots de passe."}