{"p2":"Sélectionnez votre date de naissance à l'aide du sélecteur de date ou tapez-la directement. Tuttilo calcule votre âge exact de la naissance jusqu'à aujourd'hui, affichant le résultat dans plusieurs formats : années et mois, mois totaux, semaines totales, jours totaux et heures totales. Vous pouvez également calculer l'âge à une date future ou passée spécifique en changeant le champ « calculer l'âge à ». L'outil tient compte des années bissextiles et des variations de longueur des mois. Vos informations personnelles de date sont traitées entièrement dans votre navigateur sans être stockées ou transmises.","p3":"Les parents suivent l'âge de leur nourrisson en semaines et mois pour les rendez-vous pédiatriques qui nécessitent un suivi développemental précis. Les départements des ressources humaines vérifient l'admissibilité à l'âge pour les programmes d'emploi ou les prestations de retraite. Les planificateurs d'événements calculent les âges exacts pour les fêtes d'anniversaire importantes comme les célébrations « 10 000 jours ». Les professionnels du droit déterminent l'âge à des dates spécifiques pour les contrats, les polices d'assurance ou les exigences d'admissibilité ayant des seuils d'âge stricts. Les généalogistes calculent les âges des ancêtres aux événements historiques importants.","p4":"Pour le suivi de l'âge des bébés, les pédiatres mesurent généralement en semaines jusqu'à 12 semaines, puis passent aux mois jusqu'à l'âge de 2 ans, basculez donc entre les unités en conséquence. Les calculs d'âge comptent légalement — quelqu'un né le 29 février d'une année bissextile vieillit légalement d'un an le 28 février ou le 1er mars les années non bissextiles selon la juridiction. Lorsque vous calculez l'âge de quelqu'un au décès pour les obituaires ou la généalogie, soyez prudent d'utiliser sa date de naissance et sa date de décès exactes. Dans de nombreuses cultures, l'âge est compté différemment (comme l'âge coréen), mais ce calculateur utilise la norme internationale."}