{"p2":"Tapez ou collez du texte dans le champ de saisie et sélectionnez Encoder pour le convertir au format Base64, qui représente les données binaires sous forme de texte ASCII. La sortie encodée utilise les caractères A-Z, a-z, 0-9 et +/=. Sélectionnez Décoder pour inverser le processus, en convertissant les chaînes Base64 en texte lisible. L'outil gère correctement les caractères Unicode en les encodant comme octets UTF-8 avant la conversion Base64. Vous pouvez également encoder des fichiers binaires en les téléchargeant, produisant une chaîne Base64 adaptée à l'intégration dans JSON ou les URI de données. Tout se traite localement dans votre navigateur.","p3":"Les développeurs web intègrent de petites images ou icônes directement dans le CSS ou HTML en utilisant des URI de données, qui nécessitent des données d'image encodées en Base64. Les ingénieurs API encodent les identifiants d'authentification pour les en-têtes HTTP Basic Auth qui requièrent des paires username:password au format base64. Les développeurs d'e-mails encodent les pièces jointes d'images en ligne dans les e-mails HTML plutôt que de référencer des URL externes qui pourraient être bloquées. Les ingénieurs frontend décodent les chaînes Base64 des API pour extraire des fichiers binaires embarqués comme des PDF ou images sérialisés pour le transport JSON.","p4":"Le Base64 augmente la taille des données d'environ 33 pour cent, donc ne l'utilisez que pour les petits fichiers ou lorsque l'intégration est réellement nécessaire. Lors de l'encodage de données sensibles comme des jetons ou identifiants, rappelez-vous que le Base64 est un encodage, pas du chiffrement—n'importe qui peut le décoder instantanément. Pour les URI de données en CSS, équilibrez commodité et efficacité du cache ; les fichiers externes peuvent être mis en cache, mais les URI de données sont retéléchargées à chaque chargement de la feuille de style. Si vous décodez du Base64 d'une API et que cela ressemble à du charabia, vérifiez que l'encodage original utilisait UTF-8 plutôt qu'un jeu de caractères différent."}