{"p2":"Cochez les cases lecture, écriture et exécution pour le propriétaire, le groupe et les autres pour construire votre ensemble de permissions souhaité. Le calculateur affiche la notation octale (comme 755 ou 644) et la notation symbolique (comme rwxr-xr-x) en temps réel. Copiez la commande chmod générée directement—par exemple, chmod 755 nomfichier. L'outil fonctionne également en sens inverse : collez un code octal pour voir quelles cases correspondent à ces permissions. Une section de référence explique ce que chaque type de permission permet pour les fichiers vs. les répertoires. Tous les calculs se font instantanément dans votre navigateur.","p3":"Les administrateurs Linux définissent les permissions correctes sur les fichiers de serveur web—755 pour les répertoires, 644 pour les fichiers—pour équilibrer accessibilité et sécurité. Les développeurs résolvent les erreurs de permission refusée en calculant quelles permissions leur script ou utilisateur a réellement besoin. Les ingénieurs DevOps préparant des scripts de déploiement vérifient que les exécutables ont les bits de permission corrects définis. Les étudiants apprenant les systèmes de fichiers Unix utilisent le calculateur pour comprendre comment les codes octaux se traduisent en droits d'accès réels.","p4":"Les répertoires nécessitent la permission d'exécution pour que les utilisateurs puissent accéder aux fichiers qu'ils contiennent—755 est standard pour les répertoires accessibles web. La permission 777 (lecture/écriture/exécution pour tout le monde) est un risque de sécurité ; évitez-la sauf si vous déboguez un problème de permission spécifique temporairement. La notation symbolique (chmod u+x) est plus sûre pour les scripts car elle n'écrase pas les permissions groupe/autres existantes. Lors de la définition des permissions pour les clés SSH, 600 (lecture/écriture propriétaire uniquement) est requis—des paramètres plus permissifs font échouer l'authentification. Utilisez 644 pour les fichiers lisibles par tous comme HTML/CSS et 600 pour les fichiers de configuration sensibles."}