{"p2":"Cliquez n'importe où dans le dégradé du sélecteur de couleur pour choisir une teinte et une saturation, puis ajustez le curseur de luminosité sur la droite. La couleur sélectionnée s'affiche en haut avec les valeurs de couleur en direct dans plusieurs formats. Copiez le code HEX pour CSS et HTML, les valeurs RGB pour la manipulation de couleur programmatique, la représentation HSL pour ajuster la luminosité, ou rgba/hsla avec transparence alpha. Vous pouvez également coller n'importe quel code HEX dans le champ de saisie pour accéder directement à cette couleur. Les valeurs CMYK aident lors de la préparation des designs pour l'impression. Toutes les conversions se calculent instantanément dans votre navigateur.","p3":"Les designers UI/UX sélectionnent les couleurs de marque et génèrent des valeurs exactes pour les systèmes de design et guides de style. Les développeurs frontend choisissent des couleurs pour CSS lors de la construction de composants, en copiant le format nécessaire pour leur contexte spécifique. Les graphistes convertissent les couleurs d'écran en CMYK avant d'envoyer les designs aux imprimeurs qui nécessitent des espaces colorimétriques optimisés pour l'impression. Les équipes marketing assurent la cohérence des couleurs de marque à travers les actifs numériques en référençant les codes HEX canoniques plutôt qu'en estimant les couleurs à l'œil.","p4":"Lors de la conception pour l'accessibilité, vérifiez que vos combinaisons de couleurs respectent les ratios de contraste WCAG en utilisant un vérificateur de contraste séparé après avoir choisi les couleurs ici. Le format HSL est particulièrement utile pour générer programmatiquement des variations de couleur car vous pouvez ajuster la luminosité et la saturation tout en gardant la teinte de base constante. Rappelez-vous que les couleurs apparaissent différemment sur les écrans versus l'impression, donc les valeurs CMYK sont des approximations ; demandez des épreuves couleur à votre imprimeur pour les matériaux de marque critiques. Enregistrez la palette de couleurs de votre projet dans un fichier texte ou outil de design car les outils de navigateur ne conservent pas les sélections."}