{"p2":"Téléchargez une image ou sélectionnez les couleurs de votre palette de conception, puis choisissez quel type de déficience de vision des couleurs simuler : protanopie (daltonisme rouge), deutéranopie (daltonisme vert), tritanopie (daltonisme bleu), protanomalie (sensibilité rouge réduite), deutéranomalie (sensibilité verte réduite) ou tritanomalie (sensibilité bleue réduite). L'outil applique des transformations mathématiques qui modèlent avec précision comment ces conditions affectent la perception des couleurs. Comparez la vue simulée côte à côte avec l'original pour identifier les combinaisons de couleurs problématiques. Tous les traitements se font localement.","p3":"Les designers UI testent si les éléments d'interface critiques comme les états d'erreur (traditionnellement rouge) et les messages de succès (généralement verts) restent distinguables pour les utilisateurs daltoniens. Les spécialistes de la visualisation de données vérifient que les couleurs du graphique, les lignes du graphique et les cartes thermiques communiquent les informations. Les créateurs d'infographie assurent que les icônes, les légendes et les distinctions de catégories ne s'appuient pas uniquement sur les différences de couleur. Les développeurs de jeux testent si les mécaniques de jeu dépendantes de la reconnaissance des couleurs.","p4":"Deutéranomalie (sensibilité verte réduite) affecte environ 6% des hommes et est la forme la plus courante — testez toujours contre cette variante au minimum. Évitez complètement les combinaisons rouge-vert puisque la protanopie et la deutéranopie confondent ces teintes ; utilisez les paires bleu-orange à la place. Ne comptez pas sur la couleur seule pour transmettre les informations — supplémentez avec des motifs, des formes, des icônes ou des étiquettes de texte. Les outils comme ce simulateur ne sont pas parfaits puisqu'ils approximent plutôt que de reproduire l'expérience réelle, mais ils attrapent la plupart des problèmes majeurs. Combinez les tests de simulation avec la vérification du rapport de contraste."}