{"p2":"Collez du texte dans le champ de saisie ou téléchargez un fichier, et l'outil calcule immédiatement la somme de contrôle CRC-32 en utilisant le polynôme IEEE 802.3 (0xEDB88320). La sortie s'affiche comme une chaîne hexadécimale de 8 caractères. Le CRC-32 détecte la corruption accidentelle des données pendant la transmission ou le stockage en produisant une empreinte unique des données. Pour vérifier l'intégrité, calculez le CRC-32 d'un fichier après le transfert et comparez-le à la somme de contrôle calculée avant le transfert ; des valeurs correspondantes confirment que les données sont intactes. Tous les calculs se font localement dans votre navigateur.","p3":"Les administrateurs réseau vérifient l'intégrité des fichiers après avoir transféré de gros fichiers sur des connexions peu fiables, confirmant que rien n'a été corrompu pendant le téléchargement. Les développeurs de logiciels incluent des sommes de contrôle CRC-32 avec les binaires distribués pour que les utilisateurs puissent vérifier que leurs téléchargements n'ont pas été altérés. Les archivistes vérifiant d'anciennes sauvegardes calculent les valeurs CRC-32 des fichiers archivés pour détecter la dégradation progressive ou la corruption dans le temps. Les spécialistes de récupération de données utilisent le CRC-32 pour identifier les blocs valides dans les fichiers partiellement corrompus.","p4":"Le CRC-32 détecte les erreurs accidentelles mais n'offre aucune sécurité contre la falsification intentionnelle ; utilisez des hachages cryptographiques comme SHA-256 si vous devez détecter des modifications malveillantes. Les collisions CRC-32 sont relativement courantes, donc des sommes de contrôle correspondantes ne garantissent pas que les fichiers sont identiques, seulement qu'ils sont très probablement les mêmes. Pour les gros fichiers, le navigateur doit charger le fichier entier en mémoire pour calculer la somme de contrôle, ce qui pourrait échouer pour les fichiers de plusieurs gigaoctets. Stockez les sommes de contrôle CRC-32 séparément des fichiers qu'elles vérifient ; si le fichier et la somme de contrôle sont corrompus ensemble, vous ne pouvez pas détecter le problème."}