{"p2":"Collez des données CSV dans le champ de saisie et cliquez sur Analyser pour les charger dans la grille de tableur. Cliquez sur n'importe quelle cellule pour éditer sa valeur directement—les modifications se reflètent instantanément. Utilisez les boutons Ajouter une ligne et Ajouter une colonne pour agrandir votre jeu de données, ou Supprimer la dernière ligne/colonne pour le réduire. Basculez entre les délimiteurs virgule, point-virgule et tabulation pour correspondre à votre format cible. Une fois terminé, cliquez sur Copier pour copier le CSV édité dans votre presse-papiers. L'outil gère automatiquement les champs entre guillemets et les caractères échappés. Toute l'édition se fait dans la mémoire de votre navigateur.","p3":"Les commis à la saisie de données corrigent rapidement les fautes de frappe ou valeurs manquantes dans les exports CSV avant de les importer dans les bases de données. Les utilisateurs de tableurs ajustent les types de délimiteurs lors de l'ouverture de fichiers dans des applications qui attendent des séparateurs spécifiques. Les développeurs prototypent de petits jeux de données en collant des CSV modèles et en remplissant les valeurs de test sans lancer Excel. Les administrateurs de bases de données ajoutent ou suppriment des colonnes des fichiers de données d'exemple pour correspondre aux changements de schéma avant les imports en masse.","p4":"Vérifiez toujours les virgules intégrées dans les champs—elles nécessitent des guillemets dans le CSV de sortie ou elles créeront des colonnes supplémentaires. Utilisez le commutateur de délimiteur lors du travail avec des systèmes européens qui utilisent par défaut des points-virgules (car les virgules servent de séparateurs décimaux). Après avoir ajouté des lignes, faites défiler vers le bas pour vérifier que la grille ne les a pas insérées à la mauvaise position. Supprimez les colonnes vides finales avant d'exporter pour éviter de créer des champs inutiles dans le système cible. Testez avec des cas limites comme des sauts de ligne dans les champs entre guillemets pour assurer un échappement approprié."}