{"p2":"Collez votre texte dans l'éditeur principal, puis entrez le terme de recherche dans le champ « Rechercher ». L'outil surligne immédiatement toutes les correspondances et affiche le compte. Tapez votre texte de remplacement dans le champ « Remplacer » et choisissez de remplacer une correspondance à la fois ou toutes les correspondances simultanément. Activez la sensibilité à la casse pour une correspondance exacte ou activez les expressions régulières pour les remplacements basés sur des motifs. L'aperçu se met à jour instantanément, montrant exactement ce qui changera. Tout le traitement de texte se fait localement dans votre navigateur, donc le contenu sensible n'est jamais transmis.","p3":"Les développeurs refactorisant le code utilisent ceci pour renommer des variables ou mettre à jour des points de terminaison d'API sur de grands blocs de code sans ouvrir un IDE. Les éditeurs de contenu mettent à jour les noms de produits, URL ou terminologie dans les articles de blog et le contenu marketing. Les nettoyeurs de données suppriment ou normalisent le formatage incohérent dans les exports CSV ou fichiers de logs en trouvant des motifs irréguliers. Les écrivains travaillant sur des manuscrits recherchent des phrases surutilisées ou des mots de remplissage pour améliorer leur prose en les remplaçant par des alternatives variées.","p4":"Lors de l'utilisation d'expressions régulières, testez votre motif avec un petit échantillon d'abord car les regex complexes peuvent produire des résultats inattendus. Pour correspondre uniquement aux mots entiers, entourez votre terme de recherche de limites de mots comme \\bmot\\b pour éviter les remplacements partiels à l'intérieur de mots plus longs. Avant de cliquer sur « Tout remplacer », parcourez les correspondances surlignées pour vérifier que vous attrapez ce que vous attendez et ne modifiez pas accidentellement du texte non lié. Échappez les caractères regex spéciaux comme les points ou parenthèses avec des barres obliques inverses si vous recherchez des symboles littéraux plutôt que des opérateurs de motifs."}