{"p2":"Ajustez le curseur de flou pour contrôler la quantité de contenu d'arrière-plan visible — des valeurs plus élevées créent des effets de givrage plus forts. Définissez l'opacité d'arrière-plan pour déterminer la translucidité, la saturation des couleurs pour ajouter une teinte (rendant votre verre plus chaud ou plus frais) et la transparence de la bordure pour la surbrillance de bord subtile caractéristique. L'aperçu affiche votre carte de verre contre un arrière-plan dégradé personnalisable pour que vous puissiez voir exactement comment il interagit. Copiez le CSS complet incluant backdrop-filter, background et border prêt pour la production.","p3":"Les interfaces de tableau de bord utilisent des panneaux vitrifiés pour superposer les informations sur les arrière-plans dynamiques comme la vidéo ou les dégradés animés tout en maintenant la lisibilité. Les concepteurs d'applications mobiles créent des barres de navigation givrées et des modales qui laissent le contenu sous-jacent apparaître, maintenant le contexte. Les pages d'atterrissage emploient des cartes de verre pour les tableaux de prix ou les mises en évidence de fonctionnalités, ajoutant une profondeur sophistiquée. Les interfaces de lecteur de musique utilisent le glassmorphisme pour les contrôles de lecture superposant l'illustration de l'album.","p4":"Backdrop-filter blur fonctionne mieux entre 10-20px — les valeurs inférieures à peine le givrage tandis que les valeurs supérieures le rendent opaque. Incluez toujours un arrière-plan semi-transparent de secours pour les navigateurs sans support backdrop-filter, en particulier les versions Firefox plus anciennes. Le glassmorphisme semble le plus frappant contre les arrière-plans vibrants ou multicolores ; les arrière-plans subtils réduisent l'impact visuel. Ajoutez une fine bordure brillante (1px solid rgba(255,255,255,0.18)) pour définir les bords contre les arrière-plans chargés. Conseil de performance : backdrop-filter est intensive en GPU, limitez donc l'utilisation aux sections hero ou aux éléments UI clés."}