{"p2":"Tapez ou collez du texte dans le champ de saisie et l'outil calcule instantanément les hachages SHA-1, SHA-256, SHA-384 et SHA-512 simultanément. Chaque hachage apparaît dans son propre champ de sortie avec un bouton de copie pour un accès rapide au presse-papiers. L'outil utilise l'API Web Crypto native du navigateur pour un hachage rapide et sécurisé avec des implémentations appropriées des algorithmes de la famille SHA. Pour le hachage de fichiers, téléchargez un fichier et l'outil le lit comme un tampon binaire avant de calculer les hachages. Tous les calculs se font localement dans votre navigateur ; aucune donnée n'est envoyée aux serveurs.","p3":"Les développeurs vérifient les packages logiciels téléchargés en comparant les hachages SHA-256 calculés aux sommes de contrôle officielles pour détecter la falsification ou la corruption. Les ingénieurs de sécurité hachent les mots de passe localement avant de tester les systèmes d'authentification pour éviter d'envoyer des identifiants en clair. Les administrateurs système comparent les hachages de fichiers avant et après les transferts pour confirmer l'intégrité des données. Les ingénieurs DevOps génèrent des hachages de fichiers de configuration pour le suivi de version et la détection de modifications non autorisées.","p4":"Utilisez SHA-256 ou supérieur pour les applications de sécurité ; SHA-1 est cryptographiquement cassé et ne devrait être utilisé que pour la compatibilité héritée. Les valeurs de hachage sont déterministes, donc la même entrée produit toujours le même hachage, ce qui les rend parfaits pour les sommes de contrôle mais inadaptés pour le stockage de mots de passe sans sel supplémentaire. Lors de la vérification de l'intégrité du téléchargement, hachez le fichier entier, pas seulement un échantillon, car les attaquants peuvent créer des collisions dans des données partielles. Copiez les hachages en minuscules ou majuscules de manière cohérente car certains outils de vérification sont sensibles à la casse alors que le hachage lui-même est le même."}