{"p2":"Entrez un code couleur HEX (comme #3498db) dans le champ HEX, ou saisissez des valeurs RGB/HSL/CMYK dans leurs champs respectifs. L'outil convertit instantanément vers tous les autres formats et affiche un grand échantillon de couleur d'aperçu. Vous pouvez également cliquer sur l'échantillon de couleur pour ouvrir un sélecteur visuel permettant de sélectionner des couleurs de manière interactive. Chaque champ de format inclut un bouton de copie pour un accès rapide au presse-papiers. Les conversions se calculent en utilisant des formules d'espace colorimétrique standard. Tout le traitement s'exécute localement dans votre navigateur.","p3":"Les designers travaillant sur des supports imprimés et numériques convertissent les valeurs RGB des designs d'écran en approximations CMYK pour les imprimeurs. Les développeurs refactorisent les bases de code CSS pour utiliser HSL au lieu de HEX pour une manipulation de couleur programmatique plus facile dans les thèmes. Les gestionnaires de marque vérifient que les valeurs de couleur dans les guides de style correspondent à travers différents formats de représentation. Les ingénieurs frontend convertissent les valeurs RGB des outils de design en codes HEX requis par les règles de compatibilité héritée des navigateurs.","p4":"Les valeurs RGB vont de 0 à 255, donc si vous convertissez à partir de pourcentages (comme rgb() CSS avec 50%), multipliez d'abord par 2,55. HSL est supérieur au RGB pour générer des schémas de couleurs car l'ajustement de la teinte par des montants égaux crée des couleurs harmonieuses, tandis que des ajustements RGB aléatoires créent un chaos visuel. Les conversions CMYK sont des approximations car CMYK est un espace colorimétrique soustractif d'impression et RGB est additif basé sur l'écran ; demandez toujours des épreuves d'impression pour une correspondance de couleur exacte. Lors du partage de couleurs avec les membres de l'équipe, utilisez HEX pour la simplicité ou HSL s'ils devront générer des variations programmatiquement."}