{"p2":"Entrez le message que vous souhaitez authentifier dans le champ message et votre clé secrète dans le champ clé. Sélectionnez votre algorithme SHA préféré dans le menu déroulant (SHA-1, SHA-256, SHA-384 ou SHA-512). Cliquez sur Générer pour calculer le code HMAC, qui apparaît comme une chaîne hexadécimale dans le champ de sortie. L'outil utilise l'implémentation HMAC de l'API Web Crypto, garantissant une exactitude cryptographique et des performances rapides. Copiez le HMAC généré pour l'utiliser dans les en-têtes d'authentification d'API ou la vérification de l'intégrité des données. Tous les calculs se font localement dans votre navigateur.","p3":"Les développeurs d'API génèrent des signatures HMAC pour les charges utiles de webhooks afin que les destinataires puissent vérifier que les messages proviennent de l'expéditeur légitime. Les ingénieurs backend implémentent l'authentification basée sur HMAC pour les API REST, utilisant cet outil pour tester manuellement la génération de signature pendant le développement. Les équipes de sécurité vérifient les implémentations HMAC en comparant la sortie des systèmes de production à cet outil de référence. Les ingénieurs DevOps résolvent les problèmes d'intégration d'API en générant les valeurs HMAC attendues à comparer avec ce que l'API reçoit.","p4":"L'expéditeur et le destinataire doivent utiliser un contenu de message, une clé et un algorithme identiques pour que la vérification réussisse ; même un espace supplémentaire casse la correspondance. Utilisez SHA-256 ou supérieur pour les systèmes de production ; SHA-1 est déprécié pour les applications de sécurité. Stockez les clés secrètes en toute sécurité et ne les exposez jamais dans le code côté client ; cet outil est pour le développement et les tests, pas la gestion de clés en production. Lors de l'implémentation de l'authentification HMAC, incluez un horodatage dans le message pour empêcher les attaques par rejeu où d'anciennes requêtes valides sont réutilisées de manière malveillante."}