{"p2":"Collez du texte dans la zone de saisie et sélectionnez le mode encoder ou décoder. L'encodage convertit les caractères spéciaux comme les chevrons, esperluettes et guillemets en leurs équivalents d'entités HTML (&lt;, &amp;, &quot;). Vous pouvez choisir entre les entités nommées (plus lisibles) et les entités numériques (plus universelles). Le décodage inverse le processus, transformant les entités en leurs caractères originaux. L'outil gère les caractères Unicode étendus et fournit une conversion instantanée pendant que vous tapez. Tout le traitement se fait dans votre navigateur en utilisant la manipulation de chaînes JavaScript.","p3":"Les développeurs web encodent le contenu généré par les utilisateurs avant de l'afficher en HTML pour empêcher les attaques de cross-site scripting (XSS). Les rédacteurs techniques préparant des exemples de code pour les blogs encodent les chevrons pour que <div> s'affiche comme texte littéral plutôt que de rendre. Les spécialistes SEO décodent les méta-descriptions récupérées contenant des entités pour analyser la longueur réelle des caractères. Les spécialistes du marketing par e-mail encodent les caractères spéciaux dans les lignes d'objet pour assurer un affichage approprié à travers différents clients de messagerie qui gèrent les esperluettes ou guillemets bruts de manière incohérente.","p4":"Encodez toujours les entrées non fiables avant de les insérer dans le contexte HTML—compter sur les frameworks est sage, mais comprendre le mécanisme sous-jacent empêche les failles de sécurité. Les entités nommées (&eacute;) sont plus lisibles dans la source mais toutes les entités n'ont pas de noms ; utilisez les numériques (&#233;) pour une couverture complète. Lors de l'encodage pour les contextes XML, l'ensemble d'entités requis est plus petit (seulement &, <, >, \", '). Décodez avant d'effectuer des comptages de caractères pour la validation—&nbsp; compte comme un caractère, pas six. Testez l'encodage avec des caractères non-ASCII pour vérifier la gestion appropriée de l'UTF-8."}