{"p2":"Collez un objet ou tableau JSON dans le champ de saisie et l'outil génère une interface TypeScript correspondant à sa structure. Les types primitifs (string, number, boolean) sont inférés à partir des valeurs. Les objets deviennent des interfaces imbriquées, et les tableaux sont typés comme Type[]. Les propriétés optionnelles sont marquées avec ? lorsque le champ pourrait être manquant. Vous pouvez personnaliser le nom de l'interface racine et choisir entre la syntaxe interface ou alias de type. Le TypeScript généré est correctement formaté avec indentation et prêt à copier dans votre projet. Toute l'inférence de type s'exécute dans votre navigateur.","p3":"Les développeurs intégrant des API tierces collent des réponses d'exemple pour générer des définitions de type sans transcrire manuellement les structures imbriquées. Les équipes migrant des projets JavaScript vers TypeScript convertissent les objets de configuration en interfaces pour la sécurité de type. Les ingénieurs backend partagent les formats de réponse d'API avec les équipes frontend en fournissant des interfaces TypeScript générées à partir de données réelles. Les développeurs travaillant avec des applications riches en JSON (comme Firebase ou Contentful) amorcent les fichiers de type pour activer l'autocomplétion et détecter les erreurs.","p4":"Les données d'exemple doivent être représentatives—si un champ peut être null ou un type différent, incluez plusieurs exemples ou éditez manuellement la sortie. Les tableaux contenant des types mixtes (comme [1, \"deux\", true]) génèrent des types union ; considérez si l'API le permet réellement ou si votre échantillon est défectueux. Les champs optionnels (présents dans certaines réponses, absents dans d'autres) nécessitent une annotation manuelle—l'outil ne peut pas inférer l'optionalité à partir d'un seul exemple. Utilisez les assertions const pour les types littéraux lorsque vous voulez \"success\" plutôt que string. Vérifiez toujours les interfaces générées par rapport à la documentation réelle de l'API."}