{"p2":"Collez un jeton JWT dans le champ de saisie et l'outil le divise immédiatement en trois parties : en-tête, charge utile et signature. Chaque section se décode depuis Base64 et s'affiche comme JSON formaté montrant toutes les revendications et métadonnées. La section de charge utile met en évidence les revendications standard comme l'émetteur, l'expiration et les heures d'émission. Si le jeton inclut une revendication d'expiration, l'outil indique s'il est expiré, valide ou pas encore actif. La portion de signature s'affiche comme une chaîne Base64 car sa vérification nécessite la clé secrète. Tout le décodage se fait dans votre navigateur sans envoyer le jeton à aucun serveur.","p3":"Les développeurs frontend inspectent les jetons JWT stockés dans le localStorage du navigateur pour déboguer les problèmes d'authentification et vérifier le contenu des revendications. Les ingénieurs backend examinent les jetons renvoyés par les fournisseurs OAuth pour comprendre quelles informations utilisateur sont incluses. Les auditeurs de sécurité analysent les jetons JWT pendant les tests de pénétration pour rechercher des fuites de données sensibles dans les revendications. Les développeurs d'applications mobiles décodent les jetons des réponses d'API pour dépanner les problèmes de gestion de session.","p4":"Décoder un JWT ne vérifie pas sa signature, donc un jeton décodé pourrait toujours être invalide ou falsifié—vérifiez toujours les signatures côté serveur avant de faire confiance aux revendications. Vérifiez la revendication d'expiration (exp) dans la charge utile ; les jetons expirés devraient être rejetés même s'ils se décodent avec succès. Recherchez des informations sensibles dans la charge utile comme des mots de passe ou PII, qui ne devraient jamais être dans les JWT car ils sont seulement encodés, pas chiffrés. Le champ 'alg' dans l'en-tête vous dit quel algorithme a signé le jeton ; 'none' est un signal d'alarme de sécurité indiquant que le jeton n'a aucune vérification de signature."}