{"p2":"Définissez le nombre désiré de colonnes et de lignes en utilisant les contrôles de dimension, puis cliquez sur Générer la grille pour créer un tableau éditable. Tapez directement dans chaque cellule—l'outil gère automatiquement le retour à la ligne et le dimensionnement des cellules. Choisissez l'alignement gauche, centre ou droite pour chaque colonne en utilisant les boutons d'alignement. Pendant que vous éditez, le panneau de sortie Markdown se met à jour en temps réel montrant la syntaxe de tableau correctement formatée. Copiez la sortie Markdown et collez-la directement dans votre README, issue GitHub ou documentation. Le générateur produit des tableaux de style pipe compatibles avec GitHub Flavored Markdown. Toute la génération se fait localement dans votre navigateur.","p3":"Les mainteneurs open source créent des matrices de comparaison pour les fichiers README listant les fonctionnalités de framework à travers les versions. Les rédacteurs techniques construisent des tableaux de données structurées pour la documentation API sans mémoriser la syntaxe de pipes et traits d'union. Les étudiants formatent les données de recherche en tableaux pour les articles de blog GitHub Pages. Les développeurs documentent les matrices de cas de test montrant les combinaisons entrée/sortie pour les spécifications de fonctions dans les wikis basés sur markdown.","p4":"Utilisez des lignes d'en-tête pour les titres de colonnes et assurez-vous qu'ils sont significatifs—les lecteurs d'écran et analyseurs s'appuient dessus pour le contexte. Définissez l'alignement avant d'entrer les données pour prévisualiser comment les nombres ou texte apparaîtront dans la sortie rendue. Gardez le contenu des cellules concis ; un texte excessivement long dans les cellules de tableau casse la mise en page dans de nombreux moteurs de rendu Markdown. Si vous avez besoin d'un formatage complexe dans les cellules (comme du code en ligne), testez d'abord la sortie rendue dans votre plateforme cible. Enregistrez les structures de tableaux courantes comme modèles en copiant le Markdown brut pour réutilisation."}