{"p2":"Téléchargez n'importe quelle image de votre appareil en cliquant sur la zone de téléchargement ou en faisant glisser et en déposant un fichier. L'outil analyse les données de pixels en utilisant les algorithmes de clustering k-means pour identifier les couleurs les plus dominantes et représentatives de votre image, extrayant généralement 5-8 teintes clés qui capturent l'essence de couleur de l'image. Chaque couleur extraite s'affiche avec son code hex, et vous pouvez cliquer sur n'importe quel échantillon pour copier la valeur instantanément. Cela facilite la création de schémas de couleurs inspirés par les photographies, l'art ou l'imagerie de marque. Tous les traitements d'image se font dans votre navigateur.","p3":"Les designers de marque extraient les palettes de la photographie de produits pour assurer que les schémas de couleurs du site Web s'harmonisent parfaitement avec les images héros. Les décorateurs d'intérieur téléchargent les photos de pièces pour identifier les couleurs existantes dans les meubles et le décor, puis construisent des schémas complémentaires. Les gestionnaires de médias sociaux créent des graphiques de marque en extrayant les couleurs de la photographie de logo ou de campagne. Les développeurs Web construisant des thèmes pour les portefeuilles de photographie extraient les palettes des images en vedette.","p4":"Les images avec de nombreuses couleurs peuvent extraire des teintes boueuses ou excessivement similaires — pour des palettes plus propres, téléchargez les images avec des régions de couleur distinctes ou des palettes limitées. L'algorithme pondère les couleurs par zone, donc les couleurs d'arrière-plan dominantes apparaissent plus en évidence que les petits détails d'accent. Recadrez votre image avant le téléchargement pour vous concentrer sur les régions de couleur spécifiques si vous voulez une palette. L'éclairage affecte les couleurs extraites de manière significative ; une photo en plein air à l'heure dorée produit des teintes plus chaudes. Combinez les palettes extraites avec le générateur d'harmonie pour s'étendre au-delà des couleurs d'image littérales."}