{"p2":"Choisissez votre couleur de base à l'aide du sélecteur de couleur ou entrez une valeur hex, puis sélectionnez l'une des six règles d'harmonie des couleurs : complémentaire pour le contraste élevé, analogue pour les transitions fluides, triadique pour la vibrante équilibrée, split-complémentaire pour le contraste sophistiqué, tétradique pour les schémas complexes ou monochromatique pour les variations élégantes à une seule teinte. Le générateur affiche instantanément votre palette avec toutes les valeurs de couleur en formats hex, RGB et HSL. Cliquez sur n'importe quelle couleur pour copier sa valeur, ou utilisez la fonction de verrouillage pour préserver les couleurs en régénérant le reste. Le traitement se fait entièrement dans votre navigateur.","p3":"Les designers de marque établissant des systèmes d'identité visuels utilisent des schémas triadiques ou tétradiques pour créer des palettes complètes avec les couleurs primaires, secondaires et d'accent. Les décorateurs d'intérieur s'appuient sur les palettes analogues lors de la sélection de peintures, de tissus et de décor qui s'harmonisent naturellement. Les développeurs Web construisant des interfaces en mode sombre utilisent les schémas monochromatiques d'une couleur de base pour générer des teintes cohérentes. Les créateurs de présentation utilisent les schémas complémentaires pour que les points de données clés ressortent.","p4":"Les couleurs complémentaires (opposées sur la roue chromatique) fournissent le contraste maximal mais peuvent vibrer désagréablement lorsqu'elles sont placées côte à côte à saturation complète — réduisez l'intensité pour un meilleur équilibre. Les schémas analogues fonctionnent mieux lorsque vous désignez une couleur comme dominante et utilisez les autres comme accents dans les proportions 60-30-10. Les palettes triadiques se sentent plus équilibrées lorsqu'une couleur domine tandis que les deux autres jouent les rôles d'appui. Avant de finaliser n'importe quelle palette, testez-la avec le vérificateur de contraste pour assurer la lisibilité du texte. Exportez les palettes réussies en tant que variables CSS ou jetons de conception."}