{"p2":"Ajustez le curseur de longueur pour définir combien de caractères votre mot de passe devrait contenir, les mots de passe plus longs fournissant exponentiellement plus de sécurité. Sélectionnez les cases de jeu de caractères pour inclure des lettres majuscules, minuscules, chiffres et symboles dans le mot de passe généré. Cliquez sur Générer pour créer un mot de passe cryptographiquement aléatoire en utilisant l'API Web Crypto du navigateur, qui fournit une vraie aléa plutôt que des motifs pseudo-aléatoires prévisibles. Le compteur de force évalue votre mot de passe en temps réel basé sur la longueur et la diversité des caractères. Copiez le mot de passe généré en un clic.","p3":"Les utilisateurs créant de nouveaux comptes en ligne génèrent des mots de passe forts qui répondent aux exigences du site pour la longueur et les types de caractères. Les administrateurs informatiques créent des mots de passe temporaires pour les nouveaux comptes employés qui sont suffisamment aléatoires pour résister aux attaques de devinettes. Les développeurs générant des clés API ou jetons secrets utilisent ceci pour créer des chaînes aléatoires pour les systèmes d'authentification. Les personnes soucieuses de la sécurité qui renouvellent leurs mots de passe trimestriellement génèrent de nouveaux mots de passe uniques pour chaque service pour éviter de réutiliser les identifiants.","p4":"Visez au moins 16 caractères pour les comptes critiques comme l'e-mail ou la banque, même si le site permet des mots de passe plus courts. Activez tous les types de caractères sauf si le service interdit explicitement les symboles, ce que font malheureusement certains systèmes hérités. Stockez les mots de passe générés dans un gestionnaire de mots de passe immédiatement plutôt que de les écrire ou de compter sur la mémoire. Si vous générez des mots de passe pour plusieurs comptes, créez-en un différent pour chaque service ; utiliser le même mot de passe sur tous les sites signifie qu'une brèche compromet tous les comptes. Pour une sécurité maximale, combinez un mot de passe généré avec l'authentification à deux facteurs."}