{"p2":"Tapez votre texte, URL ou toute donnée de chaîne dans le champ de saisie. Le code QR se génère immédiatement dans la zone d'aperçu pendant que vous tapez. Ajustez le curseur de taille pour changer les dimensions de sortie de petit à grand. Utilisez le menu déroulant de correction d'erreur pour définir le niveau de récupération—des niveaux plus élevés permettent au code QR de scanner correctement même s'il est partiellement endommagé ou sale. Personnalisez les couleurs de premier plan et d'arrière-plan en utilisant les sélecteurs de couleur, bien qu'un contraste élevé entre eux assure une meilleure fiabilité de scan. Cliquez sur télécharger pour enregistrer le code QR comme image PNG. Toute la génération se fait dans votre navigateur en utilisant la bibliothèque qrcode.js.","p3":"Les propriétaires de restaurants génèrent des codes QR liant aux menus numériques, les imprimant sur des chevalets de table pour que les clients puissent naviguer sans menus physiques. Les organisateurs d'événements créent des codes QR contenant des adresses de lieux ou des URL d'inscription pour les affiches et confirmations par e-mail. Les commerces de détail intègrent des codes QR sur les emballages de produits qui lient aux instructions de configuration ou offres promotionnelles. Les enseignants génèrent des codes QR pour les liens de soumission de devoirs ou ressources de classe, les imprimant sur les feuilles de travail pour que les étudiants puissent rapidement accéder aux matériaux sur leurs appareils.","p4":"Utilisez une correction d'erreur élevée (30 pour cent) si le code QR sera imprimé sur des surfaces texturées ou affiché en extérieur où il pourrait accumuler saleté ou dommage. Testez le scan de votre code QR généré avec plusieurs téléphones et applications avant l'impression en masse pour assurer la compatibilité entre appareils. Pour les URL, utilisez d'abord un raccourcisseur de lien pour créer des codes QR plus petits qui sont plus faciles à scanner ; moins de points de données signifie des pixels plus grands et un meilleur scan à distance. Restez avec fond noir et arrière-plan blanc sauf si la marque exige absolument des couleurs—certaines applications de scan ont des difficultés avec des combinaisons de couleurs à faible contraste ou non conventionnelles."}