{"p2":"Collez votre requête SQL dans l'éditeur et choisissez entre les modes embellir ou minifier. Le mode embellir ajoute une indentation appropriée, sépare les clauses sur des lignes distinctes et convertit automatiquement les mots-clés en majuscules pour la cohérence. Le mode minifier fait l'opposé, compressant votre requête sur une seule ligne en supprimant l'espace excédentaire tout en préservant la fonctionnalité. L'outil supporte SELECT, INSERT, UPDATE, DELETE, CREATE TABLE et autres instructions SQL courantes. Tout le formatage se fait dans votre navigateur, donc vos requêtes de base de données ne quittent jamais votre appareil.","p3":"Les administrateurs de bases de données utilisent ceci lors du travail avec des requêtes extraites des logs d'application ou SQL généré par ORM qui manque de formatage. Les développeurs préparant du SQL pour les revues de code trouvent l'embellisseur essentiel pour rendre lisibles les jointures complexes et sous-requêtes. Les équipes avec des normes de codage exigeant des mots-clés en majuscules s'appuient sur la fonctionnalité d'auto-capitalisation. Lors de l'intégration de SQL dans des fichiers de configuration ou requêtes API où l'espace compte, le minifieur réduit la taille de charge utile sans affecter l'exécution de la requête.","p4":"Embellissez toujours les requêtes avant de les committer au contrôle de version—les diffs deviennent significatifs lorsque le formatage est cohérent. Pour déboguer les requêtes lentes, le SQL formaté facilite l'identification des index manquants ou sous-requêtes inefficaces dans les plans d'exécution. Lors de la copie de SQL formaté dans un e-mail ou documentation, utilisez des polices monospace pour préserver l'indentation. Si la sortie de votre formateur semble incorrecte, vérifiez les parenthèses non appariées ou les points-virgules manquants dans la requête originale. Utilisez le minifieur stratégiquement pour les clauses WHERE de production dans les URL, mais gardez les versions de développement embellies."}