{"p2":"Collez ou tapez du texte dans la zone de saisie et sélectionnez les opérations dans les boutons de formatage disponibles. Vous pouvez supprimer les espaces supplémentaires pour nettoyer le texte désordonné, trier les lignes alphabétiquement ou numériquement, éliminer les lignes dupliquées ou ajouter des numéros de ligne à chaque rangée. Les options supplémentaires vous permettent d'ajouter des préfixes ou suffixes personnalisés à chaque ligne, changer la casse en majuscules ou minuscules et supprimer les espaces de début ou de fin. Plusieurs opérations peuvent être appliquées en séquence. Le résultat formaté apparaît dans une boîte de sortie séparée que vous pouvez copier en un clic.","p3":"Les programmeurs nettoyant des fichiers de données basés sur listes utilisent ceci pour supprimer les imports dupliqués ou entrées de configuration. Les rédacteurs travaillant avec des transcriptions appliquent des transformations de casse et suppriment l'espacement supplémentaire de la sortie de reconnaissance vocale qui tend à être formatée de manière incohérente. Les administrateurs système trient les entrées de fichiers de logs ou listes de configuration alphabétiquement pour repérer les valeurs aberrantes ou comparer manuellement deux configurations. Les commis à la saisie de données ajoutent des préfixes comme des puces ou numérotation aux listes avant de coller dans les documents.","p4":"Lors du tri de lignes contenant des nombres, vérifiez si vous avez besoin d'un tri alphabétique ou numérique ; '10' vient avant '2' alphabétiquement mais après numériquement. Avant de supprimer les doublons, considérez si la casse importe pour votre cas d'usage et normalisez d'abord la casse si nécessaire. Utilisez la fonctionnalité préfixe/suffixe pour envelopper rapidement chaque ligne entre guillemets ou syntaxe de tableau lors de la préparation de données pour le code. Enregistrez les flux de formatage fréquemment utilisés comme signets de navigateur avec un nom descriptif pour répéter rapidement les transformations multi-étapes."}