{"p2":"L'outil affiche une horloge en direct montrant l'horodatage Unix actuel en secondes et millisecondes, se mettant à jour toutes les secondes. Entrez n'importe quel horodatage Unix dans le champ de conversion pour voir la date et l'heure lisibles correspondantes dans votre fuseau horaire local. Inversement, sélectionnez une date et une heure en utilisant le sélecteur datetime pour obtenir instantanément son équivalent d'horodatage Unix. Basculez entre les formats secondes et millisecondes selon que votre système utilise le temps Unix standard ou les horodatages de style JavaScript. Toutes les conversions se calculent dans votre navigateur en utilisant l'objet Date de JavaScript.","p3":"Les développeurs backend déboguent les fichiers de logs contenant des horodatages Unix en les convertissant en dates lisibles pour comprendre les séquences d'événements. Les administrateurs de bases de données travaillant avec des colonnes SQL TIMESTAMP convertissent entre les entiers Unix et les chaînes de date ISO pour les requêtes. Les ingénieurs API testent les réponses de points de terminaison contenant des horodatages en vérifiant que les valeurs Unix correspondent aux dates et heures attendues. Les administrateurs système enquêtant sur les logs serveur traduisent les horodatages Unix en dates humaines pour corréler les événements à travers différents systèmes de journalisation.","p4":"Rappelez-vous que les horodatages Unix sont toujours en UTC, donc lors de la conversion au format lisible humain, considérez les décalages de fuseau horaire si votre application affiche les heures locales. Les horodatages JavaScript utilisent des millisecondes tandis que la plupart des systèmes backend utilisent des secondes, donc multipliez ou divisez par 1000 selon le cas. Lors du stockage des horodatages dans les bases de données, préférez les horodatages Unix entiers aux dates en chaîne pour une indexation efficace et un stockage indépendant du fuseau horaire. Si vous obtenez des dates invalides, vérifiez si votre horodatage est en secondes ou millisecondes ; coller un horodatage basé sur les secondes dans un champ de millisecondes produira une date en 1970."}