{"p2":"Entrez votre clé secrète TOTP (généralement fournie comme chaîne encodée en Base32 lorsque vous configurez l'authentification à deux facteurs) et cliquez sur Générer. L'outil calcule le mot de passe unique actuel basé sur le temps de 6 chiffres en utilisant l'algorithme TOTP avec HMAC-SHA1 et des pas de temps de 30 secondes. Un compte à rebours montre combien de secondes restent avant que le code expire et qu'un nouveau se génère. Les codes générés correspondent à ceux des applications d'authentification comme Google Authenticator ou Authy lors de l'utilisation de la même clé secrète. Tous les calculs s'exécutent localement dans votre navigateur en utilisant l'API Web Crypto.","p3":"Les développeurs testant les systèmes d'authentification TOTP génèrent des codes manuellement pour vérifier que leur logique de validation côté serveur fonctionne correctement. Les utilisateurs qui ont perdu l'accès à leur application d'authentification mais ont sauvegardé leurs clés secrètes utilisent ceci pour générer des codes et regagner l'accès au compte. Les ingénieurs de sécurité auditent les implémentations TOTP en générant des codes attendus et en les comparant à ce que le système accepte. Les développeurs backend résolvent les problèmes de synchronisation temporelle en générant des codes à des horodatages spécifiques pour tester la tolérance de dérive.","p4":"Les codes TOTP ne sont valides que pour une fenêtre de temps étroite (généralement 30 secondes), donc assurez-vous que votre horloge système est précise ou les codes ne valideront pas. Les clés secrètes sont insensibles à la casse mais ne doivent pas contenir d'espaces ou de tirets ; supprimez le formatage si vous avez copié d'une source qui inclut des séparateurs. Enregistrez votre clé secrète quelque part en sécurité ; si vous la perdez et votre application d'authentification, vous aurez besoin de la récupération de compte. La plupart des systèmes acceptent les codes de la fenêtre temporelle actuelle et précédente pour tenir compte de la dérive d'horloge et de la vitesse de frappe de l'utilisateur. Cet outil est compatible avec le standard TOTP RFC 6238, donc les codes fonctionnent avec tout service conforme."}