{"title":"RGB vs HEX vs HSL: Guía Completa de Formatos de Color en CSS","excerpt":"Domina los formatos de color RGB, HEX y HSL.","s1":{"h":"Entender los modelos de color","p":"Los formatos de color representan cómo definimos los colores en diseño digital y código. RGB (Red, Green, Blue), HEX (Hexadecimal) y HSL (Hue, Saturation, Lightness) describen los mismos colores pero usan diferentes modelos matemáticos. Entender estos modelos te ayuda a trabajar de forma más eficiente y comunicar las elecciones de color con claridad.\n\nRGB es un modelo de color aditivo basado en cómo las pantallas producen luz combinando rojo, verde y azul. HEX es simplemente una notación diferente para RGB usando números hexadecimales. HSL es un modelo de color cilíndrico que describe los colores en términos más intuitivos para los humanos. Los tres son totalmente compatibles con CSS moderno y pueden representar los mismos 16.7 millones de colores (profundidad de color de 24 bits). La elección entre ellos afecta la legibilidad del código, la facilidad de manipulación y la eficiencia del flujo de trabajo."},"s2":{"h":"RGB: El modelo de color de pantalla","p":"RGB expresa los colores usando tres valores que representan la intensidad de luz roja, verde y azul, cada uno en un rango de 0 a 255. El rojo puro es rgb(255, 0, 0), el azul puro es rgb(0, 0, 255), y el blanco es rgb(255, 255, 255) donde todos los canales están al máximo. El negro es rgb(0, 0, 0) con todos los canales apagados.\n\nLos valores RGB corresponden directamente a cómo funcionan las pantallas, mezclando luz para producir colores. Esto hace que RGB sea intuitivo cuando se piensa en la tecnología de visualización de pantallas. CSS admite las funciones rgb() y rgba(), donde la 'a' añade un canal alfa para transparencia (0 a 1). Por ejemplo, rgba(255, 0, 0, 0.5) es rojo semitransparente. RGB es fácil de entender para programadores cómodos con valores numéricos y funciona bien cuando necesitas manipular canales de color individuales programáticamente. Sin embargo, crear variaciones de color como \"una versión más clara de este azul\" requiere cálculos mentales o herramientas."},"s3":{"h":"HEX: La abreviatura del desarrollador","p":"Los códigos de color HEX representan valores RGB en notación hexadecimal, usando números base-16 (0-9 y A-F). Un color HEX comienza con # seguido de seis caracteres: dos para rojo, dos para verde, dos para azul. #FF0000 es rojo puro (FF=255 en decimal), #0000FF es azul puro, #FFFFFF es blanco y #000000 es negro.\n\nLos códigos HEX pueden acortarse a tres caracteres cuando cada canal de color tiene dígitos duplicados: #F00 equivale a #FF0000. Esta abreviatura es común para colores como #FFF (blanco) o #000 (negro). HEX es la notación de color más compacta y ha sido el estándar tradicional en desarrollo web. Es fácil de copiar y pegar, y herramientas como selectores de color suelen generar códigos HEX. Sin embargo, HEX no admite transparencia en CSS (aunque algunas herramientas de diseño usan códigos HEX de ocho caracteres con canal alfa). Los valores HEX son más difíciles de leer y ajustar mentalmente que RGB o HSL, haciéndolos menos intuitivos para crear variaciones de color."},"s4":{"h":"HSL: La elección del diseñador","p":"HSL describe los colores usando Hue (Matiz), Saturation (Saturación) y Lightness (Luminosidad). Hue es el tipo de color (0-360 grados en una rueda de color: 0/360 es rojo, 120 es verde, 240 es azul). Saturation es la intensidad del color (0% es gris, 100% es color completo). Lightness es el brillo (0% es negro, 50% es color puro, 100% es blanco).\n\nHSL coincide con cómo los diseñadores piensan sobre el color. Para hacer un color más claro, aumentas el valor de luminosidad. Para hacerlo más vibrante, aumentas la saturación. Para cambiar el matiz, ajustas los grados del matiz. Esto hace que HSL sea increíblemente poderoso para crear esquemas de color y variaciones. Por ejemplo, hsl(240, 100%, 50%) es azul puro; hsl(240, 100%, 75%) es un azul más claro; hsl(240, 50%, 50%) es un azul menos saturado. CSS admite hsla() para transparencia. HSL es perfecto para generar paletas de color programáticamente, crear efectos hover ajustando la luminosidad y mantener relaciones de color consistentes en un sistema de diseño."},"s5":{"h":"Convertir entre formatos de color","p":"Convertir entre estos formatos es sencillo con herramientas, pero útil de entender conceptualmente. HEX a RGB es simple: convierte cada par de dígitos hexadecimales a decimal. #FF5733 se convierte en rgb(255, 87, 51) donde FF=255, 57=87, 33=51. RGB a HEX invierte este proceso, convirtiendo decimal a hexadecimal.\n\nRGB a HSL es más complejo, implica encontrar los valores RGB máximo y mínimo, calcular la luminosidad, luego la saturación, luego el matiz basándose en qué canal es dominante. HSL a RGB requiere fórmulas diferentes dependiendo del rango de matiz. En lugar de hacer estos cálculos manualmente, usa herramientas como el conversor de color de Tuttilo para cambiar entre formatos al instante. Herramientas de diseño como Figma y Adobe XD muestran los tres formatos simultáneamente. Las herramientas de desarrollo del navegador te permiten hacer clic en valores de color para alternar entre formatos RGB, HEX y HSL. CSS moderno también admite color-mix() y sintaxis de color relativa para crear variaciones sin conversión manual."},"s6":{"h":"Cuándo usar cada formato","p":"Usa HEX cuando quieras códigos de color concisos y portátiles que se copien y peguen fácilmente. HEX es estándar en entregas de diseño y guías de estilo. Es perfecto para colores estáticos que no serán manipulados programáticamente. Usa HEX para colores de marca, especificaciones exactas de color y cuando trabajas con diseñadores que prefieren este formato.\n\nUsa RGB cuando trabajes con JavaScript o necesites transparencia. La función rgba() tiene soporte históricamente más amplio que HEX con alfa. RGB también es más claro cuando manipulas colores programáticamente, ya que puedes ajustar valores de canal directamente. Usa RGB para cálculos, procesamiento de imágenes o cuando interfaz con bibliotecas gráficas.\n\nUsa HSL cuando crees sistemas de color, temas o variaciones de color dinámicas. HSL hace trivial generar versiones más claras/oscuras, crear colores complementarios o ajustar la saturación en una paleta. Usa HSL para variables CSS en sistemas de diseño, donde puedes definir matiz y saturación base mientras varías la luminosidad para diferentes estados de interfaz. HSL es ideal para sistemas de color accesibles, ya que puedes asegurar suficiente contraste de luminosidad matemáticamente. Para desarrollo web moderno con temas dinámicos o manipulación de color, HSL es a menudo la opción más mantenible."}}