{"p2":"Upload an image or select colors from your design palette, then choose which type of color vision deficiency to simulate: protanopia (red-blindness), deuteranopia (green-blindness), tritanopia (blue-blindness), protanomaly (reduced red sensitivity), deuteranomaly (reduced green sensitivity), or tritanomaly (reduced blue sensitivity). The tool applies mathematical transformations that accurately model how these conditions affect color perception. Compare the simulated view side-by-side with the original to identify problematic color combinations that would be indistinguishable to affected users. All processing happens locally in your browser for privacy.","p3":"UI designers test whether critical interface elements like error states (traditionally red) and success messages (typically green) remain distinguishable to colorblind users before finalizing designs. Data visualization specialists verify that chart colors, graph lines, and heat maps communicate information through patterns or labels in addition to color coding. Infographic creators ensure icons, callouts, and category distinctions don't rely solely on color differences that disappear under color vision deficiency. Game developers test whether gameplay mechanics dependent on color recognition (like wire matching or enemy identification) remain playable for colorblind players.","p4":"Deuteranomaly (reduced green sensitivity) affects roughly 6% of males and is the most common form — always test against this variant at minimum. Avoid red-green combinations entirely since protanopia and deuteranopia both confuse these hues; use blue-orange pairings instead for better accessibility. Don't rely on color alone to convey information — supplement with patterns, shapes, icons, or text labels. Tools like this simulator aren't perfect since they approximate rather than replicate the actual experience, but they catch most major issues. Combine simulation testing with contrast ratio checking for comprehensive accessibility validation."}