{"p2":"Adjust margin sliders to trim white space or remove unwanted borders from all pages simultaneously, creating a more compact document with larger content relative to page size. The visual preview shows exactly what area will be retained, letting you fine-tune crop boundaries before applying changes. This is especially useful for PDFs that were scanned with excessive margins or documents where binding margins need removal for digital distribution. All cropping calculations happen in your browser, keeping documents containing sensitive diagrams or proprietary content private on your device during the margin adjustment process.","p3":"Architects crop construction drawings to remove title block margins when sending detail views to subcontractors who only need specific sections. Students trim scanned textbook pages to eliminate page numbers and headers, maximizing content size for tablet reading. Graphic designers crop presentation PDFs to remove placeholder margins added during template creation. Researchers crop journal article scans to eliminate library watermarks and binding margins for cleaner personal reference files. Publishers crop submitted manuscript PDFs to remove author contact information and metadata before sending to anonymous peer reviewers.","p4":"Preview the crop on several representative pages before applying to ensure you're not accidentally trimming important content from pages with varying layouts. For documents with intentional margin differences across pages (like wider binding edges), cropping uniformly may cut off content on some pages while leaving excess margin on others. If you need to crop different pages differently, consider splitting the PDF first, cropping sections separately, then merging them back together. Leave slightly more margin than the minimum to account for printer tolerances if the cropped PDF will eventually be printed. Check that page numbers, footnotes, or headers aren't positioned in margins you're removing—they'll disappear after cropping."}