{"p2":"Enter your store name, address, and phone number at the top of the receipt. Add items to the receipt by specifying the product name, quantity, and price per unit—the tool calculates line totals automatically. Select your applicable tax rate from the dropdown. Choose the payment method (cash, card, or other) and enter the amount paid to automatically calculate change due. The receipt displays the current date and time. Once complete, preview the formatted receipt in a classic thermal printer style, then print it using your browser's print function. All calculations happen instantly in your browser.","p3":"Small retail shops generate receipts for cash transactions when their POS system is down or unavailable. Garage sale organizers provide professional-looking receipts to buyers for record-keeping. Market vendors document sales for customers who need proof of purchase. Handmade goods sellers at craft fairs create receipts that add credibility to their transactions. Property managers document security deposit returns with itemized deductions. Parents create mock receipts for teaching children about money, prices, and change calculation in a hands-on way.","p4":"For authenticity, include your business tax ID or registration number in the store information section. Use precise pricing (e.g., $3.99 instead of $4) to match real retail scenarios. When generating receipts for record-keeping, save or screenshot them immediately since the browser doesn't store your data between sessions. For teaching purposes, use realistic item names and prices from actual stores to make the learning experience relatable. Print on standard thermal paper (if available) or regular paper cut to size for a more realistic appearance.","p5":"The receipt layout mimics traditional thermal printer output with monospace fonts and a narrow column width. Line item totals are calculated by multiplying quantity by unit price with two decimal precision. Tax is computed as a percentage of the subtotal and rounded to the nearest cent using banker's rounding. The change calculation subtracts the total (with tax) from the amount tendered. Date and time display in local format based on the browser's locale settings. Print styles ensure clean output without browser headers or footers."}