{"p2":"Paste a PEM-encoded X.509 certificate into the text area—this includes the lines starting with \"-----BEGIN CERTIFICATE-----\" and ending with \"-----END CERTIFICATE-----\". Click decode, and the tool parses the certificate's ASN.1 DER structure to extract all fields: issuer, subject, validity dates (not before/not after), serial number, signature algorithm, public key algorithm and size, subject alternative names (SANs), and key usage extensions. The information is displayed in a human-readable format with labeled fields. Use this to inspect certificates from servers, certificate files, or chain bundles without installing OpenSSL or other command-line tools.","p3":"System administrators verify certificate details before installing them on web servers to catch configuration errors. Security engineers audit certificate chains to identify weak signature algorithms or short key lengths. Developers debug SSL/TLS issues by examining certificate properties like SANs and expiration dates. DevOps teams validate that new certificates match the intended domains and organizational details. Certificate authorities use decoders to verify certificate generation before issuance. Compliance auditors check that certificates meet organizational standards for key size and validity period.","p4":"Always verify the certificate's validity period—certificates issued for more than 398 days won't be trusted by modern browsers. Check that Subject Alternative Names (SANs) include all domains the certificate will serve, including www and non-www variants. Ensure the signature algorithm is SHA-256 or stronger—SHA-1 is deprecated and will cause browser warnings. RSA keys should be at least 2048 bits; 4096 bits provides better future-proofing. Look for critical extensions like Extended Key Usage (EKU) that may restrict the certificate's use cases. For internal testing, self-signed certificates work, but production always requires a trusted CA.","p5":"The decoder parses PEM format by stripping the header/footer lines and base64-decoding the content to obtain raw DER bytes. DER parsing follows ASN.1 encoding rules to extract tag-length-value structures. The certificate structure is parsed according to the X.509 v3 specification with fields like issuer, subject (Distinguished Names), validity (UTCTime or GeneralizedTime), and extensions. Subject Alternative Names are extracted from the v3 extensions field. Public key information includes algorithm identifier (RSA, ECDSA) and key size in bits. All date/time values are converted from ASN.1 time formats to human-readable strings."}