{"p2":"Choose the number of wave layers (1-4), adjust the wave height and smoothness sliders, then select colors for each layer using the gradient picker. The preview updates in real-time as you modify parameters. Wave patterns can be positioned at the top or bottom of the image, making them ideal for section dividers. The smoothness control affects how organic versus geometric the waves appear. Once satisfied with your design, copy the SVG code directly or download it as an SVG file. The generated code is clean and optimized for web use with minimal file size.","p3":"Web designers add visual interest to hero sections, footers, and content dividers without using heavy image files. Landing page builders create unique backgrounds for call-to-action sections that load instantly. Marketing teams generate on-brand wave patterns matching their color schemes for email templates and social graphics. Portfolio websites use layered waves to separate project sections with smooth transitions. Presentation designers export waves as SVG for scalable slide backgrounds. Developers integrate the SVG code directly into HTML for the fastest loading times and perfect scaling across devices.","p4":"Use multiple layers with subtle opacity differences to create depth perception in your waves. For smooth color transitions, pick hues that are adjacent on the color wheel rather than contrasting primaries. Export as SVG rather than converting to PNG to maintain perfect quality at any viewport width. When using waves as section dividers, set the background color of the next section to match the bottom wave layer for seamless integration. Adjust wave height relative to viewport units in your CSS for responsive designs that maintain proportions across screen sizes.","p5":"The generator uses cubic Bezier curves to create smooth, organic wave shapes that scale perfectly at any resolution. Each layer is rendered as a separate SVG path element with optional gradient fills. The tool supports alpha transparency in colors for overlapping wave effects. Generated SVG code follows web standards and is compatible with all modern browsers. File sizes typically range from 1-3KB depending on the number of layers, making waves extremely efficient compared to raster images."}