{"p2":"To hide a message, enter your normal-looking cover text in the first field and your secret message in the second. Click encode, and the tool embeds your secret into the cover text using zero-width Unicode characters (ZWSP, ZWJ, ZWNJ) that are invisible but preserved when the text is copied. The resulting text looks identical to the original but contains hidden data. To reveal a message, paste text that you suspect contains hidden content and click decode. If steganographic data is present, the secret message will be extracted and displayed. All encoding and decoding happens in your browser using Unicode character manipulation.","p3":"Privacy activists share sensitive information in plain sight by embedding coordinates or contact details in public messages. Social media users watermark their original content with hidden authorship tags to prove ownership if reposted. Journalists hide source identifiers in published articles as insurance against leaked documents. Developers embed metadata or copyright info in code comments using invisible characters. Whistleblowers communicate through seemingly innocuous messages on monitored platforms. Students hide cheat sheets in allowed materials using invisible text for exams (though we don't recommend this).","p4":"The hidden message is fragile—some platforms and text editors strip zero-width characters, destroying the steganography. Test your target platform by encoding and decoding a test message first. Longer cover text can hide longer secrets with better concealment. Don't rely on this for high-security communications—sophisticated analysis can detect unusual character patterns. Copy-paste the encoded text rather than retyping it to preserve the invisible characters. For maximum compatibility, keep cover text to simple ASCII or common Unicode characters.","p5":"The encoding algorithm converts each bit of the secret message to zero-width characters: 0 becomes ZWSP (U+200B) and 1 becomes ZWJ (U+200D). These characters are inserted between characters in the cover text at regular intervals. The secret message is first converted to binary using UTF-8 encoding, then each bit is mapped to a zero-width character. Decoding extracts all zero-width characters, maps them back to binary bits, then converts the binary to UTF-8 text. The tool preserves the cover text exactly while injecting invisible characters in the interstitial positions."}