{"p2":"Wählen Sie einen von acht voreingestellten Animationseffekten: Bounce, Fade-in, Slide-in (von oben/rechts/unten/links), Rotate, Pulse, Shake, Zoom-in oder Flip. Legen Sie die Animationsdauer in Sekunden fest, wählen Sie eine Timing-Funktion (linear, ease, ease-in, ease-out oder ease-in-out), die die Beschleunigung steuert, und geben Sie die Anzahl der Wiederholungen an (einmal, zweimal oder Endlosschleife). Die Vorschaubox demonstriert Ihre Animation kontinuierlich, sodass Sie Timing und Gefühl fein abstimmen können, bevor Sie sich festlegen. Kopieren Sie sowohl die CSS-Klasse als auch die @keyframes-Regel zusammen — fügen Sie beide in Ihr Stylesheet ein und wenden Sie die Klasse auf ein beliebiges Element an.","p3":"Marketing-Landingpages verwenden Fade-in-Animationen für Überschriften und Call-to-Action-Buttons, um Aufmerksamkeit zu erregen, wenn Nutzer in die Ansicht scrollen. E-Commerce-Produktseiten nutzen subtile Zoom-in-Effekte bei Bildern im Hover-Zustand, um zur Interaktion einzuladen, ohne aufdringlich zu wirken. Ladebildschirme verwenden unendliche Pulse- oder Rotate-Animationen, um Verarbeitung anzuzeigen, ohne tatsächliche Fortschrittsdaten zu benötigen. Onboarding-Flows lassen Tutorial-Karten nacheinander einschieben, um neue Nutzer durch Funktionen zu führen, ohne sie auf einmal zu überfordern.","p4":"Passen Sie Timing-Funktionen an die Animationsabsicht an: ease-out für Elemente, die in den Viewport eintreten (schneller Start, langsames Ende wirkt natürlich), ease-in für ausgehende Elemente (beschleunigt weg), und ease-in-out für Loop-Animationen. Halten Sie die Dauer kurz (0,3-0,6s) für UI-Feedback, länger (0,8-1,2s) für dekorative Effekte — alles über 2s wirkt träge. Unendliche Iterationen funktionieren für Ladeindikatoren, erschöpfen aber Nutzer bei Content-Elementen; sparsam einsetzen. Kombinieren Sie animation-delay mit animation-fill-mode: forwards, um gestaffelte Sequenzen zu erstellen, bei denen Elemente nacheinander animieren. Testen Sie auf Low-End-Geräten, da komplexe Keyframe-Animationen auf langsameren GPUs ruckeln können."}