{"p2":"Verwenden Sie die Ecken-Steuerung, um alle vier Ecken verknüpft für gleichmäßige Rundung zu bearbeiten, oder trennen Sie sie, um jede Ecke unabhängig einzustellen. Ziehen Sie den Schieberegler oder geben Sie Werte direkt ein, und wählen Sie dann Ihre bevorzugte Einheit: Pixel für feste Größen, Prozent für responsive Skalierung oder Rems für barrierefreie Größen, die Benutzer-Schrifteinstellungen respektieren. Die Vorschaubox aktualisiert sich in Echtzeit und zeigt genau, wie Ihr Element aussehen wird. Kopieren Sie das generierte CSS mit einem Klick — es enthält die vollständige border-radius-Eigenschaft mit individuellen Eckwerten, wenn diese unterschiedlich sind.","p3":"Button-Designer runden Ecken ab, um freundliche, einladende Interface-Elemente zu schaffen, die sich anfassbar anfühlen als harte rechteckige Kanten. Card-Layouts verwenden subtile Radien (4-8px) auf Content-Containern für moderne, polierte Ästhetik, die Bereiche ohne schwere Rahmen unterscheidet. Profilbilder und Avatar-Komponenten verwenden 50% border-radius, um quadratische Bilder in perfekte Kreise zu verwandeln. Design-Systeme implementieren konsistente Radius-Skalen (2px, 4px, 8px, 16px) über Komponenten hinweg, um visuelle Harmonie zu wahren, und dieses Tool hilft, jede Stufe dieser Skala zu visualisieren.","p4":"Das Setzen von border-radius auf 50% erzeugt nur dann einen perfekten Kreis, wenn das Element gleiche Breite und Höhe hat — verwenden Sie dies für Avatar-Bilder. Für pillenförmige Buttons verwenden Sie einen Radius, der der Hälfte der Button-Höhe entspricht (bei 40px Höhe verwenden Sie 20px Radius). Wenn Sie unterschiedliche Radien auf einzelne Ecken anwenden, bewahren Sie visuelle Balance, indem Sie gegenüberliegende Ecken ähnlich halten. Prozentbasierter Radius skaliert mit der Elementgröße und eignet sich ideal für responsive Komponenten, die sich an verschiedenen Breakpoints ändern. Die Kombination von border-radius mit overflow: hidden schneidet Child-Content sauber ab, essentiell beim Abrunden von Containern mit Hintergrundbildern oder verschachtelten Elementen."}