{"p2":"Fügen Sie Ihre erste Schattenebene mit der Plus-Schaltfläche hinzu und passen Sie dann horizontalen Versatz (X), vertikalen Versatz (Y), Unschärferadius und Ausbreitung mit den Schiebereglern oder direkter Eingabe an. Wählen Sie Ihre Schattenfarbe und legen Sie deren Deckkraft mit dem Alpha-Regler fest. Wechseln Sie zwischen äußeren Schatten (Standard) und Inset-Schatten für innere Glüheffekte. Fügen Sie mehrere Schattenebenen hinzu, um komplexe Tiefeneffekte zu erstellen — jede Ebene stapelt sich auf vorherige. Die Vorschau aktualisiert sich sofort, während Sie Parameter anpassen, und die CSS-Ausgabe spiegelt Ihre vollständige Schatten-Deklaration wider, bereit zum Kopieren in Ihre Stylesheets.","p3":"Kartenbasierte UI-Designer fügen subtile Schatten hinzu, um Content-Karten über Seitenhintergründe zu erheben und Hierarchie zu schaffen, die Nutzer durch die Informationsarchitektur führt. E-Commerce-Sites verwenden ausgeprägte Schatten auf Produktbildern und 'In den Warenkorb'-Buttons, damit sie anfassbar und klickbar erscheinen. Dashboard-Builder schichten mehrere Schatten mit unterschiedlichen Unschärferadien, um realistische Material-Design-Tiefenstufen zu erreichen — ein scharfer Schatten für Definition plus ein weicherer Schatten für Umgebungsbeleuchtung. Kreativagenturen gestalten dramatische Hover-Effekte durch Animieren von Schatten-Eigenschaften, sodass Interface-Elemente sich vom Seitengrund abheben, wenn Nutzer interagieren.","p4":"Schichten Sie Schatten vom größten/weichsten (unten) zum kleinsten/schärfsten (oben), um natürliche Beleuchtung nachzuahmen, bei der Umgebungslicht weiche Schatten und direktes Licht definierte Kanten erzeugt. Halten Sie Spread-Werte minimal (0-4px) — übermäßiges Spread lässt Schatten künstlich und cartoonartig wirken. Für realistische Tiefe positionieren Sie den Hauptschatten leicht unterhalb und rechts (positive X- und Y-Werte), um Licht von oben links zu simulieren, eine Konvention, die Nutzer erwarten. Inset-Schatten funktionieren wunderbar für Eingabefelder, um vertiefte Erscheinungen zu erzeugen. Verwenden Sie halbtransparentes Schwarz (rgba(0,0,0,0.1-0.3)) für die meisten Schatten statt reinem Schwarz, das hart wirkt."}