{"p2":"Geben Sie Ihr Alter, biologisches Geschlecht, aktuelles Gewicht und Größe unter Verwendung Ihres bevorzugten Einheitensystems ein. Wählen Sie Ihr Aktivitätsniveau von sitzendes Leben bis sehr aktiv basierend auf, wie viel Bewegung Sie wöchentlich machen. Tuttilo verwendet die wissenschaftlich validierte Mifflin-St Jeor-Gleichung, um Ihren Basal-Metabolischen-Rate (BMR) – die Kalorien, die Sie in Ruhe verbrennen – zu berechnen, dann multipliziert mit Ihrem Aktivitätsfaktor, um Ihren Total-Daily-Energy-Expenditure (TDEE) zu bestimmen. Die Ergebnisse zeigen Ihre Erhaltungskalorien, plus Ziele für Gewichtsverlust oder Gewichtszunahme. Ihre Gesundheitsdaten bleiben vollständig privat in Ihrem Browser.","p3":"Fitness-Enthusiasten, die neue Diätpläne starten, verwenden TDEE-Berechnungen als Grundlage zum Erstellen von Kalorienmängeln oder -überschüssen. Persönliche Trainer etablieren Kalorie-Basisziele für Kunden, bevor sie Ernährungsprogramme entwerfen. Menschen, die sich von Essstörungen erholen, arbeiten mit Therapeuten, um gesunde Kaloriebereiche für ihren Körper und Aktivitätsniveau zu verstehen. Sportler in Gewichtsklassen-Sportarten berechnen ihre Erhaltungskalorien, um Gewichtsreduktionen oder Masseaufbauten vor Wettbewerben zu planen. Personen, die unerklärliche Gewichtsveränderungen erleben, überprüfen, ob ihre Kalorienaufnahme ihrer Ausgebung entspricht.","p4":"BMR sinkt, wenn Sie Gewicht verlieren, daher neu berechnen alle 10-15 Pfund, um Plateaus von zu vielen Kalorien für Ihre neue Körpergröße zu vermeiden. Aktivitätsmultiplikatoren sind grobe Schätzungen – verfolgen Sie Ihre tatsächlichen Gewichtsveränderungen über 2-3 Wochen und passen Sie Kalorien um 200-300 an, wenn die Ergebnisse nicht den Erwartungen entsprechen. Muskel verbrennt mehr Kalorien in Ruhe als Fett, daher erhöht Kraft-Training Ihren BMR im Laufe der Zeit selbst ohne Cardio. Gehen Sie nicht unter Ihren BMR für längere Zeit, da schwere Mängel metabolische Anpassung auslösen, bei der Ihr Körper energisch Energie spart, was weitere Fettverbrennung extrem schwierig macht."}