{"p2":"Wählen Sie aus acht Form-Presets: Kreis, Ellipse, Inset-Rechteck, Dreieck, Pentagon, Hexagon, Stern oder Pfeil. Jede Form bietet anpassbare Parameter über Schieberegler — Kreis und Ellipse lassen Sie Größe und Position steuern, Inset passt an, wie viel von jeder Kante abgeschnitten wird, und Polygon-Formen haben punktspezifische Steuerungen. Die Vorschau aktualisiert sich sofort und zeigt genau, wie Ihre Form den Content maskieren wird. Kopieren Sie die generierte clip-path CSS-Eigenschaft und wenden Sie sie auf ein beliebiges Element an, um es auf Ihre benutzerdefinierte Form zuzuschneiden. Alles wird lokal für Privatsphäre verarbeitet.","p3":"Hero-Bereiche verwenden geclippte diagonale Kanten, erstellt mit Polygon-Clip-Paths, um sich von rechteckiger Monotonie zu lösen und dynamische Seitenübergänge zwischen Abschnitten zu schaffen. Profilbilder erhalten kreative Formen jenseits einfacher Kreise — Hexagone für Tech-Marken, Sterne für Gaming-Sites oder benutzerdefinierte Polygone für einzigartiges Branding. Bildgalerien clippen Hover-Overlays in interessante Formen, die Teile der darunterliegenden Bilder für interaktive Erkundung enthüllen. Infografik-Designer verwenden clip-path, um benutzerdefinierte Callout-Formen, Abzeichen und Bandeffekte zu erstellen, die reine CSS-Rechtecke nicht erreichen können.","p4":"Clip-path schneidet Content, beeinflusst aber nicht das Layout — das Element nimmt immer noch seine volle rechteckige Box ein, also planen Sie Abstände entsprechend. Für responsive Designs verwenden Sie prozentbasierte Inset-Werte statt fester Pixel, damit Formen mit der Container-Größe skalieren. Bedenken Sie, dass clip-path sowohl das Element als auch seinen Hintergrund clippt, aber nicht box-shadow, was unerwartete visuelle Artefakte erzeugen kann. Komplexe Polygon-Formen mit vielen Punkten können die Performance beeinträchtigen; vereinfachen Sie auf die minimal benötigten Punkte. Kombinieren Sie clip-path mit Transitions, um morphende Effekte zwischen Formen bei Hover oder Zustandsänderungen zu erstellen."}