{"p2":"Wählen Sie Ihre Vordergrundfarbe (Text) und Hintergrundfarbe mit den Farbwählern oder durch direktes Eingeben von Hex-Codes. Das Tool berechnet sofort das WCAG-Kontrastverhältnis und zeigt Bestehen/Nicht-Bestehen-Ergebnisse für vier verschiedene Kriterien: Level AA normaler Text (4,5:1), Level AA großer Text (3:1), Level AAA normaler Text (7:1) und Level AAA großer Text (4,5:1). Großer Text bedeutet 18pt und größer, oder 14pt und größer wenn fett. Alle Berechnungen verwenden die offizielle WCAG 2.1-Formel und laufen vollständig in Ihrem Browser für sofortiges Feedback.","p3":"Webentwickler stellen sicher, dass ihr Seitentext gesetzliche Barrierefreiheits-Anforderungen erfüllt, bevor sie starten, und vermeiden potenzielle Klagen unter ADA- oder Section 508-Vorschriften. UI-Designer überprüfen, dass Call-to-Action-Buttons ausreichenden Kontrast gegen Seitenhintergründe haben, sodass Nutzer mit eingeschränktem Sehvermögen interaktive Elemente leicht identifizieren können. Mobile-App-Entwickler testen, ob ihre Light-Mode- und Dark-Mode-Farbschemata beide AA-Standards für Nutzer in unterschiedlichen Lichtverhältnissen erfüllen. Regierungsbehörden, die öffentliche Websites erstellen, müssen in vielen Jurisdiktionen AAA-Standards erfüllen, was sorgfältige Farbwahl erfordert, die durch Kontrastprüfung validiert wird.","p4":"Streben Sie immer mindestens Level AA-Konformität an — viele Länder verlangen dies gesetzlich für Regierungs- und kommerzielle Websites. Level AAA bietet bessere Barrierefreiheit, kann aber mit Markenfarben herausfordernd sein; priorisieren Sie es für Fließtext, während AA für dekorative Elemente ausreichen kann. Denken Sie daran, dass Kontrastanforderungen für großen Text (18pt+ regular oder 14pt+ fett) versus normalen Text unterschiedlich sind. Kontrastverhältnisse gelten für alle Text-auf-Hintergrund-Szenarien einschließlich Text über Bildern, testen Sie also Overlay-Kombinationen sorgfältig. Bei Verwendung von hellem Text auf farbigen Hintergründen funktioniert reines Weiß oft besser als Off-White, da jeder Schritt weg von Weiß den Kontrast reduziert."}