{"p2":"Konfigurieren Sie Container-Eigenschaften mit den visuellen Steuerelementen: flex-direction wechselt zwischen Row- und Column-Layouts, flex-wrap bestimmt, ob Items auf einer Linie bleiben oder auf mehrere Zeilen umbrechen, justify-content richtet Items entlang der Hauptachse aus, align-items positioniert sie auf der Querachse, und gap setzt Abstände zwischen Flex-Children. Fügen Sie Vorschau-Items hinzu oder entfernen Sie sie, um zu sehen, wie sich Ihr Layout an unterschiedliche Content-Mengen anpasst. Die Live-Vorschau aktualisiert sich sofort, während Sie jede Eigenschaft anpassen, und das generierte CSS zeigt sowohl Container- als auch Item-Regeln, bereit zum Kopieren in Ihr Projekt.","p3":"Navigationsleisten verwenden Flexbox mit space-between-Justierung, um das Logo links und Menü-Items rechts zu schieben, ohne manuelle Positionierungsberechnungen. Card-Grids nutzen flex-wrap mit gap-Abstand, um responsive Galerien zu erstellen, die bei verschiedenen Bildschirmbreiten automatisch umfließen, ohne Media Queries. Formularlayouts verwenden flex-direction: column für Mobile und wechseln zu Row für Desktop, um Labels auf kleinen Bildschirmen über Inputs zu stapeln. Dashboard-Widgets richten Icons und Text mit align-items: center aus, um Content unabhängig von variierenden Texthöhen oder Icongrößen vertikal zu zentrieren.","p4":"Beginnen Sie mit justify-content für Hauptachsen-Ausrichtung (horizontal in Row, vertikal in Column) und align-items für Querachse — dieses mentale Modell verhindert Verwirrung. Verwenden Sie gap statt Margins auf Flex-Children für Abstände, da es keinen zusätzlichen Platz an Container-Kanten hinzufügt. flex-wrap: wrap ermöglicht responsives Verhalten ohne Media Queries, wenn kombiniert mit flex-basis oder min-width auf Children. Denken Sie daran, dass align-content nur mehrzeilige Flex-Container beeinflusst, nicht einzelne Zeilen. Für gleichbreite Spalten setzen Sie flex: 1 auf Children; für inhaltsbasierte Größenanpassung verwenden Sie flex: 0 1 auto, um Schrumpfen zu verhindern."}