{"p2":"Passen Sie den Unschärfe-Schieberegler an, um zu steuern, wie viel Hintergrund-Content durch Ihr Glas-Element scheint — höhere Werte erzeugen stärkere Frost-Effekte. Setzen Sie Hintergrund-Opazität, um Transluzenz zu bestimmen, Farbsättigung, um Tönung hinzuzufügen (macht Ihr Glas wärmer oder kühler), und Rahmentransparenz für das charakteristische subtile Kanten-Highlight. Die Vorschau zeigt Ihre Glaskarte gegen einen anpassbaren Gradient-Hintergrund, sodass Sie genau sehen, wie sie mit Content dahinter interagiert. Kopieren Sie das vollständige CSS einschließlich backdrop-filter, background und border-Eigenschaften, bereit für Produktionsnutzung. Alles Rendering erfolgt in Ihrem Browser.","p3":"Dashboard-Interfaces verwenden glassmorphe Panels, um Informationen über dynamische Hintergründe wie Video oder animierte Gradienten zu schichten, während Lesbarkeit erhalten bleibt. Mobile-App-Designer erstellen gefrostete Navigationsleisten und Modals, die darunterliegenden Content durchscheinen lassen, Kontext bewahrend, während Aufmerksamkeit auf Vordergrund-Elemente fokussiert wird. Landing Pages nutzen Glaskarten für Preistabellen oder Feature-Highlights, die raffinierte Tiefe hinzufügen, die sich premium und modern anfühlt. Musikplayer-Interfaces verwenden Glassmorphismus für Wiedergabesteuerungen, die Albumartwork überlagern, und schaffen visuelle Kohäsion zwischen UI und Content.","p4":"Backdrop-filter-Unschärfe funktioniert am besten zwischen 10-20px — niedrigere Werte frosten kaum, während höhere Werte Glas opak machen. Fügen Sie immer einen halbtransparenten Hintergrund-Fallback für Browser ohne backdrop-filter-Unterstützung hinzu, besonders ältere Firefox-Versionen. Glassmorphismus sieht am eindrucksvollsten gegen lebendige oder mehrfarbige Hintergründe aus; subtile Hintergründe reduzieren visuelle Wirkung. Fügen Sie einen dünnen hellen Rahmen hinzu (1px solid rgba(255,255,255,0.18)), um Kanten gegen geschäftige Hintergründe zu definieren. Performance-Tipp: backdrop-filter ist GPU-intensiv, also begrenzen Sie die Nutzung auf Hero-Bereiche oder Schlüssel-UI-Elemente, statt in gesamten Layouts anzuwenden."}