{"p2":"Wählen Sie Ihre Basisfarbe mit dem Farbwähler oder geben Sie einen Hex-Wert ein, und wählen Sie dann eine von sechs Farbharmonie-Regeln: komplementär für hohen Kontrast, analog für sanfte Übergänge, triadisch für ausgewogene Lebendigkeit, split-komplementär für raffinierte Kontraste, tetradisch für komplexe Schemata oder monochromatisch für elegante Einfarben-Variationen. Der Generator zeigt sofort Ihre Palette mit allen Farbwerten in Hex-, RGB- und HSL-Formaten an. Klicken Sie auf eine beliebige Farbe, um ihren Wert zu kopieren, oder verwenden Sie die Lock-Funktion, um Farben zu bewahren, während Sie den Rest neu generieren. Die Verarbeitung erfolgt vollständig in Ihrem Browser mit Farbtheorie-Mathematik.","p3":"Markendesigner, die visuelle Identitätssysteme etablieren, verwenden triadische oder tetradische Schemata, um umfassende Paletten mit Primär-, Sekundär- und Akzentfarben für Logos, Marketingmaterialien und digitale Eigenschaften zu erstellen. Innenarchitekten verlassen sich auf analoge Paletten bei der Auswahl von Farbe, Stoffen und Dekor, die natürlich in einem Raum harmonieren. Webentwickler, die Dark-Mode-Interfaces erstellen, verwenden monochromatische Schemata von einer Basisfarbe, um konsistente Schattierungen für Hintergründe, Panels und UI-Elemente zu generieren. Präsentationsersteller nutzen komplementäre Schemata, um wichtige Datenpunkte gegen Folienhintergründe hervorstechen zu lassen, ohne zu kollidieren.","p4":"Komplementäre Farben (gegenüber auf dem Farbrad) bieten maximalen Kontrast, können aber unangenehm vibrieren, wenn sie bei voller Sättigung nebeneinander platziert werden — reduzieren Sie die Intensität für bessere Balance. Analoge Schemata funktionieren am besten, wenn Sie eine Farbe als dominant festlegen und die anderen als Akzente in 60-30-10-Proportionen verwenden. Triadische Paletten fühlen sich am ausgewogensten an, wenn eine Farbe dominiert, während die anderen zwei unterstützende Rollen spielen. Bevor Sie eine Palette finalisieren, testen Sie sie mit dem Kontrastprüfer, um sicherzustellen, dass Textlesbarkeit WCAG-Standards erfüllt. Exportieren Sie erfolgreiche Paletten als CSS-Variablen oder Design-Tokens, um Konsistenz über Ihr gesamtes Projekt zu wahren."}