{"p2":"Geben Sie Ihren Leistungs-Wert in jeder Einheit einschließlich Watts, Kilowatts, Megawatts, Pferdestärke (mechanisch), PS (metrische Pferdestärke), BTU pro Stunde oder Fuß-Pfund pro Sekunde ein. Das Tool zeigt sofort Konversionen über alle Einheiten hinweg, lasse Sie elektrische Leistung in Watts gegen mechanische Leistung in Pferdestärke oder thermale Leistung in BTU/h vergleichen. Dies macht es einfach, Spezifikationen von verschiedenen Industrien oder Regionen, die verschiedene Einheiten bevorzugen, zu übersetzen. Alle Berechnungen laufen lokal in Ihrem Browser für schnelle, private Konversionen ohne Server-Uploads.","p3":"Auto-Ingenieure konvertieren Motor-Leistungs-Ratings zwischen Pferdestärke und Kilowatt, wenn amerikanische und europäische Fahrzeug-Spezifikationen verglichen oder regulatorische Beschriftungs-Anforderungen erfüllt werden. HVAC-Auftragnehmer übersetzen Luft-Conditioner-Kühl-Kapazität von BTU/h zu Kilowatt, wenn elektrische Last für Gebäude-Stromsysteme berechnet wird. Industrie-Ausrüstungs-Käufer vergleichen Motor-Spezifikationen in verschiedenen Einheiten – konvertierend PS zu HP oder kW abhängig von Hersteller-Herkunft. Solar-Installateure berechnen, ob eine Heim-Spitzen-Verbrauch in Kilowatt durch verfügbare Dachfläche für Paneel-Installation gedeckt werden kann.","p4":"Beachten Sie, dass mechanische Pferdestärke (745,7W) sich leicht von metrischer Pferdestärke oder PS (735,5W) unterscheidet – geben Sie immer an, welchen Typ Sie in technischer Dokumentation verwenden. BTU pro Stunde misst thermale Leistung, aber eine BTU/h gleich nur ungefähr 0,293 Watt, machen es viel kleiner als Sie erwarten könnten. Bei Dimensionierung von Generatoren oder Stromleitungen denken Sie daran, Leistungs-Faktor zu berücksichtigen – scheinbare Leistung in VA unterscheidet sich von echter Leistung in Watts. Für kontinuierliche Lasten wie Motoren oder Heizungen sollten Leistungsschalter für mindestens 125% der Last-Leistung bewertet werden, um Ärger-Auslösung zu vermeiden."}