{"p2":"Wählen Sie Ihre Start-Geschwindigkeits-Einheit, wie Kilometer pro Stunde, Meilen pro Stunde, Meter pro Sekunde, Knoten oder Mach. Geben Sie Ihren Geschwindigkeitswert ein. Wählen Sie die Einheit, in die Sie konvertieren möchten. Tuttilo konvertiert Ihre Geschwindigkeit sofort mit Standard-Konversions-Faktoren, indem es Unterschiede zwischen Velocity und Pace-Einheiten berücksichtigt. Das Tool unterstützt alles von Geh-Geschwindigkeiten zu Überschall-Geschwindigkeiten. Alle Berechnungen laufen lokal in Ihrem Browser, um Ihre Daten-Privatsphäre zu schützen.","p3":"Piloten konvertieren angegebene Fluggeschwindigkeiten zwischen Knoten und Meilen pro Stunde für Flugplanungen und Kommunikation mit Kontrollern. Läufer interpretieren Laufband-Geschwindigkeiten, die in Meilen pro Stunde angezeigt werden, in ihre bevorzugte Minuten-pro-Kilometer-Pace. Wissenschaftler, die Bewegung in Physik-Experimenten analysieren, konvertieren zwischen Metern pro Sekunde und anderen Einheiten für Standard-Reports. Reisende, die international fahren, konvertieren Tachometer-Anzeigen, wenn Mietwagen Einheiten anzeigen, die sich von Verkehrsschildern unterscheiden. Maritime Navigatoren berechnen Schiffs-Geschwindigkeiten in Knoten, während sie mit Land-basierten Teams mit mph oder km/h koordinieren.","p4":"Knoten (Seemeilen pro Stunde) bleiben Standard in Luftfahrt- und maritimen Anwendungen, weil Seemeilen direkt zu Erd-Geometrie in Beziehung stehen (1 Seemeile ≈ 1 Minute Breite). Mach-Nummer repräsentiert Geschwindigkeit relativ zur Schallgeschwindigkeit, die mit Luft-Temperatur und Druck variiert – Mach 1 auf Meereshöhe ist ungefähr 767 mph, aber langsamer in höheren Höhen. Für Lauf-Pace-Konversionen denken Sie daran, dass schnellere Geschwindigkeiten kleinere Pace-Nummern bedeuten, was kontra-intuitiv sein kann. Bei Auto-Geschwindigkeits-Konversion merken Sie, dass 100 km/h ungefähr 62 mph sind, ein hilfreicher Referenz-Punkt für schnelle mentale Annäherungen auf internationalen Straßen."}