{"p2":"Geben Sie eine beliebige YouTube-Kanal-URL oder Kanal-ID ein. Der Analyzer ruft umfassende Kanalstatistiken über die YouTube-API ab: Gesamt-Abonnentenzahl, kumulative Aufrufe über alle Videos, Gesamtzahl veröffentlichter Videos, Kanal-Erstellungsdatum und berechnete durchschnittliche Aufrufe pro Video. Einige Kanäle verbergen Abonnentenzahlen aus Datenschutzgründen; das Tool zeigt dies an, wenn verfügbar. Verwenden Sie die Metriken, um Kanalwachstum zu bewerten, Ihre Performance gegen Konkurrenten zu benchmarken oder potenzielle Kooperationspartner zu recherchieren. Keine Authentifizierung erforderlich — fügen Sie einfach die URL ein und analysieren Sie. Die gesamte Verarbeitung erfolgt in Ihrem Browser.","p3":"Aufstrebende Creators recherchieren etablierte Kanäle in ihrer Nische, um realistische Wachstumserwartungen zu setzen und zu verstehen, wie Videoanzahl mit Abonnentenzahlen zusammenhängt. Marken, die Influencer-Partnerschaften prüfen, verifizieren Abonnenten-Behauptungen und bewerten Engagement-Raten, indem sie Abonnenten mit durchschnittlichen Aufrufen pro Video vergleichen. Talentmanager, die Content-Creators scouten, identifizieren aufstrebende Kanäle mit starken Aufrufe-zu-Abonnenten-Verhältnissen, die hohes Engagement und Wachstumspotenzial anzeigen. Wettbewerbsanalysten verfolgen Konkurrenz-Kanalstatistiken über Zeit, um Marktanteilsverschiebungen in Content-Nischen zu überwachen.","p4":"Durchschnittliche Aufrufe pro Video sind wichtiger als Abonnentenzahl — ein Kanal mit 10k Subs mit durchschnittlich 15k Aufrufen hat besseres Engagement als 100k Subs mit durchschnittlich 2k Aufrufen, was aktive Zielgruppe oder virale Inhalte anzeigt. Kanalalter kontextualisiert Abonnentenzahlen; 100k Subs in einem Jahr ist explosives Wachstum, während 100k über zehn Jahre bescheiden ist. Einige Kanäle kaufen Abonnenten, sichtbar wenn Abonnentenzahl Aufrufzahlen bei weitem übersteigt (Verhältnis sollte ungefähr 1:10 bis 1:20 für gesunde Kanäle sein). Vergleichen Sie Gesamt-Aufrufe mit Videoanzahl, um Aufwand abzuschätzen, der für ähnliche Ergebnisse in Ihrer Nische erforderlich ist. Versteckte Abonnentenzahlen weisen oft auf kleinere Kanäle hin, die empfindlich darüber sind, klein zu erscheinen, oder sehr große Creators, die Kontrolle vermeiden."}