{"p2":"Geben Sie Ihre geschätzte tägliche Aufrufzahl und erwartete CPM-Rate (Kosten pro tausend Aufrufe) ein. CPM variiert stark nach Nische, Geografie und Zielgruppen-Demografie — typische Bereiche sind $0,25-$4 für Entwicklungsmärkte, $2-$8 für allgemeinen Content in entwickelten Märkten und $8-$20+ für Finanz-, Business- oder Tech-Kanäle. Der Rechner multipliziert Ihre täglichen Aufrufe mit CPM und wendet YouTubes 55/45-Umsatzaufteilung an (Creators erhalten 55%), um tägliche, monatliche und jährliche Einnahmen abzuschätzen. Passen Sie Eingaben an, um Wachstumsszenarien zu modellieren oder verschiedene CPM-Annahmen zu vergleichen. Alle Berechnungen erfolgen lokal in Ihrem Browser.","p3":"Aufstrebende YouTuber recherchieren realistische Einkommenserwartungen, indem sie Einnahmen bei verschiedenen Aufruf-Meilensteinen berechnen, bevor sie entscheiden, ob sie Content-Erstellung Vollzeit verfolgen. Bestehende Creators validieren, ob ihre tatsächlichen AdSense-Einnahmen mit Branchen-Benchmarks übereinstimmen oder darauf hinweisen, dass sie für höher-CPM-Content optimieren sollten. Marken, die Influencer-Partnerschaften bewerten, schätzen die Einnahmen eines Kanals ab, um faire Sponsoring-Raten relativ zum Werbeinkommen eines Creators zu bestimmen. Finanzberater, die Content-Creator-Klienten helfen, modellieren Einkommensströme und Steuerplanung unter Verwendung von Aufruf-Trends und CPM-Durchschnitten.","p4":"CPM variiert dramatisch nach Content-Typ: Finanzen und Business durchschnittlich $12-$25, Tech und Gadgets $7-$15, Gaming und Entertainment $2-$6 und Vlogs oder Lifestyle $1-$5. Geografie ist wichtig — US-Traffic erzielt 3-5x höhere CPM als Traffic aus Entwicklungsländern. YouTube nimmt 45% der Werbeeinnahmen, also bedeutet ein $10 CPM, dass Sie tatsächlich $5,50 pro tausend Aufrufe verdienen. RPM (Einnahmen pro tausend), gezeigt in YouTube Analytics, berücksichtigt bereits die 55/45-Aufteilung und ist niedriger als CPM. Berücksichtigen Sie, dass nur 40-60% der Aufrufe monetarisiert werden aufgrund von Adblockern und Zuschauern in nicht monetarisierbaren Ländern."}