{"p2":"Fügen Sie Ihre YouTube-Video-URL ein und konfigurieren Sie dann Embed-Optionen mit den Checkboxen und Eingaben: aktivieren Sie Autoplay, um das Video sofort beim Seitenladen zu starten, setzen Sie Loop für unendliche Wiederholung, stummschalten Sie Audio standardmäßig (erforderlich für Autoplay auf den meisten Browsern), geben Sie eine Startzeit in Sekunden an, um Intros zu überspringen, verbergen Sie Videosteuerungen für sauberere Embeds, und schalten Sie responsiven Modus um, um fließendes CSS mit variabler Breite zu generieren. Das Tool baut den richtigen iframe-Embed-Code mit all Ihren Optionen als URL-Parameter kodiert. Kopieren Sie das vollständige HTML und fügen Sie es in Ihre Webseite ein. Alle Code-Generierung erfolgt in Ihrem Browser.","p3":"Landing Pages betten Produktdemo-Videos mit Autoplay und stummgeschaltet ein, um stille Hintergrund-Video-Heros zu erstellen, die Aufmerksamkeit erregen, ohne das Browsing-Erlebnis zu stören. Blog-Posts betten Tutorial-Videos mit spezifischen Startzeiten ein, die Intros überspringen und direkt zur relevanten Anleitung springen. Portfolio-Websites verwenden versteckte Steuerungen und Loop-Einstellungen für ambiente Hintergrundvideos, die kontinuierlich ohne UI-Clutter abspielen. Online-Kurse betten Vorlesungsvideos mit responsiver Größenanpassung ein, sodass sie sich richtig an Studenten anpassen, die auf Telefonen, Tablets oder Desktop-Computern zuschauen.","p4":"Autoplay mit Ton funktioniert nur, wenn Nutzer zuerst mit Ihrer Site interagiert haben — Browser blockieren es sonst, um nervige Erlebnisse zu verhindern. Kombinieren Sie Autoplay immer mit Stummschalten, um zuverlässige Wiedergabe sicherzustellen. Der rel=0-Parameter, der früher verwandte Videos entfernte, funktioniert nicht mehr; YouTube zeigt jetzt nur verwandte Videos desselben Kanals am Videoende. Startzeit verwendet Sekunden, keine Zeitstempel — für 1:30 geben Sie 90 Sekunden ein. Responsive Embeds erfordern Wrapper-Divs mit spezifischem Seitenverhältnis-CSS; kopieren Sie den bereitgestellten Code genau. Privacy-Enhanced-Modus (mit youtube-nocookie.com) verhindert, dass YouTube Zuschauer trackt, bis sie das Video abspielen."}