{"p2":"Digita il tuo messaggio di testo semplice nel campo di input e crea una password forte nel campo della password. Clicca Codifica per trasformare il tuo testo usando AES-256-GCM, uno standard di encriptazione di livello militare. Lo strumento deriva una chiave crittografica dalla tua password usando PBKDF2 con 100.000 iterazioni e un salt casuale. L'output crittografato include il salt, il vettore di inizializzazione e il testo cifrato combinati in una stringa codificata in Base64. Per decodificare, incolla la stringa crittografata, inserisci la stessa password e clicca Decodifica. Se la password non è corretta o i dati sono corrotti, la decodifica fallisce con un errore. Tutte le operazioni crittografiche usano l'API Web Crypto nel tuo browser.","p3":"Gli utenti condividono in sicurezza informazioni sensibili come password o dettagli dell'account crittografando il testo, inviandolo attraverso canali non sicuri come email e condividendo la password di decodifica separatamente attraverso un canale diverso come SMS. Gli sviluppatori testano le implementazioni di encriptazione crittografando dati di test e verificando che la loro applicazione possa decodificarla correttamente. Gli individui consapevoli della sicurezza crittografano note contenenti informazioni confidenziali prima di archiviarle in app di note su cloud. I dipartimenti IT dimostrano i concetti di encriptazione durante l'addestramento sulla sicurezza lasciando che i dipendenti crittografino e decodifichino messaggi di esempio.","p4":"Scegli una password forte e unica per l'encriptazione; le password deboli possono essere forzate indipendentemente dalla forza AES. Non inviare mai i dati crittografati e la password attraverso lo stesso canale; se un attaccante intercetta entrambi, l'encriptazione è inutile. Salva l'intera stringa di output crittografata inclusi i metadati; perdere qualsiasi parte significa che non puoi decodificare il messaggio. La modalità GCM fornisce encriptazione autenticata, quindi se qualcuno manomette il testo cifrato, la decodifica fallirà piuttosto che produrre output spazzatura. Questo strumento è adatto per l'encriptazione manuale occasionale, ma le applicazioni di produzione dovrebbero usare sistemi appropriati di gestione delle chiavi piuttosto che chiavi derivate da password."}