{"p2":"Seleziona uno degli otto effetti di animazione preimpostati: rimbalzo, fade-in, slide-in (da alto/destra/basso/sinistra), ruota, pulsazione, scossa, zoom-in o ribaltamento. Imposta la durata dell'animazione in secondi, scegli una funzione di temporizzazione (lineare, ease, ease-in, ease-out o ease-in-out) che controlla l'accelerazione, e specifica il conteggio delle iterazioni (una volta, due volte o ciclo infinito). La casella di anteprima dimostra la tua animazione continuamente in modo che tu possa perfezionare la tempistica e la sensazione prima di impegnarti. Copia sia la classe CSS che la regola @keyframes insieme: incolla entrambi nel tuo foglio di stile e applica la classe a qualsiasi elemento.","p3":"Le pagine di destinazione di marketing utilizzano animazioni fade-in su testo hero e pulsanti call-to-action per attirare l'attenzione mentre gli utenti scorrono nella visualizzazione. Le pagine dei prodotti di e-commerce impiegano effetti di zoom-in sottili sulle immagini durante gli stati di passaggio per invitare l'interazione senza essere brusche. Le schermate di caricamento utilizzano animazioni infinite di pulsazione o rotazione per indicare l'elaborazione senza richiedere dati di progresso effettivi. I flussi di onboarding fanno scorrere carte di esercitazione in sequenza per guidare i nuovi utenti attraverso le funzionalità senza sovraccaricarli tutti contemporaneamente.","p4":"Abbina le funzioni di temporizzazione all'intento di animazione: ease-out per gli elementi che entrano nel viewport (inizio veloce, fine lenta si sente naturale), ease-in per gli elementi che escono (accelerare via) e ease-in-out per le animazioni in loop. Mantieni le durate brevi (0,3-0,6 s) per il feedback dell'interfaccia utente, più lunghe (0,8-1,2 s) per gli effetti decorativi: tutto ciò che supera 2 s si sente sluggish. Le iterazioni infinite funzionano per gli indicatori di caricamento ma esauriscono gli utenti su elementi di contenuto; usare con parsimonia. Combina animation-delay con animation-fill-mode: forward per creare sequenze sfalsate in cui gli elementi si animano uno dopo l'altro. Testa su dispositivi low-end poiché le animazioni keyframe complesse possono causare instabilità su GPU più lente."}