{"p2":"Utilizza gli interruttori di controllo dell'angolo per lavorare con tutti e quattro gli angoli collegati insieme per un arrotondamento uniforme, oppure scollegaline per impostare ogni angolo in modo indipendente. Trascina il cursore o digita i valori direttamente, quindi scegli l'unità preferita: pixel per il dimensionamento fisso, percentuali per il ridimensionamento reattivo o rem per il dimensionamento accessibile che rispetta le preferenze dei caratteri dell'utente. La casella di anteprima si aggiorna in tempo reale mostrando esattamente come apparirà il tuo elemento. Copia il CSS generato con un solo clic: include la proprietà border-radius completa con valori degli angoli individuali quando differiscono.","p3":"I designer di pulsanti arrotondano gli angoli per creare elementi di interfaccia amichevoli e accessibili che si sentono più toccabili rispetto ai bordi rettangolari rigidi. I layout di carte utilizzano un raggio sottile (4-8px) sui contenitori di contenuto per un'estetica moderna e lucida che distingue le sezioni senza bordi pesanti. Le immagini di profilo e i componenti avatar utilizzano border-radius del 50% per trasformare le immagini quadrate in cerchi perfetti. I sistemi di design implementano scale di raggio coerenti (2px, 4px, 8px, 16px) tra i componenti per mantenere l'armonia visiva, e questo strumento aiuta a visualizzare ogni passaggio di quella scala.","p4":"L'impostazione di border-radius al 50% crea un cerchio perfetto solo quando l'elemento ha larghezza e altezza uguali: usa questo per le immagini di avatar. Per i pulsanti a forma di pillola, usa un raggio uguale alla metà dell'altezza del pulsante (se l'altezza è 40px, usa 20px di raggio). Quando si applicano diversi raggi agli angoli individuali, mantenere l'equilibrio visivo mantenendo gli angoli opposti simili. Il raggio basato su percentuale si ridimensiona con la dimensione dell'elemento, rendendolo ideale per componenti reattivi che si ridimensionano a diversi punti di interruzione. La combinazione di border-radius con overflow: hidden taglia il contenuto figlio in modo pulito, essenziale quando si arrotondano i contenitori con immagini di sfondo o elementi annidati."}