{"p2":"Aggiungi il tuo primo livello di ombra con il pulsante più, quindi regola l'offset orizzontale (X), l'offset verticale (Y), il raggio di sfocatura e la diffusione usando i cursori o l'input diretto. Scegli il colore dell'ombra e imposta la sua opacità utilizzando il cursore alfa. Attiva/disattiva tra ombre esterne (predefinite) e ombre interne per effetti di bagliore interno. Aggiungi più livelli di ombra per creare effetti di profondità complessi: ogni livello si impila su quelli precedenti. L'anteprima si aggiorna istantaneamente mentre regoli qualsiasi parametro e l'output CSS riflette la tua dichiarazione di ombra completa pronta per copiare nei tuoi fogli di stile.","p3":"I designer basati su schede dell'interfaccia utente aggiungono ombre sottili per elevare le carte di contenuto sopra gli sfondi della pagina, creando una gerarchia che guida gli utenti attraverso l'architettura delle informazioni. I siti di e-commerce utilizzano ombre pronunciate su immagini di prodotti e pulsanti \"Aggiungi al carrello\" per farli apparire tattili e cliccabili. I costruttori di dashboard stratificano più ombre con diversi raggi di sfocatura per ottenere livelli di profondità realistici del design dei materiali: un'ombra nitida per la definizione più un'ombra più morbida per l'illuminazione ambientale. Le agenzie creative progettano effetti di passaggio drammatici animando le proprietà dell'ombra, facendo apparire gli elementi dell'interfaccia come se si staccassero dalla pagina quando gli utenti interagiscono.","p4":"Stratifica le ombre dal più grande/più morbido (in basso) al più piccolo/più nitido (in alto) per imitare l'illuminazione naturale in cui la luce ambientale crea ombre morbide e la luce diretta crea bordi definiti. Mantieni i valori di diffusione minini (0-4px): la diffusione eccessiva fa apparire le ombre artificiali e cartoonistiche. Per una profondità realistica, posiziona l'ombra principale leggermente sotto e a destra (X e Y positivi) simulando la luce da sinistra in alto, una convenzione che gli utenti si aspettano. Le ombre interne funzionano meravigliosamente per i campi di input per creare apparenze incassate. Usa nero semi-trasparente (rgba(0,0,0,0.1-0.3)) per la maggior parte delle ombre anziché nero puro, che appare duro."}