{"p2":"Inserisci la tua età, il tuo sesso biologico, il tuo peso attuale e la tua altezza utilizzando il tuo sistema di unità preferito. Seleziona il tuo livello di attività da sedentario a molto attivo in base a quanta attività fisica fai settimanalmente. Tuttilo utilizza l'equazione scientificamente convalidata di Mifflin-St Jeor per calcolare il tuo Basal Metabolic Rate (BMR): le calorie che bruci a riposo, quindi lo moltiplica per il tuo fattore di attività per determinare il tuo Total Daily Energy Expenditure (TDEE). I risultati mostrano le calorie di mantenimento, più i target per la perdita di peso o il guadagno di peso. I tuoi dati sanitari rimangono completamente privati nel tuo browser.","p3":"Gli appassionati di fitness che iniziano nuovi piani dietetici utilizzano i calcoli TDEE come fondamento per creare deficit o eccedenze calorici. I personal trainer stabiliscono i target calorici di base per i clienti prima di progettare programmi di nutrizione. Le persone che si riprendono da disturbi alimentari lavorano con i terapeuti per comprendere intervalli calorici salutari per il loro corpo e livello di attività. Gli atleti negli sport di categoria di peso calcolano le loro calorie di mantenimento per pianificare tagli o espansioni prima delle competizioni. Gli individui che sperimentano cambiamenti di peso inspiegabili verificano se l'assunzione di calorie si allinea con la loro spesa.","p4":"Il BMR diminuisce mentre perdi peso, quindi ricalcola ogni 10-15 libbre per evitare i plateau derivanti dal mangiare troppe calorie per la tua nuova dimensione corporea. I moltiplicatori di attività sono stime approssimative: traccia i tuoi veri cambiamenti di peso in 2-3 settimane e regola le calorie di 200-300 se i risultati non corrispondono alle aspettative. Il muscolo brucia più calorie a riposo rispetto al grasso, quindi l'allenamento della forza aumenta il tuo BMR nel tempo anche senza cardio. Non scendere al di sotto del tuo BMR per periodi estesi, poiché deficit severi attivano l'adattamento metabolico in cui il tuo corpo conserva aggressivamente l'energia, rendendo l'ulteriore perdita di grasso estremamente difficile."}