{"p2":"Carica un'immagine o seleziona i colori dalla tua tavolozza di design, quindi scegli quale tipo di disturbo della visione dei colori simulare: protanopia (daltonismo rosso), deuteranopia (daltonismo verde), tritanopia (daltonismo blu), protanomalia (ridotta sensibilità al rosso), deuteranomalia (ridotta sensibilità al verde) o tritanomalia (ridotta sensibilità al blu). Lo strumento applica trasformazioni matematiche che modellano accuratamente il modo in cui queste condizioni influiscono sulla percezione dei colori. Confronta la vista simulata fianco a fianco con l'originale per identificare combinazioni di colori problematiche che sarebbero indistinguibili per gli utenti interessati. Tutta l'elaborazione avviene localmente nel tuo browser per la privacy.","p3":"I designer dell'interfaccia utente testano se gli elementi di interfaccia critici come gli stati di errore (tradizionalmente rossi) e i messaggi di successo (tipicamente verdi) rimangono distinguibili dagli utenti daltonici prima di finalizzare i design. Gli specialisti di visualizzazione dei dati verificano che i colori dei grafici, le linee del grafico e le mappe di calore comunichino le informazioni attraverso modelli o etichette oltre alla codifica dei colori. I creatori di infografiche assicurano che icone, callout e distinzioni di categoria non si affidino esclusivamente a differenze di colore che scompaiono sotto il disturbo della visione del colore. Gli sviluppatori di giochi testano se i meccanici di gioco dipendenti dal riconoscimento del colore (come l'abbinamento dei fili o l'identificazione dei nemici) rimangono giocabili per i giocatori daltonici.","p4":"La deuteranomalia (ridotta sensibilità al verde) colpisce approssimativamente il 6% dei maschi ed è la forma più comune: testa sempre contro questa variante come minimo. Evita completamente le combinazioni rosso-verde poiché protanopia e deuteranopia confondono entrambe queste tonalità; utilizza invece coppie blu-arancioni per una migliore accessibilità. Non fare affidamento solo sul colore per trasmettere le informazioni: integrare con modelli, forme, icone o etichette di testo. Strumenti come questo simulatore non sono perfetti poiché si approssimano piuttosto che replicare l'esperienza effettiva, ma catturano la maggior parte dei problemi importanti. Combina test di simulazione con controllo del rapporto di contrasto per una convalida di accessibilità completa."}