{"p2":"Clicca da qualsiasi parte nel gradiente del color picker per selezionare una tonalità e saturazione, poi regola il cursore di luminosità a destra. Il colore selezionato viene visualizzato in alto con valori di colore live in più formati. Copia il codice HEX per CSS e HTML, i valori RGB per manipolazione di colori programmatica, la rappresentazione HSL per regolare la luminosità, o rgba/hsla con trasparenza alfa. Puoi anche incollare qualsiasi codice HEX nel campo di input per saltare direttamente a quel colore. I valori CMYK aiutano quando prepari design per la stampa. Tutte le conversioni si calcolano istantaneamente nel tuo browser.","p3":"I designer UI/UX selezionano i colori del brand e generano valori esatti per sistemi di design e guide di stile. Gli sviluppatori frontend scelgono i colori per CSS mentre costruiscono componenti, copiando il formato necessario per il loro contesto specifico. I designer grafici convertono i colori dello schermo in CMYK prima di inviare design ai venditori di stampa che richiedono spazi di colore ottimizzati per la stampa. I team di marketing assicurano la coerenza dei colori del brand tra asset digitali facendo riferimento a codici HEX canonici piuttosto che indovinare i colori.","p4":"Quando progetti per l'accessibilità, verifica che le tue combinazioni di colori soddisfino i rapporti di contrasto WCAG usando uno strumento di verifica del contrasto separato dopo aver selezionato i colori qui. Il formato HSL è particolarmente utile per generare variazioni di colore a livello di programmazione poiché puoi regolare la luminosità e la saturazione mantenendo costante la tonalità di base. Ricorda che i colori appaiono diversamente su schermi rispetto alla stampa, quindi i valori CMYK sono approssimazioni; richiedi bozze di colore dal tuo fornitore di stampa per materiali di brand critici. Salva la tavolozza colori del tuo progetto in un file di testo o strumento di design poiché gli strumenti del browser non persistono le selezioni."}