{"p2":"Inserisci l'importo principale iniziale, il tasso di interesse annuale previsto e l'orizzonte temporale di investimento in anni. Scegli con quale frequenza gli interessi si accumulano (giornalmente, mensilmente, trimestralmente o annualmente), poiché la capitalizzazione più frequente produce rendimenti più elevati. Facoltativamente aggiungi contributi mensili regolari per vedere come l'investimento coerente accelera la crescita. Tuttilo genera una ripartizione anno per anno che mostra la crescita del saldo, separando il capitale contribuito dall'interesse guadagnato. Un grafico visivo illustra la curva esponenziale della crescita composta. Tutti i calcoli vengono eseguiti localmente nel tuo browser per la completa privacy della tua pianificazione finanziaria.","p3":"Gli studenti universitari modellano diverse strategie di risparmio per capire come iniziare presto con piccoli contributi mensili supera i contributi più grandi iniziati più tardi. I pianificatori pensionistici proiettano la crescita del loro gruzzolo inserendo i saldi attuali del 401(k) con tassi di contribuzione previsti. I genitori che risparmiano per l'istruzione dei bambini calcolano quanto devono mettere da parte mensilmente per raggiungere un obiettivo specifico in 18 anni. I consulenti finanziari dimostrano ai clienti la differenza drammatica tra rendimenti annuali del 6% e dell'8% in periodi di 30 anni.","p4":"La Regola del 72 offre un rapido controllo mentale: dividi 72 per il tuo tasso di interesse per trovare quanti anni ci vogliono per raddoppiare i tuoi soldi. I conti fiscalmente vantaggiosi come i Roth IRA massimizzano la crescita composta poiché non paghi mai le tasse sui guadagni. Iniziare 10 anni prima con interesse composto spesso produce risultati migliori rispetto al raddoppio dell'importo del contributo in seguito. Non sottovalutare come i regolari contributi mensili amplificano la crescita composta: un contributo mensile di 200 dollari può aggiungere più al tuo saldo finale rispetto al capitale iniziale in orizzonti temporali lunghi."}