{"p2":"Seleziona il tuo colore di primo piano (testo) e colore di sfondo utilizzando i selettori di colore o inserendo codici hex direttamente. Lo strumento calcola istantaneamente il rapporto di contrasto WCAG e visualizza i risultati pass/fail per quattro criteri diversi: Livello AA testo normale (4,5:1), Livello AA testo grande (3:1), Livello AAA testo normale (7:1) e Livello AAA testo grande (4,5:1). Il testo grande significa 18pt e superiore, o 14pt e superiore quando grassetto. Tutti i calcoli utilizzano la formula WCAG 2.1 ufficiale ed eseguiti interamente nel tuo browser per feedback istantaneo.","p3":"Gli sviluppatori web assicurano che il loro testo del sito soddisfi i requisiti di accessibilità legale prima del lancio, evitando potenziali cause secondo i regolamenti ADA o Section 508. I designer dell'interfaccia utente verificano che i pulsanti call-to-action abbiano contrasto sufficiente rispetto agli sfondi della pagina in modo che gli utenti con visione bassa possano facilmente identificare elementi interattivi. I developer di app mobili testano se i loro schemi di modalità chiara e scura passano gli standard AA per gli utenti in condizioni di illuminazione diverse. Le agenzie governative che costruiscono siti web rivolti al pubblico devono soddisfare gli standard AAA in molte giurisdizioni, richiedendo una selezione attenta dei colori convalidata attraverso il controllo del contrasto.","p4":"Mira sempre alla conformità di livello AA come minimo: molti paesi lo richiedono legalmente per siti governativi e commerciali. Il livello AAA fornisce una migliore accessibilità ma può essere impegnativo con i colori del marchio; assegnarlo priorità per il testo del corpo mentre AA potrebbe bastare per gli elementi decorativi. Ricorda che i requisiti di contrasto differiscono per testo grande (18pt+ regolare o 14pt+ grassetto) rispetto a testo normale. I rapporti di contrasto si applicano a tutti gli scenari testo su sfondo incluso il testo su immagini, quindi testa attentamente le combinazioni di sovrapposizione. Quando si utilizza testo leggero su sfondi colorati, il bianco puro spesso funziona meglio rispetto al bianco spento poiché ogni passaggio lontano dal bianco riduce il contrasto."}