{"p2":"Inserisci un numero di carta di credito nel campo di input e lo strumento lo valida istantaneamente usando l'algoritmo di Luhn (controllo del modulo 10). L'algoritmo verifica che la cifra di checksum corrisponda al resto del numero, catturando errori di battitura e stringhe di cifre casuali. Lo strumento identifica anche la rete di carte (Visa, Mastercard, Amex, Discover, ecc.) in base al prefisso del numero e alla lunghezza. Un indicatore verde mostra i numeri validi, mentre il rosso indica i numeri non validi che falliscono il controllo di Luhn. Questa convalida conferma che il numero è matematicamente corretto ma non verifica che la carta esista o abbia fondi. Tutta l'elaborazione funziona nel tuo browser.","p3":"Gli sviluppatori di e-commerce testano la logica di convalida dei moduli di pagamento inserendo vari numeri di carta validi e non validi per assicurarsi una gestione degli errori corretta. I team di elaborazione dei pagamenti risolvono i problemi di integrazione verificando che i numeri di carta che ricevono siano almeno strutturalmente validi prima di tentare l'autorizzazione. I tester di qualità lo usano durante il test del flusso di pagamento con numeri di carte di test forniti dai processori di pagamento. Gli agenti del supporto clienti convalidano i numeri di carta che i clienti forniscono per telefono per catturare gli errori di trascrizione prima dell'elaborazione.","p4":"Passare la convalida di Luhn significa solo che il numero potrebbe teoricamente essere una vera carta; non conferma che la carta sia attiva, abbia credito disponibile o appartenga al cliente. Tutte le principali reti di carte usano Luhn, quindi questo è un buon controllo di primo passaggio prima di fare costose chiamate API ai processori di pagamento. I numeri di carte di test per lo sviluppo hanno spesso pattern prevedibili come 4111111111111111 per Visa; questo strumento conferma che sono validi per il test. Non usare mai questo strumento per convalidare numeri di carta che hai trovato o generato per uso fraudolento; questo è rigorosamente per lo sviluppo, il test e la risoluzione di problemi legittima."}