{"p2":"Seleziona il tipo di modello da sei opzioni: strisce (verticali o orizzontali), puntini, griglia, scacchiera, zigzag o diagonale. Regola la dimensione del modello utilizzando il cursore per controllare la spaziatura tra elementi ripetuti, quindi scegli i tuoi due colori di modello (primo piano e sfondo). L'anteprima si aggiorna in tempo reale mostrando come il tuo modello si affianca su una superficie. Perfeziona la densità del motivo e il contrasto del colore fino a ottenere l'effetto visivo desiderato. Copia la proprietà CSS di sfondo generata con un solo clic: utilizza funzioni linear-gradient o radial-gradient che creano modelli CSS puri senza file di immagine, mantenendo il tuo sito veloce e scalabile.","p3":"Le pagine di destinazione utilizzano modelli sottili di punti o griglie su sfondi di sezioni hero per aggiungere texture senza schiacciare il contenuto primario. Le interfacce del dashboard impiegano modelli di scacchiera o striscia chiara nelle righe della tabella dei dati per migliorare la leggibilità separando visivamente le righe. I siti di portfolio creano sfondi di strisce diagonali dinamici per i divisori di sezione che aggiungono energia e guidano l'occhio lungo la pagina. Le carte dei prodotti di e-commerce utilizzano modelli di sfondo sottili per differenziare categorie o articoli in vendita mantenendo un linguaggio di design coeso.","p4":"Mantieni i modelli di sfondo sottili utilizzando coppie di colori a basso contrasto (differenza di luminosità del 10-15%) per evitare di competere con il contenuto in primo piano. Le dimensioni di modello più piccole (8-16px) si sentono più raffinate mentre le dimensioni più grandi (32px+) appaiono audaci e grafiche: abbina alla tua personalità del marchio. I modelli creati con i gradienti CSS hanno prestazioni migliori rispetto alle immagini di sfondo poiché non c'è richiesta HTTP o file da scaricare. Combina i modelli con background-blend-mode per effetti di sovrapposizione sofisticati su immagini. Testa i modelli a diverse dimensioni dello schermo poiché piccoli elementi che si ripetono possono creare modelli moiré o vibrazione su display ad alta DPI."}