{"p2":"Configura le proprietà del contenitore utilizzando i controlli visivi: flex-direction passa tra layout di riga e colonna, flex-wrap determina se gli elementi rimangono su una linea o si avvolgono su più linee, justify-content allinea gli elementi lungo l'asse principale, align-items li posiziona sull'asse trasversale e gap imposta la spaziatura tra i figli flex. Aggiungi o rimuovi elementi di anteprima per vedere come il tuo layout si adatta a diverse quantità di contenuto. L'anteprima dal vivo si aggiorna istantaneamente mentre regoli ogni proprietà e il CSS generato mostra sia il contenitore che le regole degli elementi pronti per copiare nel tuo progetto.","p3":"Le barre di navigazione utilizzano flexbox con giustificazione spaziale per spingere il logo a sinistra e le voci di menu a destra senza calcoli di posizionamento manuale. Le griglie di carte impiegano flex-wrap con spaziatura gap per creare gallerie reattive che rifluiscono automaticamente a larghezze di schermo diverse senza media query. I layout di moduli utilizzano flex-direction: colonna per dispositivi mobili e passano a riga per desktop per impilare le etichette sopra gli input su schermi piccoli. I widget del dashboard allineano icone e testo utilizzando align-items: center per centrare verticalmente il contenuto indipendentemente da altezze di testo variabili o dimensioni di icone.","p4":"Inizia con justify-content per l'allineamento dell'asse principale (orizzontale in riga, verticale in colonna) e align-items per l'asse trasversale: questo modello mentale evita confusione. Usa il gap invece dei margini sui figli flex per la spaziatura poiché non aggiungerà spazio extra ai bordi del contenitore. flex-wrap: wrap abilita il comportamento reattivo senza media query quando combinato con flex-basis o min-width sui figli. Ricorda che align-content influisce solo sui contenitori flex multi-linea, non su singole linee. Per colonne di larghezza uguale, imposta flex: 1 sui figli; per il dimensionamento basato su contenuto, utilizza flex: 0 1 auto per evitare il restringimento."}