{"p2":"Sfoglia abbinamenti di caratteri curati organizzati per categorie di stile come elegante, moderno, classico, grassetto e minimalista. Ogni suggerimento mostra un'intestazione nel carattere primario accoppiato con testo del corpo nel carattere complementare, permettendoti di vedere esattamente come la combinazione appare insieme. Fai clic su qualsiasi abbinamento per visualizzare i link Google Fonts per entrambi i caratteri, pronti per aggiungere al tuo progetto tramite il tag link standard o l'importazione CSS. Regola il testo di anteprima per vedere come il tuo contenuto effettivo apparirebbe in ogni abbinamento. Filtra per umore di stile per abbinare i tuoi obiettivi estetici del progetto, con tutti i consigli basati su principi tipografici comprovati.","p3":"I designer di siti Web che stabiliscono la gerarchia visiva accoppiano un carattere di intestazione distintivo con un carattere del corpo leggibile per creare interesse senza sacrificare la leggibilità. I progetti di identità del marchio abbinano le intestazioni con serif al testo del corpo sans-serif (o viceversa) per equilibrare le estetiche tradizionali e moderne. I siti di portfolio utilizzano caratteri di visualizzazione grassetti per i titoli dei progetti abbinati a caratteri del corpo neutri che mantengono l'attenzione sui campioni di lavoro. I materiali di marketing combinano intestazioni di script o decorative con san-serif puliti per la copia del corpo per aggiungere personalità mantenendo la leggibilità professionale.","p4":"Il contrasto è la chiave: abbina serif con sans-serif, condensato con ampio, pesante con leggero: caratteri simili competono piuttosto che completarsi. Limita i progetti a 2-3 caratteri massimo; più crea caos visivo e danneggia le prestazioni con download di file di caratteri aggiuntivi. Quando si abbina, assicurare che le altezze x (l'altezza delle lettere minuscole) siano simili in modo che il testo del corpo e le intestazioni si sentano coesi a diverse dimensioni. Google Fonts suggerisce abbinamenti popolari in base ai dati di utilizzo effettivi di milioni di siti web, rendendo queste combinazioni provate in battaglia. Carica sempre font-display: swap per impedire il testo invisibile durante il caricamento, in particolare su connessioni più lente."}