{"p2":"Scegli l'unità di economia del carburante iniziale: litri per 100 chilometri, chilometri per litro, miglia per gallone (US) o miglia per gallone (Imperial). Inserisci la cifra dell'economia del carburante del tuo veicolo. Seleziona l'unità in cui desideri convertire. Tuttilo calcola la conversione istantaneamente, tenendo conto della relazione inversa tra distanza-per-carburante e metriche carburante-per-distanza. Nota che i galloni US e Imperial differiscono, influenzando i valori di MPG. Lo strumento elabora tutto nel tuo browser, mantenendo i tuoi dati del veicolo privati.","p3":"I viaggiatori che noleggiano auto all'estero convertono le specifiche di economia del carburante alle loro unità familiari per confrontare gli acquisti. Gli acquirenti di auto valutano i veicoli con rating di efficienza in diversi sistemi per trovare l'opzione più economica. I gestori di flotte monitorano l'efficienza dei veicoli nelle operazioni internazionali in cui diverse regioni segnalano utilizzando standard diversi. I difensori ambientali calcolano e confrontano le impronte di carbonio quando i dati di efficienza utilizzano vari sistemi di misurazione. I giornalisti automobilistici convertono le specifiche del produttore alle unità preferite del loro pubblico per le recensioni.","p4":"I valori L/100km inferiori indicano un'efficienza migliore (metrica inversa) mentre i valori MPG più elevati indicano un'efficienza migliore (metrica diretta), il che può causare confusione nel confronto. Il MPG US è approssimativamente il 17% inferiore al MPG Imperial per lo stesso veicolo perché i galloni US sono più piccoli. L'economia del carburante nel mondo reale in genere corre il 15-25% peggio rispetto ai rating ufficiali a causa dei limiti della metodologia di test: considera questo quando pianifichi i costi del carburante. I veicoli ibridi spesso mostrano MPG significativamente migliore in città rispetto all'autostrada (opposto ai veicoli tradizionali) a causa dei vantaggi della frenata rigenerativa nel traffico stop-and-go."}