{"p2":"Regola il cursore di sfocatura per controllare quanto il contenuto di sfondo è visibile attraverso il tuo elemento di vetro: valori più elevati creano effetti di brinatura più forti. Imposta l'opacità di sfondo per determinare la trasparenza, la saturazione del colore per aggiungere una tonalità (rendendo il vetro più caldo o più freddo) e la trasparenza del bordo per il caratteristico highlight del bordo sottile. L'anteprima mostra la tua carta di vetro rispetto a uno sfondo sfumato personalizzabile in modo che tu possa vedere esattamente come interagisce con il contenuto dietro. Copia il CSS completo inclusi backdrop-filter, background e proprietà del bordo pronto per l'uso in produzione. Tutto il rendering avviene nel tuo browser.","p3":"Le interfacce del dashboard utilizzano pannelli glassmorfici per stratificare le informazioni su sfondi dinamici come video o sfumature animate mantenendo la leggibilità. I designer di app mobili creano barre di navigazione smerigliato e modali che lasciano il contenuto sottostante dare uno sguardo, mantenendo il contesto mentre focalizzano l'attenzione su elementi in primo piano. Le pagine di destinazione impiegano carte di vetro per tabelle dei prezzi o evidenziazioni di funzionalità, aggiungendo profondità sofisticata che si sente premium e moderna. Le interfacce del lettore musicale utilizzano il glassmorfismo per i controlli di riproduzione che si sovrappongono all'opera dell'album, creando coesione visiva tra l'interfaccia utente e il contenuto.","p4":"La sfocatura del filtro backdrop funziona meglio tra 10-20px: valori inferiori appena brinano mentre valori più elevati rendono il vetro opaco. Includi sempre un fallback di sfondo semi-trasparente per i browser senza supporto backdrop-filter, in particolare le versioni Firefox precedenti. Il glassmorfismo appare più impressionante su sfondi vibranti o multicolori; gli sfondi sottili riducono l'impatto visivo. Aggiungi un bordo luminoso sottile (1px solido rgba(255,255,255,0.18)) per definire i bordi rispetto agli sfondi occupati. Suggerimento di performance: backdrop-filter è ad alta intensità GPU, quindi limita l'uso alle sezioni hero o ai principali elementi dell'interfaccia utente piuttosto che applicare a interi layout."}