{"p2":"Scegli il tuo tipo di gradiente: lineare, radiale o conico, quindi fai clic per aggiungere fermate di colore lungo il percorso del gradiente. Trascina ogni fermata per regolarne la posizione e fai clic sul campione di colore per selezionare la tua tonalità desiderata utilizzando il selettore di colore integrato. Per i gradienti lineari, ruota il cursore dell'angolo per controllare la direzione da 0° (basso verso l'alto) attraverso 180° (alto verso il basso). I gradienti radiali ti lasciano centrare il focus, mentre i gradienti conici creano effetti della ruota dei colori. Copia il codice CSS completo con un clic e incollalo direttamente nel tuo foglio di stile o negli stili inline.","p3":"I designer web creano sfondi di sezioni hero con sfumature sottili a due tonalità che aggiungono profondità senza schiacciare il contenuto. Gli sviluppatori dell'interfaccia utente costruiscono stati di passaggio dei pulsanti utilizzando sfumature lineari da ombre più chiare a più scure per il feedback visivo. I team di marketing progettano banner call-to-action accattivanti con sfumature vibranti a più fermate che attraggo l'attenzione sulle pagine di destinazione. I designer di app mobili utilizzano sfumature radiali per creare effetti spotlight che guidano gli occhi degli utenti verso elementi di interfaccia importanti o contenuti promozionali.","p4":"Limita i gradienti a 2-4 fermate di colore per risultati puliti e professionali: troppi colori creano transizioni torbide. Quando si progetta per la leggibilità, assicurare un contrasto sufficiente tra gradiente e testo sovrapposto testando alle estremità della gamma di colori. Per effetti di profondità sottili, usa sfumature tra sfumature dello stesso colore piuttosto che saltare tra colori diversi. I gradienti radiali con centri posizionati (utilizzando la sintassi at x% y%) creano effetti spotlight drammatici perfetti per sezioni hero. Esporta i tuoi gradienti preferiti come proprietà personalizzate CSS per mantenere la coerenza tra i componenti e abilitare il cambio di tema."}