{"p2":"Converti PDF colorati in scala di grigi, riducendo significativamente le dimensioni del file per documenti con molte immagini colorate. Questo è particolarmente efficace per PDF di fotografie, illustrazioni e grafica a colori dove la scala di grigi riduce lo spazio di archiviazione del 30-50%. La conversione a scala di grigi migliora anche la compatibilità di stampa quando alcuni documenti sono stampati su stampanti in bianco e nero. Lo strumento mantiene il contrasto e la leggibilità del testo durante la conversione. Tutti i dati rimangono locali nel browser.","p3":"Le agenzie di stampa convertono PDF di materiali di marketing a colori in scala di grigi per ridurre i costi di stampa quando la versione in scala di grigi è accettabile. I archivi digitali convertono PDF di collezioni storiche in scala di grigi per ridurre lo spazio di archiviazione su server con spazio limitato. Le scuole convertono PDF di materiali didattici a colori in scala di grigi per risparmio di inchiostro nelle fotocopiatrici. I responsabili di documenti convertono PDF di report aziendali a colori in scala di grigi per la distribuzione via email quando la dimensione del file è una preoccupazione. I fornitori di contenuti digitali convertono PDF a colori in scala di grigi per versioni a banda larga più bassa.","p4":"Quando converti in scala di grigi, considera se i grafici e le immagini rimangono leggibili; alcuni codici a colori o grafici potrebbero diventare difficili da distinguere. La conversione a scala di grigi è irreversibile tramite questo strumento; conserva l'originale a colori se potrebbe essere necessario in futuro. Se il PDF contiene testo colorato per evidenziazione, il testo rimane leggibile ma perde l'enfasi di colore. Prova il PDF convertito per assicurarti che il contrasto sia ancora sufficiente per la leggibilità su schermi e in stampa. I grafici che si basano sulla codifica a colore dovrebbero essere esaminati manualmente per assicurarsi che rimangono comprensibili."}