{"p2":"Imposta il numero desiderato di colonne e righe usando i controlli di dimensione, poi clicca Generate Grid per creare una tabella modificabile. Digita direttamente in ogni cella—lo strumento gestisce l'avvolgimento del testo e il dimensionamento automatico delle celle. Scegli l'allineamento a sinistra, centro o destra per ogni colonna usando i pulsanti di allineamento. Mentre modifichi, il pannello di output Markdown si aggiorna in tempo reale mostrando la sintassi della tabella correttamente formattata. Copia l'output Markdown e incollalo direttamente nel tuo README, problema GitHub o documentazione. Il generatore produce tabelle in stile pipe compatibili con GitHub Flavored Markdown. Tutta la generazione avviene localmente nel tuo browser.","p3":"I manutentori di open source creano matrici di confronto per i file README che elencano le caratteristiche del framework tra le versioni. Gli scrittori tecnici costruiscono tabelle di dati strutturati per la documentazione API senza memorizzare la sintassi di pipe e trattini. Gli studenti formattano i dati di ricerca in tabelle per i post di blog di GitHub Pages. Gli sviluppatori documentano le matrici dei casi di test che mostrano le combinazioni di input/output per le specifiche delle funzioni nei wiki basati su markdown.","p4":"Usa le righe di intestazione per i titoli delle colonne e assicurati che siano significative—i lettori di schermo e i parser si affidano ad essi per il contesto. Imposta l'allineamento prima di inserire i dati per visualizzare in anteprima come i numeri o il testo appariranno nell'output renderizzato. Mantieni il contenuto della cella conciso; il testo eccessivamente lungo nelle celle della tabella rompe il layout in molti renderer Markdown. Se hai bisogno di formattazione complessa all'interno delle celle (come il codice inline), testa l'output renderizzato nella tua piattaforma target prima. Salva le strutture di tabella comuni come modelli copiando l'Markdown grezzo per il riutilizzo."}