{"p2":"Carica qualsiasi immagine dal tuo dispositivo facendo clic sull'area di caricamento o trascinando e rilasciando un file. Lo strumento analizza i dati dei pixel utilizzando algoritmi di clustering k-means per identificare i colori più dominanti e rappresentativi nella tua immagine, estraendo in genere 5-8 tonalità chiave che catturano l'essenza dei colori dell'immagine. Ogni colore estratto si visualizza con il suo codice hex e puoi fare clic su qualsiasi campione per copiare il valore istantaneamente. Questo rende facile costruire schemi di colore ispirati da fotografie, opere d'arte o immagini di marchio. Tutta l'elaborazione delle immagini avviene nel tuo browser: i file non vengono mai caricati su alcun server.","p3":"I designer di marchi estraggono le tavolozze dalla fotografia dei prodotti per assicurare che gli schemi di colore del sito web si armonizzino perfettamente con le immagini hero e gli scatti dei prodotti. Gli interior designer caricano le foto della stanza per identificare i colori esistenti in mobili e arredamento, quindi costruiscono schemi complementari per pareti e accenti. I gestori dei social media creano grafica con marchio estraendo colori dalla fotografia del logo o della campagna per mantenere l'identità visiva coerente nei post. Gli sviluppatori web che costruiscono temi per portafogli fotografici estraggono le tavolozze dalle immagini in primo piano per creare layout coesi in cui i colori dell'interfaccia utente si completano piuttosto che scontrarsi con il contenuto.","p4":"Le immagini con molti colori possono estrarre sfumature torbide o troppo simili: per tavolozze più pulite, carica immagini con regioni di colore distinte o tavolozze limitate per iniziare. L'algoritmo pesa i colori in base all'area, quindi i colori di sfondo dominanti appaiono più in evidenza rispetto ai piccoli dettagli di accento. Ritaglia la tua immagine prima di caricarla per mettere a fuoco regioni di colore specifiche se vuoi una tavolozza da solo parte dell'immagine. L'illuminazione influisce significativamente sui colori estratti; una foto esterna in ora d'oro produce tonalità più calde della stessa scena in luce di mezzogiorno. Combina le tavolozze estratte con il generatore di armonia per espandersi oltre i colori di immagine letterali negli schemi complementari."}