{"p2":"Inserisci la tua password, un valore di salt univoco e configura i parametri PBKDF2. Seleziona la funzione di hash (SHA-1, SHA-256, SHA-384 o SHA-512), imposta il conteggio delle iterazioni (più alto è più lento ma più sicuro) e specifica la lunghezza della chiave di output in bit. Clicca Genera per derivare una chiave crittografica dalla password usando l'implementazione PBKDF2 dell'API Web Crypto. La chiave derivata viene visualizzata come una stringa esadecimale. Usalo per sistemi di encriptazione basati su password in cui hai bisogno di una chiave coerente derivata dalla password di un utente. Tutta l'elaborazione avviene localmente nel tuo browser.","p3":"Gli sviluppatori che implementano l'encriptazione basata su password generano chiavi da password utente per l'encriptazione AES senza archiviare la password effettiva. Gli ingegneri di sicurezza testano le implementazioni di hashing delle password generando output attesi per confrontarli con i sistemi di produzione. Gli sviluppatori backend derivano chiavi di encriptazione del database dalle password master nelle applicazioni che richiedono encriptazione dati trasparente. Gli studenti di crittografia imparano come le funzioni di derivazione delle chiavi rafforzano la sicurezza basata su password sperimentando con parametri diversi.","p4":"Usa almeno 100.000 iterazioni per gli standard di sicurezza moderni; OWASP raccomanda 600.000+ per PBKDF2-HMAC-SHA256. Il salt deve essere casuale e univoco per utente; non riutilizzare mai salt o gli attaccanti possono usare tavole arcobaleno precompilate. Archivia il salt accanto alla chiave derivata poiché ne avrai bisogno per ri-derivare la chiave dalla password in seguito. I conteggi di iterazione più alti rallentano gli attacchi di brute force ma anche rallentano la derivazione legittima delle chiavi; bilancia la sicurezza rispetto all'esperienza utente. Gli alternative moderni come Argon2 sono preferiti per le implementazioni nuove, ma PBKDF2 rimane ampiamente supportato per la compatibilità legacy."}