{"p2":"Inserisci il tuo valore di potenza in qualsiasi unità che include Watt, kilowatt, megawatt, cavalli vapore (meccanica), PS (cavalli vapore metrica), BTU all'ora o piedi-libbre al secondo. Lo strumento mostra conversioni istantanee su tutte le unità, permettendoti di confrontare la potenza elettrica in watt rispetto alla potenza meccanica in cavalli vapore o potenza termica in BTU/h. Questo rende semplice tradurre le specifiche da diversi settori o regioni che preferiscono unità diverse. Tutti i calcoli vengono eseguiti localmente nel tuo browser per conversioni veloci e private senza caricamenti server.","p3":"Gli ingegneri automobilistici convertono i rating della potenza del motore tra cavalli vapore e kilowatt quando confrontano le specifiche dei veicoli americani ed europei o soddisfano i requisiti di etichettatura normativa. I contraenti HVAC traducono la capacità di raffreddamento dell'aria condizionata da BTU/h a kilowatt quando calcolano il carico elettrico per i sistemi di alimentazione dell'edificio. Gli acquirenti di attrezzature industriali confrontano le specifiche dei motori elencate in unità diverse: convertendo PS a HP o kW a seconda dell'origine del produttore. Gli installatori solari calcolano se il consumo di picco di una casa in kilowatt può essere soddisfatto dallo spazio disponibile sul tetto per l'installazione dei pannelli.","p4":"Nota che i cavalli vapore meccanici (745,7 W) differiscono leggermente dai cavalli vapore metrici o PS (735,5 W): specifica sempre quale tipo utilizzi nella documentazione tecnica. BTU all'ora misura la potenza termica, ma uno BTU/h equivale a solo circa 0,293 watt, rendendolo molto più piccolo di quanto potresti aspettare. Quando il dimensionamento dei generatori o dei circuiti elettrici, ricorda di considerare il fattore di potenza: la potenza apparente in VA differisce dalla potenza reale in watt. Per i carichi continui come motori o riscaldatori, gli interruttori automatici dovrebbero essere classificati per almeno il 125% del carico di potenza per evitare di disattivare istantaneamente il circuito."}