{"p2":"Digita il tuo testo, URL o qualsiasi dato stringa nel campo di input. Il codice QR genera immediatamente nell'area di anteprima mentre digiti. Regola il cursore della dimensione per cambiare le dimensioni dell'output da piccolo a grande. Usa il dropdown della correzione degli errori per impostare il livello di recupero—i livelli più alti permettono al codice QR di continuare a scansionarsi correttamente anche se parzialmente danneggiato o sporco. Personalizza i colori in primo piano e sfondo usando i color picker, anche se il contrasto elevato tra loro assicura una migliore affidabilità della scansione. Clicca download per salvare il codice QR come immagine PNG. Tutta la generazione avviene nel tuo browser usando la libreria qrcode.js.","p3":"I proprietari di ristoranti generano codici QR che collegano ai menu digitali, stampandoli su piccoli cartelli da tavolo in modo che i clienti possano sfogliare senza menu fisici. Gli organizzatori di eventi creano codici QR contenenti indirizzi del luogo o URL di registrazione per poster e conferme email. Le aziende al dettaglio incorporano codici QR sull'imballaggio dei prodotti che collegano a istruzioni di configurazione o offerte promozionali. Gli insegnanti generano codici QR per link di invio dei compiti o risorse della classe, stampandoli su fogli di lavoro in modo che gli studenti possano accedere rapidamente ai materiali sui loro dispositivi.","p4":"Usa la correzione degli errori alta (30 percento) se il codice QR sarà stampato su superfici strutturate o visualizzato all'esterno dove potrebbe accumularsi sporco o danno. Testa la scansione del tuo codice QR generato con più telefoni e app prima della stampa di massa per assicurarti la compatibilità tra i dispositivi. Per gli URL, usa prima un accorciatore di link per creare codici QR più piccoli che sono più facili da scansionare; meno punti dati significano pixel più grandi e migliore scansione a distanza. Attieniti al primo piano nero e sfondo bianco a meno che il branding non richieda assolutamente colori—alcune app di scansione faticano con basso contrasto o combinazioni di colori non convenzionali."}