{"p2":"Digita un numero arabo tra 1 e 3999, oppure inserisci un numerale romano utilizzando i simboli standard I, V, X, L, C, D e M. Il convertitore traduce istantaneamente in entrambe le direzioni, mostrando come gli antichi romani avrebbero scritto i numeri moderni e viceversa. Lo strumento riconosce la notazione sottrattiva in cui valori più piccoli prima di valori più grandi indicano sottrazione (come IV per 4 o IX per 9). Tutta l'elaborazione avviene nel tuo browser, rendendolo perfetto per il riferimento rapido senza dipendenza da Internet una volta caricato.","p3":"Gli studenti di storia traducono le date dai documenti storici che utilizzano numeri romani per gli anni, i preavvisi di copyright, o la numerazione dei capitoli in manoscritti antichi. I designer grafici che lavorano al branding classico o elegante necessitano di numeri romani per i quadranti dell'orologio, le pietre angolari degli edifici, o gli inviti a eventi formali come matrimoni e gala. Gli studi cinematografici utilizzano questo per codificare gli anni di produzione nei crediti dei film: convertendo gli anni di rilascio in numeri romani per quel'estetica senza tempo. Gli scrittori che formattano i manoscritti dei libri convertono i numeri dei capitoli in numeri romani per le sezioni della materia anteriore come prefazioni e indici.","p4":"I numeri romani seguono regole di formazione rigide: non utilizzare mai più di tre simboli identici consecutivi (eccetto M), e solo I, X e C possono essere utilizzati in coppie sottrattive. Le combinazioni sottrattive valide sono IV (4), IX (9), XL (40), XC (90), CD (400) e CM (900): altre combinazioni come VL o IC sono errate. Il limite superiore di 3999 esiste perché i romani non avevano un singolo simbolo per 5000, e i numeri oltre utilizzavano barre su simboli o altri notazioni speciali non ampiamente standardizzate. Quando leggi vecchie iscrizioni, ricorda che IIII per 4 appare su alcuni quadranti dell'orologio invece di IV a causa delle preferenze estetiche di simmetria."}