{"p2":"Inserisci il tuo stipendio annuale o la tua tariffa oraria: Tuttilo converte automaticamente tra i due formati. La calcolatrice assume una settimana lavorativa standard di 40 ore e 52 settimane all'anno (2.080 ore annuali). Vedrai istantaneamente ripartizioni per anno, mese, settimana, giorno e ora. Mentre lo strumento fornisce stime al lordo delle tasse, puoi avere un'idea approssimativa dello stipendio da portare a casa considerando il tuo scaglione fiscale separatamente. Tutti i calcoli avvengono direttamente nel tuo browser, quindi le tue informazioni sulla retribuzione rimangono private tra te e il tuo dispositivo.","p3":"I cercatori di lavoro confrontano le offerte di stipendio da diversi datori di lavoro che quotano il compenso in formati diversi (orario rispetto a stipendiato). I freelancer determinano tariffe orarie appropriate lavorando all'indietro dal reddito annuale desiderato e dalle ore fatturabili previste. I dipendenti che negoziano aumenti calcolano il valore orario dei propri aumenti di stipendio proposti. I lavoratori part-time che passano a posizioni a tempo pieno proiettano i loro guadagni annuali in base alla loro tariffa oraria attuale.","p4":"Ricorda che le posizioni salariata spesso includono vantaggi valutati al 20-30% dello stipendio base, quindi confronta i pacchetti di compensazione totale anziché solo i numeri. Quando lavori come freelancer, la tua tariffa oraria dovrebbe essere significativamente più elevata rispetto a una posizione salariata equivalente per tenere conto delle tasse sul lavoro autonomo, della mancanza di vantaggi e del tempo amministrativo non fatturabile. Considera che i lavoratori orari possono avere ore variabili mentre i dipendenti stipendiati spesso lavorano oltre le 40 ore senza compensazione aggiuntiva. La posizione geografica influisce drammaticamente sul potere d'acquisto reale, quindi uno stipendio di 60.000 dollari in un'area a basso costo potrebbe fornire una qualità della vita migliore rispetto a 90.000 dollari in una città cara."}