{"p2":"Seleziona il tuo sistema di taglie iniziale: US Men's, US Women's, UK, European (EU) o centimetri (lunghezza effettiva del piede). Inserisci la tua taglia di scarpe. Scegli il sistema di dimensionamento in cui desideri convertire. Tuttilo mostra la taglia equivalente immediatamente, utilizzando grafici di conversione standard impiegati dai produttori di calzature. Ricorda che queste conversioni sono approssimazioni: i marchi variano leggermente nelle loro dimensioni. Lo strumento elabora tutto localmente nel tuo browser per mantenere private le tue misurazioni personali.","p3":"Gli acquirenti online che acquistano scarpe da rivenditori internazionali convertono le taglie per assicurare l'adattamento corretto prima di ordinare. I viaggiatori che acquistano scarpe all'estero determinano rapidamente la loro taglia in sistemi di dimensionamento non familiari. Gli acquirenti di regali misurano i piedi dei destinatari in centimetri per ordinare scarpe quando non conoscono la taglia dichiarata della persona. I rivenditori che stoccano marchi internazionali convertono tra sistemi per l'etichettatura degli scaffali e la gestione dell'inventario. Gli atleti che ordinano scarpe sportive specializzate da produttori in diversi paesi verificano la compatibilità delle taglie.","p4":"Le taglie US Women's sono in genere 1,5 taglie più grandi rispetto alle taglie US Men's per la stessa lunghezza del piede: quindi una donna 8 equivale a un uomo 6.5. Le taglie UK funzionano circa una taglia più piccola rispetto alle taglie US a causa di diversi punti di partenza nelle loro scale di dimensionamento. Le taglie europee si basano sul Paris point (2/3 cm), rendendole più precise ma meno intuitive. Misura sempre entrambi i piedi e usa la misurazione più grande, poiché la maggior parte delle persone ha piedi leggermente di dimensioni diverse. I convertitori di taglie di scarpe mostrano l'equivalente più vicino, ma la larghezza (stretta, media, larga) non è standardizzata nei sistemi: ordina da rivenditori con politiche di restituzione flessibili quando acquisti marchi internazionali."}