{"p2":"Seleziona l'unità di velocità iniziale, come chilometri all'ora, miglia all'ora, metri al secondo, nodi o Mach. Inserisci il tuo valore di velocità. Scegli l'unità in cui desideri convertire. Tuttilo converte istantaneamente la tua velocità utilizzando fattori di conversione standard, tenendo conto delle differenze tra le unità di velocità e velocità. Lo strumento supporta tutto, dalle velocità di cammino alle velocità supersoniche. Tutti i calcoli vengono eseguiti localmente nel tuo browser, proteggendo la privacy dei tuoi dati.","p3":"I piloti convertono le velocità di aria indicate tra nodi e miglia all'ora per la pianificazione del volo e la comunicazione con i controllori. I corridori interpretano le velocità del tapis roulant visualizzate in miglia all'ora nel loro ritmo preferito di minuti per chilometro. Gli scienziati che analizzano il movimento in esperimenti di fisica convertono tra metri al secondo e altre unità per la segnalazione standardizzata. I viaggiatori che guidano internazionalmente convertono le letture del tachimetro quando le auto a noleggio visualizzano unità diverse dai segnali stradali. I navigatori marittimi calcolano le velocità delle navi in nodi mentre coordinano con i team basati a terra utilizzando mph o km/h.","p4":"I nodi (miglia nautiche all'ora) rimangono standard nelle applicazioni di aviazione e marittime perché le miglia nautiche si relazionano direttamente alla geometria terrestre (1 miglio nautico ≈ 1 minuto di latitudine). Il numero Mach rappresenta la velocità rispetto alla velocità del suono, che varia con la temperatura e la pressione dell'aria: Mach 1 al livello del mare è approssimativamente 767 mph, ma più lento ad altitudini più elevate. Per le conversioni di ritmo di corsa, ricorda che velocità più elevate significano numeri di ritmo più piccoli, il che può essere controintuitivo. Quando si convertono le velocità dell'auto, nota che 100 km/h sono approssimativamente 62 mph, un utile riferimento per le approssimazioni mentali rapide su strade internazionali."}