{"p2":"Inserisci la tua chiave segreta TOTP (di solito fornita come stringa codificata in Base32 quando configuri l'autenticazione a due fattori) e clicca Genera. Lo strumento calcola la password monouso basata sul tempo di 6 cifre corrente usando l'algoritmo TOTP con HMAC-SHA1 e passaggi di tempo di 30 secondi. Un timer di conto alla rovescia mostra quanti secondi rimangono prima che il codice scada e uno nuovo genera. I codici generati corrispondono a quelli dalle app di autenticatore come Google Authenticator o Authy quando usano la stessa chiave segreta. Tutta l'elaborazione funziona localmente nel tuo browser usando l'API Web Crypto.","p3":"Gli sviluppatori che testano i sistemi di autenticazione TOTP generano codici manualmente per verificare che la logica di convalida lato server funzioni correttamente. Gli utenti che hanno perso l'accesso alla loro app di autenticatore ma hanno salvato le loro chiavi segrete lo usano per generare codici e riottenere l'accesso all'account. Gli ingegneri di sicurezza controllano le implementazioni TOTP generando codici attesi e confrontandoli con quello che il sistema accetta. Gli sviluppatori backend risolvono i problemi di sincronizzazione dell'ora generando codici in timestamp specifici per testare la tolleranza della deriva.","p4":"I codici TOTP sono validi solo per una finestra di tempo stretta (tipicamente 30 secondi), quindi assicurati che l'orologio del tuo sistema sia accurato o i codici non si convalideranno. Le chiavi segrete sono case-insensitive ma non devono contenere spazi o trattini; rimuovi la formattazione se hai copiato da una fonte che include separatori. Salva la tua chiave segreta da qualche parte sicura; se la perdi e la tua app di autenticatore, avrai bisogno del recupero dell'account. La maggior parte dei sistemi accetta i codici dalla finestra di tempo corrente e precedente per tenere conto della deriva dell'orologio e della velocità di digitazione dell'utente. Questo strumento è compatibile con lo standard RFC 6238 TOTP, quindi i codici funzionano con qualsiasi servizio conforme."}