{"p2":"Scegli l'unità di peso iniziale dalle opzioni che includono metrica (milligrammi, grammi, chilogrammi, tonnellate) e imperiale (once, libbre, pietre). Digita il tuo valore di peso. Seleziona l'unità in cui desideri convertire e Tuttilo mostra istantaneamente il risultato convertito con precisione completa. Funziona sia per piccole misurazioni come ingredienti di cucina che per pesi grandi come masse di veicoli. Il convertitore utilizza rapporti di conversione standard scientificamente riconosciuti e tutta l'elaborazione avviene lato client nel tuo browser.","p3":"I cuochi che seguono le ricette internazionali convertono i pesi degli ingredienti da metrici a imperiali o viceversa. I lavoratori postali e i dipartimenti di spedizione calcolano i pesi dei pacchetti in diverse unità per determinare le tariffe di spedizione per i vettori domestici rispetto a quelli internazionali. I viaggiatori pesano i bagagli per verificare che rispettino i limiti delle compagnie aeree specificati in chilogrammi o libbre. Gli appassionati di fitness monitorano il peso corporeo quando la loro bilancia mostra unità diverse dal formato preferito della loro app di tracciamento. Gli scienziati che conducono ricerche convertono i pesi per mantenere la coerenza in tutti i documenti che utilizzano diversi sistemi di misurazione.","p4":"Una libbra (lb) non è la stessa di una libbra di massa (lbm) rispetto alla forza di libbra (lbf) in contesti tecnici: questo convertitore utilizza unità di massa. Le pietre britanniche (14 libbre ciascuna) sono raramente utilizzate al di fuori del Regno Unito e dell'Irlanda, ma rimangono comuni per il peso corporeo umano in quelle regioni. Quando si misurano metalli preziosi o gemme, le once troy differiscono dalle once standard (avoirdupois): utilizza convertitori specializzati per quelle applicazioni. Per la cucina, ricorda che le conversioni peso-volume dipendono dalla densità dell'ingrediente, quindi una tazza di farina pesa molto meno di una tazza di zucchero nonostante il volume identico."}