{"p2":"Incolla il tuo URL del video YouTube, quindi configura le opzioni di incorporamento utilizzando le caselle di controllo e gli input: abilita la riproduzione automatica per avviare il video immediatamente al caricamento della pagina, imposta il ciclo per riprodurre infinitamente, disattiva l'audio per impostazione predefinita (richiesto per la riproduzione automatica nella maggior parte dei browser), specifica un'ora di inizio in secondi per saltare le intro, nascondi i controlli video per incorporamenti più puliti e attiva/disattiva la modalità reattiva per generare CSS a larghezza fluida. Lo strumento costruisce il codice di incorporamento corretto dell'iframe con tutte le tue opzioni codificate come parametri URL. Copia l'HTML completo e incollalo nella tua pagina Web. Tutta la generazione di codice avviene nel tuo browser.","p3":"Le pagine di destinazione incorporano video demo di prodotti con riproduzione automatica e disattivazione abilitati per creare hero video di sfondo silenzioso che attirano l'attenzione senza disturbare l'esperienza di navigazione. I post del blog incorporano video tutorial con orari di inizio specifici che saltano le intro e saltano direttamente all'istruzione pertinente. I siti di portfolio utilizzano controlli nascosti e impostazioni di ciclo per video di sfondo ambientale che si riproducono continuamente senza ingombro dell'interfaccia utente. I corsi online incorporano video di lezioni con dimensionamento reattivo in modo che gli studenti che guardano su telefoni, tablet o computer desktop funzionino correttamente.","p4":"La riproduzione automatica con suono funziona solo quando gli utenti hanno interagito con il tuo sito per primo: i browser lo bloccano altrimenti per evitare esperienze fastidiose. Combina sempre la riproduzione automatica con disattivazione per assicurare una riproduzione affidabile. Il parametro rel=0 che una volta rimuoveva i video correlati non funziona più; YouTube ora mostra solo i video correlati dello stesso canale alla fine del video. L'ora di inizio utilizza i secondi, non i timestamp: per 1:30, inserisci 90 secondi. Gli incorporamenti reattivi richiedono div wrapper con CSS di rapporto di aspetto specifico; copia il codice fornito esattamente. La modalità potenziata per la privacy (utilizzando youtube-nocookie.com) impedisce a YouTube di tracciare gli spettatori fino a quando non riproducono il video."}