{"p2":"Digite sua mensagem plaintext no campo de entrada e crie uma senha forte no campo de senha. Clique Criptografar para transformar seu texto usando AES-256-GCM, um padrão de criptografia de nível militar. A ferramenta deriva uma chave criptográfica de sua senha usando PBKDF2 com 100.000 iterações e um salt aleatório. A saída criptografada inclui o salt, vetor de inicialização e ciphertext combinados em string codificada Base64. Para decrip, cole a string criptografada, digite a mesma senha e clique Decrip. Se a senha está incorreta ou dados corrompidos, decrip falha com erro. Todas operações criptográficas usam Web Crypto API no seu navegador.","p3":"Usuários compartilham seguramente informações sensíveis como senhas ou detalhes de conta criptografando o texto, enviando-o através de canais inseguros como email e compartilhando a senha de decrip separadamente através de um canal diferente como SMS. Desenvolvedores testam implementações de criptografia criptografando dados de teste e verificando que sua aplicação pode decrip corretamente. Indivíduos conscientes de segurança criptografam notas contendo informações confidenciais antes de armazenar em apps de nota-taking em nuvem. Departamentos de TI demonstram conceitos de criptografia durante treinamento de segurança deixando funcionários criptografar e decrip mensagens de amostra.","p4":"Escolha uma senha forte e única para criptografia; senhas fracas podem ser força bruta independentemente de força AES. Nunca envie dados criptografados e senha através do mesmo canal; se um atacante intercepta ambos, criptografia é inútil. Salve a string criptografada inteira incluindo metadados; perder qualquer parte significa você não pode decrip a mensagem. Modo GCM fornece criptografia autenticada, então se alguém altera o ciphertext, decrip falhará em vez de produzir saída de lixo. Esta ferramenta é apropriada para criptografia manual ocasional, mas aplicações de produção devem usar sistemas de gerenciamento de chave adequados em vez de chaves derivadas de senha."}