{"p2":"Adicione sua primeira camada de sombra com o botão plus, depois ajuste deslocamento horizontal (X), deslocamento vertical (Y), raio de desfoque e espalhamento usando os controles deslizantes ou entrada direta. Escolha sua cor de sombra e defina sua opacidade usando o controle deslizante alfa. Alterne entre sombras externas (padrão) e sombras embutidas para efeitos de brilho interno. Adicione múltiplas camadas de sombra para criar efeitos de profundidade complexa—cada camada se empilha em cima das anteriores. A visualização atualiza instantaneamente conforme você ajusta qualquer parâmetro e a saída CSS reflete sua declaração de sombra completa pronta para copiar em suas folhas de estilo.","p3":"Designers de UI baseado em cartões adicionam sombras sutis para elevar cartões de conteúdo acima de backgrounds de página, criando hierarquia que guia usuários através da arquitetura de informação. Sites de comércio eletrônico usam sombras pronunciadas em imagens de produto e botões 'Adicionar ao Carrinho' para fazer com que pareçam táteis e clicáveis. Construtores de painel em camadas múltiplas sombras com raios de desfoque diferentes para alcançar níveis realistas de profundidade de design material—uma sombra nítida para definição mais uma sombra suave para iluminação ambiente. Agências criativas designam efeitos de pairação dramáticos animando propriedades de sombra, fazendo elementos de interface aparecerem para decolar a página quando usuários interagem.","p4":"Camadas de sombra da maior/mais suave (fundo) para a menor/mais nítida (topo) para imitar iluminação natural onde luz ambiente cria sombras suaves e luz direta cria bordas definidas. Mantenha valores de espalhamento mínimos (0-4px)—espalhamento excessivo faz sombras parecerem artificiais e estilo cartoon. Para profundidade realista, posicione a sombra principal ligeiramente abaixo e para a direita (X e Y positivos) simulando luz de canto superior-esquerdo, uma convenção que usuários esperam. Sombras embutidas funcionam lindamente para campos de entrada para criar aparências embutidas. Use preto semi-transparente (rgba(0,0,0,0.1-0.3)) para muitas sombras em vez de preto puro, que parece áspero."}