{"p2":"Carregue uma imagem ou selecione cores de sua paleta de design, depois escolha qual tipo de deficiência de visão de cor simular: protanopia (cegueira ao vermelho), deuteranopia (cegueira ao verde), tritanopia (cegueira ao azul), protanomalia (sensibilidade ao vermelho reduzida), deuteranomalia (sensibilidade ao verde reduzida) ou tritanomalia (sensibilidade ao azul reduzida). A ferramenta aplica transformações matemáticas que acuradamente modelam como essas condições afetam percepção de cor. Compare a visualização simulada lado a lado com o original para identificar combinações de cor problemáticas que seriam indistinguíveis para usuários afetados. Todos processam localmente no seu navegador para privacidade.","p3":"Designers de UI testam se elementos críticos de interface como estados de erro (tradicionalmente vermelho) e mensagens de sucesso (tipicamente verde) permanecem distinguíveis para usuários daltônicos antes de finalizar designs. Especialistas em visualização de dados verificam que cores de gráfico, linhas de gráfico e mapas de calor comunicam informação através de padrões ou rótulos além de apenas codificação de cor. Criadores de infográfico garantem que ícones, callouts e distinções de categoria não confiam apenas em diferenças de cor que desaparecem sob deficiência de visão de cor. Desenvolvedores de games testam se mecânicas de gameplay dependentes de reconhecimento de cor (como correspondência de fio ou identificação de inimigo) permanecem jogáveis para jogadores daltônicos.","p4":"Deuteranomalia (sensibilidade ao verde reduzida) afeta aproximadamente 6% de machos e é a forma mais comum—sempre teste contra essa variante no mínimo. Evite combinações vermelho-verde inteiramente já que protanopia e deuteranopia ambas confundem essas cores; use emparelhamentos azul-laranja em vez para melhor acessibilidade. Não confie em cor sozinha para comunicar informação—suplementar com padrões, formas, ícones ou rótulos de texto. Ferramentas como este simulador não são perfeitas já que aproximam em vez de replicar a experiência real, mas capturam maioria de problemas maiores. Combine teste de simulação com verificação de proporção de contraste para validação abrangente de acessibilidade."}