{"p2":"Selecione sua cor de primeiro plano (texto) e cor de fundo usando os seletores de cor ou digitando códigos hex diretamente. A ferramenta calcula imediatamente a proporção de contraste WCAG e exibe resultados de aprovação/reprovação para quatro critérios diferentes: Nível AA texto normal (4.5:1), Nível AA texto grande (3:1), Nível AAA texto normal (7:1) e Nível AAA texto grande (4.5:1). Texto grande significa 18pt e acima ou 14pt e acima quando negrito. Todos os cálculos usam a fórmula WCAG 2.1 oficial e funcionam inteiramente no seu navegador para feedback instantâneo.","p3":"Desenvolvedores web garantem que seu texto de site atenda requisitos de acessibilidade legal antes de lançar, evitando potenciais ações judiciais sob ADA ou regulações Seção 508. Designers de UI verificam que botões de call-to-action têm contraste suficiente contra backgrounds de página para que usuários com visão reduzida possam facilmente identificar elementos interativos. Desenvolvedores de app móvel testam se seus esquemas de cor de modo claro e modo escuro ambos passam em padrões AA para usuários em diferentes condições de iluminação. Agências governamentais construindo websites voltados para o público frequentemente devem atingir padrões AAA em muitas jurisdições, exigindo seleção de cor cuidadosa validada através de verificação de contraste.","p4":"Sempre alvo de conformidade com Nível AA no mínimo—muitos países legalmente exigem para websites governamentais e comerciais. Nível AAA fornece melhor acessibilidade mas pode ser desafiador com cores de marca; priorize para corpo de texto enquanto AA pode ser suficiente para elementos decorativos. Lembre-se de que requisitos de contraste diferem para texto grande (18pt+ regular ou 14pt+ negrito) versus texto normal. Proporções de contraste se aplicam a todos cenários de texto-sobre-fundo incluindo texto sobre imagens, portanto teste combinações de overlay cuidadosamente. Ao usar texto claro sobre backgrounds coloridos, branco puro frequentemente funciona melhor que branco-off já que cada passo longe de branco reduz contraste."}