{"p2":"Escolha uma data de início e data final usando os seletores de data ou digitando datas diretamente. O Tuttilo calcula instantaneamente a duração entre elas, exibindo resultados em anos e meses, total de meses, total de semanas, total de dias, total de horas e total de minutos. A calculadora automaticamente lida com comprimentos de mês variáveis, anos bissextos e transições de horário de verão para resultados precisos. Você pode trocar as datas ou calcular retroativamente a partir de uma data futura. Todos os cálculos de data funcionam inteiramente no seu navegador para manter suas informações de linha do tempo pessoal privadas.","p3":"Gerentes de projeto calculam duração de dias de trabalho entre datas de marco para estimar tempos de conclusão de tarefa e identificar conflitos de cronograma. Casais rastreiam a duração exata de seus relacionamentos para celebrações de aniversário. Planejadores de eventos fazem contagem regressiva de dias até casamentos, conferências ou lançamentos de produtos. Profissionais jurídicos calculam períodos de estatuto de limitações ou durações de termo de contrato. Viajantes planejando viagens determinam quantos dias estarão no exterior para requisitos de visto ou seguro de viagem. Mulheres grávidas rastreiam progressão de gravidez calculando semanas entre datas de concepção e datas de entrega.","p4":"Ao calcular dias úteis em vez de dias do calendário, lembre-se que o Tuttilo mostra dias do calendário—você precisará subtrair fins de semana e feriados separadamente. Para contratos abrangendo anos, sempre verifique se os termos usam anos civis ou datas de aniversário, já que \"um ano\" pode significar coisas diferentes legalmente. Formatos de data internacionais (MM/DD/AAAA versus DD/MM/AAAA) causam confusão—verifique duas vezes qual formato você está usando para evitar calcular o intervalo errado. Adicione um dia ao calcular intervalos inclusivos onde ambas as datas de início e fim contam (como estadia de hotel de segunda para quarta é três noites, não duas)."}