{"p2":"Navegue através de emparelhamentos de fonte curados organizados por categorias de estilo como elegante, moderno, clássico, negrito e mínimo. Cada sugestão exibe um título na fonte primária emparelhada com texto de corpo na fonte complementar, deixando você ver exatamente como a combinação parece junto. Clique qualquer emparelhamento para visualizar links do Google Fonts para ambos os tipos de letra, prontos para adicionar ao seu projeto via tag de link padrão ou importação CSS. Ajuste o texto de visualização para ver como seu conteúdo real apareceria em cada emparelhamento. Filtre por humor de estilo para corresponder a objetivos estéticos do seu projeto, com todas as recomendações baseadas em princípios tipográficos comprovados.","p3":"Designers de website estabelecendo hierarquia visual emparelham uma fonte de título distintiva com uma fonte de corpo legível para criar interesse sem sacrificar legibilidade. Projetos de identidade de marca correspondem títulos serif com texto de corpo sans-serif (ou vice-versa) para equilibrar estética tradicional e moderna. Sites de portfólio usam fontes de display negrito para títulos de projeto emparelhadas com fontes de corpo neutras que mantêm foco em amostras de trabalho. Materiais de marketing combinam headers script ou decorativos com clean sans-serifs para corpo para adicionar personalidade enquanto mantêm legibilidade profissional.","p4":"Contraste é chave: emparelhe serif com sans-serif, condensado com amplo, pesado com leve—fontes similares competem em vez de complementar. Limite projetos a 2-3 tipos de letra no máximo; mais cria caos visual e prejudica desempenho com downloads de arquivo de fonte adicional. Ao emparelhar, garanta que x-alturas (a altura de letras minúsculas) sejam similares para que texto de corpo e títulos se sintam coesivos em diferentes tamanhos. Google Fonts sugere emparelhamentos populares baseado em dados de uso real de milhões de websites, tornando essas combinações testadas em combate. Sempre carregue font-display: swap para evitar texto invisível durante carregamento, especialmente em conexões mais lentas."}