{"p2":"Ajuste o controle deslizante de desfoque para controlar quanto conteúdo de fundo mostra através seu elemento de vidro—valores mais altos criam efeitos de congelamento mais fortes. Defina opacidade de fundo para determinar translucidez, saturação de cor para adicionar matiz (tornando seu vidro mais quente ou mais frio) e transparência de borda para o destaque de borda sutil característico. A visualização exibe seu cartão de vidro contra um fundo de gradiente personalizável para que você veja exatamente como interage com conteúdo atrás dele. Copie o CSS completo incluindo backdrop-filter, fundo e propriedades de borda prontas para uso em produção. Toda renderização acontece no seu navegador.","p3":"Interfaces de painel usam painéis glassmórficos para informação em camadas sobre backgrounds dinâmicos como vídeo ou gradientes animados enquanto mantém legibilidade. Designers de app móvel criam barras de navegação congeladas e modais que deixam conteúdo subjacente aparecer, mantendo contexto enquanto focam atenção em elementos de primeiro plano. Páginas de destino empregam cartões de vidro para tabelas de preços ou destaques de recurso, adicionando profundidade sofisticada que se sente premium e moderno. Interfaces do player de música usam glassmorphism para controles de reprodução sobrepondo artwork de álbum, criando coesão visual entre UI e conteúdo.","p4":"Desfoque de backdrop-filter funciona melhor entre 10-20px—valores menores mal congelam enquanto valores maiores tornam vidro opaco. Sempre inclua fallback de fundo semi-transparente para navegadores sem suporte a backdrop-filter, particularmente versões Firefox mais antigas. Glassmorphism parece mais impressionante contra backgrounds vibrantes ou multicoloridos; backgrounds sutis reduzem impacto visual. Adicione uma borda brilhante fina (1px solid rgba(255,255,255,0.18)) para definir bordas contra backgrounds ocupados. Dica de desempenho: backdrop-filter é intensivo em GPU, portanto limite uso a seções hero ou elementos principais de UI em vez de aplicar através de layouts inteiros."}