{"p2":"Escolha sua cor base usando o seletor de cor ou digite um valor hex, então selecione uma entre seis regras de harmonia de cor: complementar para alto contraste, análoga para transições suaves, tríada para vibração equilibrada, split-complementar para contraste sofisticado, tetrádica para esquemas complexos ou monocromática para variações elegantes de matiz único. O gerador exibe instantaneamente sua paleta com todos os valores de cor mostrados em formatos hex, RGB e HSL. Clique qualquer cor para copiar seu valor ou use o recurso de travar para preservar cores enquanto regenera o resto. Todos processam no seu navegador usando matemática de teoria de cor.","p3":"Designers de marca estabelecendo sistemas de identidade visual usam esquemas tríada ou tetrádica para criar paletas abrangentes com cores primárias, secundárias e de acento para logos, materiais de marketing e propriedades digitais. Designers de interior confiam em paletas análogas ao selecionar tinta, tecidos e decor que harmonizam naturalmente dentro de um cômodo. Desenvolvedores web criando interfaces de modo escuro usam esquemas monocromáticos a partir de uma cor base para gerar tons consistentes para backgrounds, painéis e elementos de UI. Criadores de apresentação usam esquemas complementares para fazer pontos de dados chave aparecerem contra backgrounds de slide sem conflitar.","p4":"Cores complementares (opostas na roda de cores) fornecem contraste máximo mas podem vibrar desagradavelmente quando colocadas lado a lado em saturação completa—reduza intensidade para melhor equilíbrio. Esquemas análogos funcionam melhor quando você designa uma cor como dominante e usa as outras como acentos em proporções 60-30-10. Paletas tríada se sentem mais equilibradas quando uma cor domina enquanto as outras duas servem papéis de suporte. Antes de finalizar qualquer paleta, teste com o verificador de contraste para garantir legibilidade de texto atenda padrões WCAG. Exporte paletas bem-sucedidas como variáveis CSS ou design tokens para manter consistência através de seu projeto inteiro."}