{"p2":"Carregue qualquer imagem de seu dispositivo clicando na área de carregamento ou arrastando e soltando um arquivo. A ferramenta analisa dados de pixel usando algoritmos de agrupamento k-means para identificar as cores mais dominantes e representativas em sua imagem, extraindo típicamente 5-8 matizes principais que capturam a essência de cor da imagem. Cada cor extraída exibe com seu código hex e você pode clicar qualquer amostra para copiar o valor instantaneamente. Isso torna sem esforço construir esquemas de cor inspirados em fotografias, obra de arte ou imagens de marca. Todos processam imagem no seu navegador—arquivos nunca carregam para qualquer servidor.","p3":"Designers de marca extraem paletas de fotografia de produto para garantir que esquemas de cor de website harmonizam perfeitamente com imagens hero e fotos de produto. Decoradores de interior carregam fotos de cômodo para identificar cores existentes em móveis e decor, depois construem esquemas complementares para paredes e acentos. Gerentes de mídia social criam gráficos de marca extraindo cores de logos de empresa ou fotografia de campanha para manter identidade visual consistente através de posts. Desenvolvedores web construindo temas para portfólios de fotografia extraem paletas de imagens featured para criar layouts coesos onde cores de UI complementam em vez de conflitar com conteúdo.","p4":"Imagens com muitas cores podem extrair tons turvo ou overly similares—para paletas mais limpas, carregue imagens com regiões de cor distintas ou paletas limitadas para começar. O algoritmo pondera cores por área, portanto cores de fundo dominantes aparecem mais proeminentemente que pequenos detalhes de acento. Corte sua imagem antes de carregar para focar em regiões de cor específicas se você quiser uma paleta de apenas parte da imagem. Iluminação afeta cores extraídas significativamente; uma foto ao ar livre em hora dourada rende tons mais quentes que a mesma cena em luz do meio-dia. Combine paletas extraídas com o gerador de harmonia para expandir além cores literais de imagem em esquemas complementares."}