{"p2":"Digite seu texto, URL ou qualquer dado string no campo de entrada. O código QR gera imediatamente na área de visualização conforme você digita. Ajuste o slider de tamanho para alterar as dimensões de saída de pequeno a grande. Use a lista suspensa de correção de erro para definir nível de recuperação—níveis mais altos deixam o código QR ainda escanear corretamente mesmo se parcialmente danificado ou sujo. Customize cores de primeiro plano e plano de fundo usando seletores de cor, embora alto contraste entre elas garanta melhor confiabilidade de escaneamento. Clique download para salvar o código QR como imagem PNG. Toda geração acontece no seu navegador usando a biblioteca qrcode.js.","p3":"Proprietários de restaurante geram códigos QR ligando para menus digitais, imprimindo-os em cartões de mesa para que clientes possam navegar sem menus físicos. Organizadores de eventos criam códigos QR contendo endereços de local ou URLs de registro para cartazes e confirmações por email. Negócios de varejo incorporam códigos QR em embalagem de produtos que ligam a instruções de configuração ou ofertas promocionais. Professores geram códigos QR para links de submissão de trabalhos de casa ou recursos de sala de aula, imprimindo-os em planilhas para que alunos possam acessar rapidamente materiais em seus dispositivos.","p4":"Use correção de erro alto (30 por cento) se o código QR será impresso em superfícies texturizadas ou exibido ao ar livre onde possa acumular sujeira ou dano. Teste escanear seu código QR gerado com múltiplos telefones e apps antes de imprimir em massa para garantir compatibilidade entre dispositivos. Para URLs, use um encurtador de link primeiro para criar códigos QR menores que são mais fáceis de escanear; menos pontos de dados significam pixels maiores e melhor escaneamento a distância. Atenha-se a primeiro plano preto e plano de fundo branco a menos que branding absolutamente exija cores—algumas apps de escaneamento têm dificuldade com contraste baixo ou combinações de cor não convencionais."}