{"p2":"Use the on-screen buttons or your keyboard to enter numbers and operations. The calculator supports basic arithmetic (+, -, ×, ÷) plus scientific functions including trigonometry (sin, cos, tan), logarithms (log, ln), exponents (x², x^y), square root, and factorial. Access constants π and e via dedicated buttons. The display shows your current expression and the result. Use parentheses for grouping complex expressions. Angle mode switches between degrees and radians for trigonometric functions. Clear your expression with C or delete the last character with backspace. All calculations execute in your browser using JavaScript's Math library.","p3":"Students solve homework problems in physics, chemistry, and calculus courses. Engineers perform quick calculations during design work without opening desktop applications. Programmers verify mathematical formulas before implementing them in code. Researchers compute statistical values, logarithms, and exponential functions during data analysis. Teachers demonstrate mathematical concepts in classrooms using a projector. Online exam takers use the calculator when testing platforms prohibit installing software.","p4":"Switch to radian mode when working with calculus or higher mathematics—degrees are primarily for geometry and navigation. Remember order of operations: parentheses, exponents, multiplication/division (left to right), addition/subtraction (left to right). Use the ANS button to reference the previous result in a new calculation. For very large or very small numbers, the calculator uses scientific notation (e.g., 1.5e+10). The factorial function only works with non-negative integers and has limits around 170 due to JavaScript number precision. When chaining trigonometric operations, verify your angle mode matches your input.","p5":"The calculator uses JavaScript's Math object for all operations: Math.sin(), Math.cos(), Math.log(), Math.exp(), etc. Trigonometric functions receive input in radians; degree mode multiplies input by π/180 before computation. Expression parsing handles operator precedence and parentheses nesting using a recursive descent parser or similar algorithm. Constants π and e use Math.PI and Math.E. The factorial function is computed iteratively for integers up to the precision limit. Results are displayed with appropriate significant figures, using scientific notation for values outside the range 0.000001 to 999999."}