{"p2":"Enter an IPv4 address in dotted decimal format (e.g., 192.168.1.0) and specify the subnet prefix length using CIDR notation (e.g., /24). Click calculate and Tuttilo instantly computes all subnet parameters: network address, broadcast address, subnet mask in decimal and binary, first usable host IP, last usable host IP, and total number of usable hosts. The results display in both human-readable format and binary representation for educational purposes. All calculations happen in your browser using JavaScript bitwise operations, so your network configurations remain completely private.","p3":"Network administrators plan IP address allocation schemes for new office networks or VLANs. IT students learn subnetting concepts by experimenting with different prefix lengths and observing the resulting address ranges. System engineers validate subnet configurations before implementing firewall rules or routing tables. Cloud architects calculate the required CIDR block size for VPC networks based on expected instance counts. Network technicians troubleshoot connectivity issues by verifying whether two IPs belong to the same subnet. Home lab enthusiasts design complex multi-subnet networks for virtualization environments.","p4":"Remember that the first IP in a subnet is the network address and the last is the broadcast address—neither can be assigned to hosts. For point-to-point links, use /30 subnets which provide exactly 2 usable addresses. When planning growth, choose a subnet mask that provides 30-50% more addresses than your current need to avoid renumbering later. Class-based networking is obsolete—modern networks use CIDR exclusively, so avoid thinking in terms of Class A, B, or C. For IPv4 address exhaustion, consider private RFC 1918 ranges (10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16) with NAT.","p5":"The calculator performs bitwise AND operations between the IP address and subnet mask to derive the network address. The broadcast address is computed by setting all host bits to 1. Usable host count is calculated as 2^(32-prefix length) - 2, subtracting the network and broadcast addresses. Binary representations show the distinction between network and host portions of the address. All four octets are validated to ensure they fall within the 0-255 range. The tool supports all valid CIDR prefix lengths from /0 to /32."}