{"p2":"Digite qualquer URL de canal YouTube ou ID de canal. O analisador puxa estatísticas abrangentes de canal via API do YouTube: contagem total de inscritos, contagem de visualização cumulativa através de todos vídeos, número total de vídeos publicados, data de criação de canal e visualizações médias calculadas por vídeo. Alguns canais ocultam contagens de inscritos para privacidade; a ferramenta exibe isso quando disponível. Use métricas para avaliar crescimento de canal, comparar seu desempenho contra competidores ou pesquisar potenciais parceiros de colaboração. Nenhuma autenticação exigida—apenas cole a URL e analise. Todos processam no seu navegador.","p3":"Criadores aspiradores pesquisam canais estabelecidos em seu nicho para definir expectativas realistas de crescimento e entender como quantidade de vídeo se relaciona com contagens de inscritos. Marcas avaliando parcerias de influenciador verificam reivindicações de inscritos e avaliam taxas de engajamento comparando inscritos contra visualizações médias por vídeo. Agentes de talento procurando criadores de conteúdo identificam canais crescentes com proporções de visualização-para-inscritos altas indicando audiência ativa ou conteúdo viral. Analistas competitivos rastreiam stats de canal de competidor ao longo do tempo para monitorar deslocamentos de participação de mercado em nichos de conteúdo.","p4":"Visualizações médias por vídeo importa mais que contagem de inscritos—um canal com 10k inscritos média 15k visualizações tem melhor engajamento que 100k inscritos média 2k visualizações, indicando audiência ativa ou conteúdo viral. Idade de canal contextualiza contagens de inscritos; 100k inscritos em um ano é crescimento explosivo enquanto 100k durante dez anos é modesto. Alguns canais compram inscritos, visível quando contagem de inscritos vastamente excede contagens de visualização (proporção deveria ser aproximadamente 1:10 a 1:20 para canais saudáveis). Compare visualizações totais a contagem de vídeo para estimar esforço necessário para resultados similares em seu nicho. Contagens de inscritos ocultas frequentemente indicam canais menores sensíveis sobre aparentar pequeno ou criadores muito grandes evitando escrutínio."}