{"s1":{"h":"コンテナとコーデック：根本的な違い","p":"動画フォーマットを理解するには、コンテナとコーデックの違いを理解する必要があります——この2つの概念は混同されがちですが、まったく異なる役割を持っています。コンテナ（MP4、MKV、WebM、AVIなど）はファイルの「入れ物」で、動画ストリーム、音声ストリーム、字幕、メタデータを格納するフォーマットを定義します。\n\nコーデック（H.264、H.265、VP9、AV1など）は実際のデータの圧縮・展開を行うアルゴリズムです。同じコンテナが異なるコーデックを使用できます——例えば、MP4コンテナにH.264またはH.265コーデックを使用できます。コンテナが「箱」だとすれば、コーデックは「箱の中身の詰め方」です。再生の互換性はコンテナとコーデックの両方に依存するため、両方を理解することが重要です。"},"s2":{"h":"MP4：動画のユニバーサルスタンダード","p":"MP4（MPEG-4 Part 14）は最も広くサポートされている動画フォーマットで、事実上すべてのデバイス、ブラウザ、プラットフォームと互換性があります。H.264（最も互換性が高い）やH.265/HEVC（より効率的だがサポートがやや限定的）など、複数のコーデックをサポートしています。\n\nMP4+H.264の組み合わせは動画配信のゴールドスタンダードです。YouTube、Netflix、ソーシャルメディアプラットフォームがすべてこの組み合わせをサポートしています。品質とファイルサイズのバランスに優れ、ストリーミングにも最適化されています。H.265はH.264と同等品質で約50%小さいファイルサイズを実現しますが、エンコードに時間がかかりハードウェアサポートが限定的です。一般的な用途ではMP4+H.264が最も安全な選択です。"},"s3":{"h":"WebM：オープンソースのウェブ動画フォーマット","p":"WebMはウェブ専用に開発されたオープンソースのロイヤリティフリー動画フォーマットです。VP8またはVP9コーデック（およびAV1）を使用し、音声にはVorbisまたはOpusを使用します。Googleがスポンサーとなり、Chrome、Firefox、Edge、Operaがネイティブサポートしています。\n\nWebPは同等品質でMP4+H.264より小さいファイルサイズを実現できることが多く、ウェブパフォーマンスの最適化に有利です。HTML5のvideo要素で直接使用でき、JavaScriptによる追加処理は不要です。ただし、古いデバイスやSafari（バージョンによってはサポートが限定的）との互換性に注意が必要です。ウェブサイト向けには、WebMを優先しMP4をフォールバックとして提供するのが理想的なアプローチです。"},"s4":{"h":"AVI、MOV、MKV：特殊用途のフォーマット","p":"AVI（Audio Video Interleave）はMicrosoftの古いフォーマットで、一部の環境ではまだ使用されています。幅広いコーデックをサポートしますが、モダンな圧縮効率に欠け、ファイルサイズが大きくなりがちです。ストリーミングには不向きで、新しいプロジェクトでの使用は推奨されません。\n\nMOVはAppleのQuickTimeフォーマットで、iPhoneやMacで録画されたデフォルトのフォーマットです。高品質ですがAppleエコシステム外でのサポートが限定的です。MKV（Matroska）は非常に柔軟なオープンソースコンテナで、複数の音声トラック、字幕、チャプターをサポートします。映画のアーカイブやメディアライブラリに人気がありますが、ブラウザやモバイルデバイスでのネイティブサポートが限られています。"},"s5":{"h":"圧縮、品質、適切な設定の選び方","p":"動画の圧縮はファイルサイズと品質のバランスを取ります。可逆圧縮はオリジナルの品質を保持しますがファイルが非常に大きくなり、非可逆圧縮はファイルサイズを大幅に削減しますが一定の品質劣化があります。ほとんどの配信目的には非可逆圧縮が適切です。\n\nビットレートはファイルサイズと品質を決定する最も重要な要素です。1080pの動画には8〜12 Mbps、720pには5〜8 Mbps、4Kには35〜68 Mbpsが一般的な推奨値です。CRF（Constant Rate Factor）モードはコンテンツの複雑さに基づいてビットレートを動的に調整し、一貫した品質を提供します。フレームレートは通常24fps（映画）、30fps（一般的な動画）、60fps（ゲームやスポーツ）です。"},"s6":{"h":"フォーマット間の変換：ツールとベストプラクティス","p":"動画フォーマットの変換は、デバイスやプラットフォーム間の互換性を確保するためにしばしば必要になります。重要なのは、変換は常に品質とのトレードオフであることを理解することです——非可逆フォーマット間の変換では、毎回品質が劣化します。\n\nベストプラクティスとして、常にオリジナルの最高品質ソースから目的のフォーマットに直接変換してください。中間フォーマットを経由した複数回の変換は避けてください。変換前にオリジナルファイルをバックアップしてください。Tuttiloの動画変換ツールはブラウザ内で動作するため、ファイルがサーバーにアップロードされることなくプライバシーが保護されます。変換後は必ず動画全体を確認し、音声と映像の同期、品質、再生の問題がないか確認してください。"},"title":"動画フォーマットの理解：MP4、WebM、AVIなど詳しく解説","excerpt":"動画コンテナとコーデックの違いを学びます。"}