{"p2":"Escribe tu mensaje en texto plano en el campo de entrada y crea una contraseña fuerte en el campo de contraseña. Haz clic en Cifrar para transformar tu texto usando AES-256-GCM, un estándar de cifrado de grado militar. La herramienta deriva una llave criptográfica de tu contraseña usando PBKDF2 con 100,000 iteraciones y un salt aleatorio. La salida cifrada incluye el salt, vector de inicialización, y texto cifrado combinados en un string codificado en Base64. Para descifrar, pega el string cifrado, ingresa la misma contraseña, y haz clic en Descifrar. Si la contraseña es incorrecta o los datos están corruptos, el descifrado falla con un error. Todas las operaciones criptográficas usan la Web Crypto API en tu navegador.","p3":"Los usuarios comparten información sensible seguramente como contraseñas o detalles de cuenta cifrando el texto, enviándolo a través de canales inseguros como correo electrónico, y compartiendo la contraseña de descifrado separadamente a través de un canal diferente como SMS. Los desarrolladores prueban implementaciones de cifrado cifrando datos de prueba y verificando que su aplicación pueda descifrarlo correctamente. Los individuos conscientes de seguridad cifran notas que contienen información confidencial antes de almacenarlas en aplicaciones de notas en la nube. Los departamentos de IT demuestran conceptos de cifrado durante entrenamiento de seguridad permitiendo a empleados cifrar y descifrar mensajes de muestra.","p4":"Elige una contraseña fuerte y única para cifrado; las contraseñas débiles pueden ser fuerza bruta independientemente de la fortaleza de AES. Nunca envíes los datos cifrados y contraseña a través del mismo canal; si un atacante intercepta ambos, el cifrado es inútil. Guarda todo el string de salida cifrada incluyendo metadata; perder cualquier parte significa que no puedes descifrar el mensaje. El modo GCM proporciona cifrado autenticado, así que si alguien manipula el texto cifrado, el descifrado fallará en lugar de producir salida basura. Esta herramienta es adecuada para cifrado manual ocasional, pero aplicaciones de producción deberían usar sistemas de gestión de llaves propios en lugar de llaves derivadas de contraseña."}