{"p2":"Selecciona uno de ocho efectos de animación preestablecidos: rebote, desvanecer, deslizar (desde arriba/derecha/abajo/izquierda), rotar, pulsar, sacudir, zoom, o voltear. Establece tu duración de animación en segundos, elige una función de tiempo (lineal, ease, ease-in, ease-out o ease-in-out) que controla aceleración y especifica conteo de iteración (una vez, dos veces o bucle infinito). La caja de vista previa demuestra tu animación continuamente así puedes ajustar tiempo y sensación antes de comprometerte. Copia tanto la clase CSS como la regla @keyframes juntas—pega ambas en tu hoja de estilos y aplica la clase a cualquier elemento.","p3":"Las páginas de aterrizaje de marketing usan animaciones de desvanecer en texto hero y botones de llamada a acción para atrapar atención conforme usuarios se desplazan hacia la vista. Las páginas de producto de e-commerce emplean efectos de zoom sutil en imágenes durante estados hover para invitar interacción sin ser impactante. Las pantallas de carga usan animaciones de pulso infinito o rotar para indicar procesamiento sin requerir datos de progreso reales. Los flujos de incorporación deslizan tarjetas de tutorial secuencialmente para guiar nuevos usuarios a través de características sin abrumarlos todos a la vez.","p4":"Emparejas funciones de tiempo a intención de animación: ease-out para elementos entrando en la vista (inicio rápido, final lento se siente natural), ease-in para elementos saliendo (aceler lejos) y ease-in-out para animaciones de bucle. Mantén duraciones cortas (0.3-0.6s) para retroalimentación UI, más largas (0.8-1.2s) para efectos decorativos—cualquier cosa sobre 2s se siente lenta. Las iteraciones infinitas funcionan para indicadores de carga pero agotan usuarios en elementos de contenido; usa raramente. Combina animation-delay con animation-fill-mode: forwards para crear secuencias escalonadas donde elementos animan uno tras otro. Prueba en dispositivos de bajo rendimiento ya que animaciones complejas de keyframe pueden causar tartamudeo en GPUs más lentas."}