{"p2":"Usa los controles de esquina alternativos para trabajar con las cuatro esquinas vinculadas juntas para redondeo uniforme, o desvincula para establecer cada esquina independientemente. Arrastra el deslizador o escribe valores directamente, luego elige tu unidad preferida: píxeles para tamaño fijo, porcentajes para escala responsiva o rems para tamaño amigable con accesibilidad que respeta preferencias de fuente de usuario. La caja de vista previa se actualiza en tiempo real mostrando exactamente cómo tu elemento aparecerá. Copia el CSS generado con un solo clic—incluye la propiedad border-radius completa con valores de esquina individual cuando difieren.","p3":"Los diseñadores de botón redondean esquinas para crear elementos de interfaz amigables y accesibles que se sienten más táctiles que bordes rectangulares ásperos. Los diseños de tarjeta usan radio sutil (4-8px) en contenedores para estética moderna y pulida que distingue secciones sin bordes pesados. Las imágenes de perfil y componentes de avatar usan border-radius 50% para transformar imágenes cuadradas en círculos perfectos. Los sistemas de diseño implementan escalas de radio consistentes (2px, 4px, 8px, 16px) a través de componentes para mantener armonía visual, y esta herramienta ayuda visualizar cada paso de esa escala.","p4":"Establecer border-radius a 50% crea un círculo perfecto solo cuando el elemento tiene ancho y alto iguales—usa esto para imágenes de avatar. Para botones en forma de píldora, usa radio igual a la mitad de la altura del botón (si la altura es 40px, usa radio 20px). Al aplicar radios diferentes a esquinas individuales, mantén balance visual manteniendo esquinas opuestas similares. El radio basado en porcentaje escala con tamaño de elemento, haciéndolo ideal para componentes responsivos que se redimensionan en diferentes puntos de quiebre. Combinar border-radius con overflow: hidden corta limpiamente contenido hijo, esencial al redondear contenedores con imágenes de fondo o elementos anidados."}