{"p2":"Añade tu primera capa de sombra con el botón más, luego ajusta desplazamiento horizontal (X), desplazamiento vertical (Y), radio de difuminación y propagación usando deslizadores o entrada directa. Elige tu color de sombra y establece su opacidad usando el deslizador alfa. Alterna entre sombras exteriores (predeterminado) y sombras insertadas para efectos de brillo interior. Añade múltiples capas de sombra para crear efectos de profundidad complejos—cada capa se apila en las anteriores. La vista previa se actualiza al instante conforme ajustas cualquier parámetro, y la salida CSS refleja tu declaración de sombra completa lista para copiar en tus hojas de estilos.","p3":"Los diseñadores de UI basados en tarjetas añaden sombras sutiles a tarjetas de contenido para elevarlas sobre fondos de página, creando jerarquía que guía usuarios a través de arquitectura de información. Los sitios de e-commerce usan sombras pronunciadas en imágenes de producto y botones 'Añadir al Carrito' para hacerlos parecer táctiles y clicables. Los constructores de panel de control capan múltiples sombras con diferentes radios de difuminación para lograr niveles de profundidad realistas de diseño material—una sombra aguda para definición más una sombra más suave para iluminación ambiental. Las agencias creativas diseñan efectos de hover dramáticos animando propiedades de sombra, haciendo elementos de interfaz parecer elevarse de la página cuando los usuarios interactúan.","p4":"Capas de sombras de más grande/más suave (fondo) a más pequeña/más aguda (arriba) para imitar iluminación natural donde la luz ambiental crea sombras suaves y la luz directa crea bordes definidos. Mantén valores de propagación mínimos (0-4px)—propagación excesiva hace sombras parecer artificiales y tipo caricatura. Para profundidad realista, posiciona la sombra principal ligeramente abajo y a la derecha (X e Y positivos) simulando luz desde arriba-izquierda, una convención que los usuarios esperan. Las sombras insertadas funcionan hermosamente para campos de entrada para crear apariencias empotradas. Usa negro semi-transparente (rgba(0,0,0,0.1-0.3)) para la mayoría de sombras en lugar de negro puro, que se ve áspero."}