{"p2":"Ingresa tu edad, sexo biológico, peso actual y altura usando tu sistema de unidad preferido. Selecciona tu nivel de actividad de sedentario a muy activo basado en cuánto ejercicio haces semanalmente. Tuttilo usa la ecuación Mifflin-St Jeor científicamente validada para calcular tu Tasa Metabólica Basal (BMR)—las calorías que quemas en reposo—luego multiplica por tu factor de actividad para determinar tu Gasto de Energía Diaria Total (TDEE). Los resultados muestran tus calorías de mantenimiento, más objetivos para pérdida o ganancia de peso. Tus datos de salud permanecen completamente privados en tu navegador.","p3":"Los entusiastas del fitness que comienzan nuevos planes dietéticos usan cálculos TDEE como base para crear déficits o superávits calóricos. Los entrenadores personales establecen objetivos de calorías de línea de base para clientes antes de diseñar programas de nutrición. Las personas que se recuperan de trastornos alimentarios trabajan con terapeutas para entender rangos de calorías saludables para su cuerpo y nivel de actividad. Los atletas en deportes de peso específico calculan sus calorías de mantenimiento para planificar cortes o aumentos antes de competiciones. Los individuos que experimentan cambios de peso inexplicables verifican si su ingesta de calorías se alinea con su gasto.","p4":"La BMR disminuye conforme pierdes peso, así que recalcula cada 10-15 libras para evitar mesetas de comer demasiadas calorías para tu nuevo tamaño corporal. Los multiplicadores de actividad son estimaciones aproximadas—rastrea tus cambios de peso reales durante 2-3 semanas y ajusta calorías por 200-300 si los resultados no coinciden con expectativas. El músculo quema más calorías en reposo que la grasa, así que el entrenamiento de fuerza aumenta tu BMR con el tiempo incluso sin cardio. No bajes por debajo de tu BMR por períodos extendidos, ya que déficits severos disparan adaptación metabólica donde tu cuerpo agresivamente conserva energía, haciendo la pérdida de grasa adicional extremadamente difícil."}