{"p2":"Haz clic en cualquier lugar del gradiente del selector de color para elegir matiz y saturación, luego ajusta el deslizador de brillo en la derecha. El color seleccionado se muestra en la parte superior con valores de color en vivo en múltiples formatos. Copia el código HEX para CSS y HTML, los valores RGB para manipulación de color programática, la representación HSL para ajustar luminosidad, o rgba/hsla con transparencia alfa. También puedes pegar cualquier código HEX en el campo de entrada para ir directamente a ese color. Los valores CMYK ayudan cuando preparas diseños para impresión. Todas las conversiones se calculan al instante en tu navegador.","p3":"Los diseñadores UI/UX seleccionan colores de marca y generan valores exactos para sistemas de diseño y guías de estilo. Los desarrolladores frontend eligen colores para CSS mientras construyen componentes, copiando el formato necesario para su contexto específico. Los diseñadores gráficos convierten colores de pantalla a CMYK antes de enviar diseños a vendedores de impresión que requieren espacios de color optimizados para impresión. Los equipos de marketing aseguran consistencia de color de marca entre activos digitales referenciando códigos HEX canónicos en lugar de estimar colores.","p4":"Cuando diseñes para accesibilidad, verifica que tus combinaciones de color cumplan con ratios de contraste WCAG usando un verificador de contraste separado después de elegir colores aquí. El formato HSL es particularmente útil para generar variaciones de color programáticamente ya que puedes ajustar luminosidad y saturación mientras mantienes la matiz base constante. Recuerda que los colores aparecen diferente en pantallas versus impresión, así que los valores CMYK son aproximaciones; solicita pruebas de color de tu vendedor de impresión para materiales de marca críticos. Guarda la paleta de color de tu proyecto en un archivo de texto o herramienta de diseño ya que las herramientas de navegador no persisten selecciones."}