{"p2":"Sube una imagen o selecciona colores de tu paleta de diseño, luego elige qué tipo de deficiencia de visión de color simular: protanopia (ceguera roja), deuteranopia (ceguera verde), tritanopia (ceguera azul), protanomalía (sensibilidad roja reducida), deuteranomalía (sensibilidad verde reducida) o tritanomalía (sensibilidad azul reducida). La herramienta aplica transformaciones matemáticas que modelan con precisión cómo estas condiciones afectan la percepción del color. Compara la vista simulada lado a lado con la original para identificar combinaciones de color problemáticas que serían indistinguibles para usuarios afectados. Todo procesamiento ocurre localmente en tu navegador para privacidad.","p3":"Los diseñadores de UI prueban si elementos de interfaz críticos como estados de error (tradicionalmente rojo) y mensajes de éxito (típicamente verde) permanecen distinguibles a usuarios daltónicos antes de finalizar diseños. Los especialistas en visualización de datos verifican que colores de gráfico, líneas de gráfico y mapas de calor comuniquen información a través de patrones o etiquetas además de codificación de color. Los creadores de infografía aseguran que iconos, callouts y distinciones de categoría no dependan únicamente de diferencias de color que desaparecen bajo deficiencia de visión de color. Los desarrolladores de juegos prueban si mecánicas de juego dependientes de reconocimiento de color (como emparejamiento de cables o identificación de enemigos) permanecen jugables para jugadores daltónicos.","p4":"La deuteranomalía (sensibilidad verde reducida) afecta aproximadamente 6% de hombres y es la forma más común—siempre prueba contra esta variante como mínimo. Evita combinaciones rojo-verde enteramente ya que protanopia y deuteranopia ambas confunden estos matices; usa emparejamientos azul-naranja en su lugar para mejor accesibilidad. No dependas únicamente de color para transmitir información—suplementa con patrones, formas, iconos o etiquetas de texto. Las herramientas como este simulador no son perfectas ya que aproximan en lugar de replicar la experiencia real, pero atrapan la mayoría de problemas principales. Combina prueba de simulación con verificación de relación de contraste para validación de accesibilidad comprensiva."}