{"p2":"Ingresa tu monto principal inicial, tasa de interés anual esperada y marco de tiempo de inversión en años. Elige con qué frecuencia se capitaliza el interés (diariamente, mensualmente, trimestralmente o anualmente), ya que la capitalización más frecuente produce mayores rendimientos. Opcionalmente añade contribuciones mensuales regulares para ver cómo la inversión consistente acelera el crecimiento. Tuttilo genera un desglose año por año mostrando el crecimiento de tu saldo, separando el principal aportado del interés ganado. Un gráfico visual ilustra la curva exponencial del crecimiento compuesto. Todos los cálculos se realizan localmente en tu navegador para total privacidad de tu planificación financiera.","p3":"Los estudiantes universitarios modelan diferentes estrategias de ahorro para entender cómo comenzar temprano con pequeñas contribuciones mensuales supera contribuciones más grandes comenzadas después. Los planificadores de jubilación proyectan el crecimiento de su fondo de retiro ingresando saldos 401(k) actuales con tasas de contribución esperadas. Los padres que ahorran para la educación de los hijos calculan cuánto necesitan ahorrar mensualmente para alcanzar una meta específica en 18 años. Los asesores financieros demuestran a los clientes la diferencia dramática entre rendimientos anuales de 6% y 8% durante períodos de 30 años.","p4":"La Regla del 72 ofrece una verificación mental rápida: divide 72 por tu tasa de interés para encontrar cuántos años tarda tu dinero en duplicarse. Las cuentas con ventajas fiscales como las IRA Roth maximizan el crecimiento compuesto ya que nunca pagas impuestos sobre las ganancias. Comenzar 10 años antes con interés compuesto a menudo produce mejores resultados que duplicar tu monto de contribución después. No subestimes cómo las adiciones mensuales regulares amplifican el crecimiento compuesto—una contribución mensual de $200 puede añadir más a tu saldo final que el principal original en horizontes de tiempo largos."}