{"p2":"Selecciona tu color de primer plano (texto) y color de fondo usando los selectores de color o ingresando códigos hex directamente. La herramienta calcula inmediatamente la relación de contraste WCAG y muestra resultados de aprobación/reprobación para cuatro criterios diferentes: texto normal Nivel AA (4.5:1), texto grande Nivel AA (3:1), texto normal Nivel AAA (7:1) y texto grande Nivel AAA (4.5:1). Texto grande significa 18pt y arriba, o 14pt y arriba cuando es negrita. Todos los cálculos usan la fórmula oficial WCAG 2.1 y se ejecutan completamente en tu navegador para retroalimentación instantánea.","p3":"Los desarrolladores web aseguran que su texto del sitio cumple requisitos de accesibilidad legal antes de lanzar, evitando demandas potenciales bajo ADA o regulaciones Sección 508. Los diseñadores UI verifican que botones de llamada a acción tengan contraste suficiente contra fondos de página así usuarios con visión baja pueden identificar fácilmente elementos interactivos. Los desarrolladores de aplicaciones móviles prueban si sus esquemas de color de modo claro y modo oscuro ambos pasan estándares AA para usuarios en diferentes condiciones de iluminación. Las agencias gubernamentales que construyen sitios web orientados al público deben cumplir estándares AAA en muchas jurisdicciones, requiriendo selección de color cuidadosa validada a través de verificación de contraste.","p4":"Siempre apunta a cumplimiento Nivel AA como mínimo—muchos países lo requieren legalmente para sitios web gubernamentales y comerciales. Nivel AAA proporciona mejor accesibilidad pero puede ser desafiante con colores de marca; priorízalo para texto corporal mientras AA puede ser suficiente para elementos decorativos. Recuerda que requisitos de contraste difieren para texto grande (18pt+ regular o 14pt+ negrita) versus texto normal. Las relaciones de contraste se aplican a todos escenarios de texto-sobre-fondo incluyendo texto sobre imágenes, así que prueba cuidadosamente combinaciones de superposición. Al usar texto claro sobre fondos de color, blanco puro a menudo funciona mejor que blanco apagado ya que cada paso lejos de blanco reduce contraste."}