{"p2":"Selecciona tu tipo de patrón de seis opciones: rayas (vertical u horizontal), puntos, cuadrícula, tablero de ajedrez, zigzag o diagonal. Ajusta el tamaño de patrón usando el deslizador para controlar espaciado entre elementos repetitivos, luego elige tus dos colores de patrón (primer plano y fondo). La vista previa se actualiza en tiempo real mostrando cómo tu patrón se mosaica a través de una superficie. Ajusta la densidad de patrón y contraste de color hasta lograr tu efecto visual deseado. Copia la propiedad de fondo CSS generada con un solo clic—usa funciones linear-gradient o radial-gradient que crean patrones CSS puros sin archivos de imagen, manteniendo tu sitio rápido y escalable.","p3":"Las páginas de aterrizaje usan patrones sutiles de puntos o cuadrícula en fondos de sección hero para añadir textura sin abrumar contenido primario. Las interfaces de panel de control emplean patrones de checkerboard o rayas claros en filas de tabla de datos para legibilidad mejorada al separar visualmente filas. Los sitios de portafolio crean fondos de raya diagonal para divisores de sección que añaden energía y guían el ojo abajo de la página. Las tarjetas de producto de e-commerce usan fondos de patrón discreto para diferenciar categorías o artículos de venta mientras mantienen un lenguaje de diseño cohesivo.","p4":"Mantén patrones de fondo sutiles usando pares de color de bajo contraste (diferencia de claridad 10-15%) para evitar competir con contenido de primer plano. Los tamaños de patrón más pequeños (8-16px) se sienten más refinados mientras tamaños más grandes (32px+) aparecen audaces y gráficos—emparejar a tu personalidad de marca. Los patrones creados con gradientes CSS funcionan mejor que imágenes de fondo ya que no hay solicitud HTTP o archivo a descargar. Combina patrones con background-blend-mode para efectos de superposición sofisticados en imágenes. Prueba patrones en diferentes tamaños de pantalla ya que elementos repetitivos pequeños pueden crear patrones de muaré o vibración en pantallas de alta DPI."}