{"p2":"Configura propiedades de contenedor usando los controles visuales: flex-direction cambia entre diseños de fila y columna, flex-wrap determina si artículos se quedan en una línea o envuelven a líneas múltiples, justify-content alinea artículos a lo largo del eje principal, align-items los posiciona en el eje transversal y gap establece espaciado entre hijos flex. Añade o quita artículos de vista previa para ver cómo tu diseño se adapta a diferentes cantidades de contenido. La vista previa viva se actualiza al instante conforme ajustas cada propiedad, y el CSS generado muestra reglas de contenedor e artículo listas para copiar en tu proyecto.","p3":"Las barras de navegación usan flexbox con justificación space-between para empujar logo izquierda e ítems de menú derecha sin cálculos de posicionamiento manual. Las cuadrículas de tarjeta emplean flex-wrap con espaciado de gap para crear galerías responsivas que automáticamente refluyen a diferentes anchos de pantalla sin consultas de media. Los diseños de forma utilizan flex-direction: columna para móvil e intercambian a fila para escritorio para apilar etiquetas sobre entradas en pantallas pequeñas. Los widgets de panel de control alinean iconos y texto usando align-items: center para centrado vertical de contenido independientemente de alturas de texto variables o tamaños de icono.","p4":"Comienza con justify-content para alineación del eje principal (horizontal en fila, vertical en columna) y align-items para eje transversal—este modelo mental previene confusión. Usa gap en lugar de márgenes en hijos flex para espaciado ya que no añadirá espacio extra en bordes de contenedor. flex-wrap: wrap habilita comportamiento responsivo sin consultas de media cuando se combina con flex-basis o min-width en hijos. Recuerda que align-content solo afecta contenedores flex multi-línea, no líneas únicas. Para columnas de ancho igual, establece flex: 1 en hijos; para tamaño basado en contenido, usa flex: 0 1 auto para prevenir encogimiento."}