{"p2":"Explora emparejamientos de fuente seleccionados organizados por categorías de estilo como elegante, moderno, clásico, audaz y mínimo. Cada sugerencia muestra un encabezado en la fuente primaria emparejada con texto corporal en la fuente complementaria, permitiéndote ver exactamente cómo la combinación se ve junto. Haz clic en cualquier emparejamiento para ver enlaces de Google Fonts para ambos tipos de letra, listos para añadir a tu proyecto via etiqueta de enlace estándar o importación CSS. Ajusta el texto de vista previa para ver cómo tu contenido real aparecería en cada emparejamiento. Filtra por humor de estilo para emparejamientos que coincidan con los objetivos estéticos de tu proyecto, con todas las recomendaciones basadas en principios tipográficos probados.","p3":"Los diseñadores web que establecen jerarquía visual emparejan una fuente de encabezado distintiva con fuente corporal legible para crear interés sin sacrificar legibilidad. Los proyectos de identidad de marca emparejan encabezados serif con texto corporal sans-serif (o viceversa) para equilibrar estética tradicional y moderna. Los sitios de portafolio usan fuentes de exhibición audaces para títulos de proyecto emparejadas con fuentes neutras corporal que mantienen foco en muestras de trabajo. Los materiales de marketing combinan encabezados script o decorativos con sans-serifs limpios para cuerpo para añadir personalidad mientras mantienen legibilidad profesional.","p4":"El contraste es clave: empareja serif con sans-serif, condensada con ancha, pesada con ligera—fuentes similares compiten en lugar de complementarse. Limita proyectos a 2-3 tipos de letra máximo; más crea caos visual e hiere desempeño con descargas adicionales de archivo de fuente. Al emparejar, asegura alturas x (la altura de letras minúsculas) similares para que texto corporal y encabezados se sientan cohesivos a diferentes tamaños. Google Fonts sugiere emparejamientos populares basados en datos de uso reales de millones de sitios web, haciendo estas combinaciones probadas en batalla. Siempre carga font-display: swap para prevenir texto invisible durante carga, especialmente en conexiones más lentas."}