{"p2":"Elige tu unidad de economía de combustible inicial: litros por 100 kilómetros, kilómetros por litro, millas por galón (US) o millas por galón (Imperial). Ingresa tu figura de economía de combustible del vehículo. Selecciona la unidad a la que deseas convertir. Tuttilo calcula la conversión al instante, contabilizando la relación inversa entre distancia por combustible y métricas de combustible por distancia. Nota que los galones US e Imperial difieren, afectando valores de MPG. La herramienta procesa todo en tu navegador, manteniendo privados tus datos del vehículo.","p3":"Los viajeros que alquilan autos en el extranjero convierten especificaciones de economía de combustible a sus unidades familiares para comparación al comprar. Los compradores de autos evalúan vehículos con clasificaciones de eficiencia en diferentes sistemas para encontrar la opción más económica. Los gerentes de flota rastrean eficiencia del vehículo a través de operaciones internacionales donde diferentes regiones reportan usando diferentes estándares. Los defensores ambientales calculan y comparan huellas de carbono cuando los datos de eficiencia usan varios sistemas de medida. Los periodistas automotrices convierten especificaciones del fabricante a las unidades preferidas de su audiencia para reseñas.","p4":"Valores L/100km más bajos indican mejor eficiencia (métrica inversa) mientras valores MPG más altos indican mejor eficiencia (métrica directa), que puede causar confusión al comparar. El MPG US es aproximadamente 17% más bajo que el MPG Imperial para el mismo vehículo porque los galones US son más pequeños. La economía de combustible del mundo real típicamente se ejecuta 15-25% peor que clasificaciones oficiales debido a limitaciones de metodología de prueba—contabiliza esto al presupuestar costos de combustible. Los vehículos híbridos a menudo muestran dramáticamente mejor MPG en ciudad que carretera (opuesto de vehículos tradicionales) debido a beneficios de frenado regenerativo en tráfico de parar y arrancar."}