{"p2":"Ajusta el deslizador de difuminación para controlar cuánto contenido de fondo se muestra a través de tu elemento de vidrio—valores más altos crean efectos de escarcha más fuertes. Establece opacidad de fondo para determinar translucidez, saturación de color para añadir tinte (haciendo tu vidrio más cálido o más frío) y transparencia de borde para el destaque de borde sutil característico. La vista previa muestra tu tarjeta de vidrio contra un fondo de gradiente personalizable así puedes ver exactamente cómo interactúa con contenido detrás. Copia el CSS completo incluyendo backdrop-filter, background y propiedades de borde listos para uso de producción. Todo renderizado ocurre en tu navegador.","p3":"Las interfaces de panel de control usan paneles glassmórficos para capas de información sobre fondos dinámicos como video o gradientes animados mientras mantienen legibilidad. Los diseñadores de aplicaciones móviles crean barras de navegación y modales escarchadas que permiten que el contenido subyacente se asoma a través, manteniendo contexto mientras enfocas atención en elementos de primer plano. Las páginas de aterrizaje emplean tarjetas de vidrio para tablas de precios o destacados de características, añadiendo profundidad sofisticada que se siente premium y moderno. Las interfaces de reproductor de música usan glassmorfismo para controles de reproducción que se superponen sobre arte de álbum, creando cohesión visual entre UI y contenido.","p4":"El desenfoque backdrop-filter funciona mejor entre 10-20px—valores más bajos apenas escarcha mientras valores más altos hacen vidrio opaco. Siempre incluye un fondo semi-transparente alternativo para navegadores sin soporte de backdrop-filter, particularmente versiones Firefox antiguas. El glassmorfismo se ve más impresionante contra fondos vibrantemente multicolores; fondos sutiles reducen impacto visual. Añade un borde delgado brillante (1px solid rgba(255,255,255,0.18)) para definir bordes contra fondos ocupados. Consejo de desempeño: backdrop-filter es intensivo en GPU, así que limita uso a secciones hero o elementos UI clave en lugar de aplicar a lo largo de diseños enteros."}