{"p2":"Añade cada tarea, prueba o asignatura ingresando su calificación y peso (cuánto cuenta hacia tu calificación final). Por ejemplo, ingresa \"85\" para una calificación y \"30\" si esa tarea vale 30% de tu calificación total. Tuttilo calcula al instante tu promedio ponderado, mostrando tu calificación de porcentaje, calificación letra y GPA en escala 4.0. Puedes añadir elementos ilimitados y ajustar pesos y calificaciones para ver cómo diferentes escenarios afectan tu calificación final. Todos los cálculos ocurren localmente en tu navegador para mantener privados tus datos de desempeño académico.","p3":"Los estudiantes universitarios rastrean sus calificaciones de curso durante el semestre ingresando calificaciones conforme las reciben y proyectando calificaciones finales. Los estudiantes de escuela secundaria calculan qué calificación necesitan en una prueba final para lograr una calificación de curso deseada. Los maestros configuran rúbricas de calificación experimentando con diferentes distribuciones de peso para entender cómo afectan las calificaciones generales. Los padres ayudan a los niños a entender cómo las calificaciones de tareas individuales contribuyen a calificaciones de boleta de calificaciones. Los estudiantes de posgrado rastrean GPA acumulativo a través de múltiples cursos y semestres.","p4":"Concentra tu esfuerzo en tareas y exámenes de alto peso, ya que un 95% en un artículo que vale 40% de tu calificación impacta tu calificación final mucho más que calificaciones perfectas en artículos que valen 5% cada uno. Siempre aclara la escala de calificación de tu instructor—algunos usan escala de 10 puntos (90-100 = A) mientras otros usan escala de 7 puntos (93-100 = A). Si estás cerca de un límite de calificación, a veces pedir pequeñas oportunidades de crédito extra o reenvío de tareas puede empujarte sobre el umbral. Rastrea tu calificación semanalmente en lugar de esperar hasta el final del término, dándote tiempo de ajustar tu asignación de esfuerzo o buscar ayuda antes de que sea demasiado tarde."}