{"p2":"Elige tu color base usando el selector de color o ingresa un valor hex, luego selecciona una de seis reglas de armonía de color: complementaria para alto contraste, análoga para transiciones suave, tríada para vibracía balanceada, complementaria dividida para contraste sofisticado, tetrada para esquemas complejos o monocromática para variaciones elegantes de tono único. El generador muestra al instante tu paleta con todos los valores de color mostrados en formatos hex, RGB y HSL. Haz clic en cualquier color para copiar su valor, o usa la función de bloqueo para preservar colores mientras regeneras el resto. El procesamiento ocurre completamente en tu navegador usando matemáticas de teoría del color.","p3":"Los diseñadores de marca que establecen sistemas de identidad visual usan esquemas tríada o tetrada para crear paletas comprensivas con colores primarios, secundarios y de acento para logos, materiales de marketing y propiedades digitales. Los diseñadores de interiores confían en paletas análogas al seleccionar pintura, telas y decor que armonizan naturalmente dentro de una habitación. Los desarrolladores web que construyen interfaces de modo oscuro usan esquemas monocromáticos de un color base para generar matices consistentes para fondos, paneles y elementos UI. Los creadores de presentaciones emplean esquemas complementarios para hacer puntos de datos clave destacar contra fondos de diapositiva sin chocar.","p4":"Los colores complementarios (opuestos en la rueda de color) proporcionan máximo contraste pero pueden vibrar desagradablemente cuando se colocan lado a lado a saturación completa—reduce intensidad para mejor balance. Los esquemas análogos funcionan mejor cuando designas un color como dominante y usas los otros como acentos en proporciones 60-30-10. Las paletas tríada se sienten más balanceadas cuando un color domina mientras los otros dos sirven roles de apoyo. Antes de finalizar cualquier paleta, pruébala con el verificador de contraste para asegurar que la legibilidad de texto cumple estándares WCAG. Exporta paletas exitosas como variables CSS o tokens de diseño para mantener consistencia a través de tu proyecto entero."}