{"p2":"Escribe una contraseña en el campo de entrada y la herramienta la analiza en tiempo real, mostrando una puntuación de fortaleza de débil a muy fuerte. El cálculo de entropía mide la aleatoriedad teórica basada en tamaño de conjunto de caracteres y longitud. La detección de patrones identifica debilidades comunes como caracteres secuenciales (123, abc), caracteres repetidos (aaa), patrones de teclado (qwerty), y palabras de diccionario comunes. La herramienta verifica contra una lista de contraseñas frecuentemente usadas y proporciona retroalimentación específica sobre cómo mejorar fortaleza. Todo el análisis se ejecuta localmente en tu navegador usando coincidencia de patrones JavaScript y fórmulas de entropía.","p3":"Los usuarios que eligen nuevas contraseñas obtienen retroalimentación inmediata sobre si su candidato cumple con las mejores prácticas de seguridad antes de crear una cuenta. Los entrenadores de conciencia de seguridad demuestran a empleados por qué contraseñas simples como 'password123' son peligrosas mostrando la retroalimentación de falla inmediata. Los desarrolladores que construyen formularios de registro prueban reglas de validación de contraseña contra varios inputs para asegurar que rechacen contraseñas débiles. Los departamentos de IT establecen políticas de contraseña basadas en umbrales de entropía que esta herramienta ayuda a visualizar y explicar a usuarios.","p4":"No dependas únicamente de entropía; una contraseña aleatoria de 8 caracteres tiene decente entropía pero sigue siendo vulnerable a ataque de fuerza bruta. Verifica palabras de diccionario incluso en contraseñas fuertes ya que atacantes usan listas de palabras como primer paso de ataque. Los patrones de teclado como 'asdfgh' tienen alta diversidad de caracteres pero baja aleatoriedad actual. Las estrategias de frase de contraseña usando cuatro o más palabras aleatorias crean contraseñas más fuertes que complejas pero cortas como 'P@ssw0rd!'. Recuerda que esta herramienta evalúa fortaleza basada en resistencia a adivinanza, pero aún deberías usar contraseñas únicas por servicio y habilitar autenticación de dos factores."}