{"p2":"Ingresa tu valor de potencia en cualquier unidad incluyendo Vatios, kilovatio, megavatio, caballo de potencia (mecánico), PS (caballo de potencia métrica), BTU por hora o pie-libra por segundo. La herramienta muestra conversiones instantáneas a través de todas las unidades, permitiéndote comparar potencia eléctrica en vatios contra potencia mecánica en caballos de potencia o potencia térmica en BTU/h. Esto hace simple traducir especificaciones de diferentes industrias o regiones que prefieren diferentes unidades. Todos los cálculos se ejecutan localmente en tu navegador para conversiones rápidas y privadas sin cargas en servidor.","p3":"Los ingenieros automotrices convierten clasificaciones de potencia del motor entre caballos de potencia y kilovatio cuando comparan especificaciones de vehículos americanos y europeos o cumplen con requisitos de etiquetado regulatorio. Los contratistas HVAC traducen capacidad de enfriamiento de aire acondicionado de BTU/h a kilovatio cuando calculan carga eléctrica para sistemas de potencia de edificio. Los compradores de equipo industrial comparan especificaciones de motor listadas en diferentes unidades—convirtiendo PS a HP o kW dependiendo del origen del fabricante. Los instaladores solares calculan si el consumo pico de la casa en kilovatio puede ser satisfecho por espacio de techo disponible para instalación de panel.","p4":"Nota que caballo de potencia mecánico (745.7W) difiere ligeramente de caballo de potencia métrico o PS (735.5W)—siempre especifica qué tipo estás usando en documentación técnica. BTU por hora mide potencia térmica, pero un BTU/h iguala solo aproximadamente 0.293 vatios, haciéndolo mucho más pequeño de lo que podrías esperar. Al dimensionar generadores o circuitos eléctricos, recuerda contabilizar factor de potencia—potencia aparente en VA difiere de potencia real en vatios. Para cargas continuas como motores o calentadores, disyuntores deberían estar clasificados para al menos 125% de la carga de potencia para prevenir disparo de molestia."}