{"p2":"Escribe tu texto, URL, o cualquier string de datos en el campo de entrada. El código QR se genera inmediatamente en el área de vista previa mientras escribes. Ajusta el deslizador de tamaño para cambiar las dimensiones de salida de pequeño a grande. Utiliza el menú desplegable de corrección de errores para establecer el nivel de recuperación—los niveles más altos permiten que el código QR siga siendo correcto incluso si está parcialmente dañado o sucio. Personaliza colores de primer plano y fondo usando los selectores de color, aunque el alto contraste entre ellos asegura mejor confiabilidad de escaneo. Haz clic en descargar para guardar el código QR como imagen PNG. Toda la generación ocurre en tu navegador usando la biblioteca qrcode.js.","p3":"Los propietarios de restaurantes generan códigos QR que enlazan a menús digitales, imprimiéndolos en tarjetas de mesa para que los clientes naveguen sin menús físicos. Los organizadores de eventos crean códigos QR que contienen direcciones de lugares o URLs de registro para pósters y confirmaciones de correo electrónico. Los negocios minoristas incrustan códigos QR en empaques de productos que enlazan a instrucciones de configuración u ofertas promocionales. Los maestros generan códigos QR para enlaces de envío de tareas o recursos de clase, imprimiéndolos en hojas de trabajo para que los estudiantes accedan rápidamente a materiales en sus dispositivos.","p4":"Utiliza corrección de errores alta (30 por ciento) si el código QR se imprimirá en superficies texturizadas o se mostrará al aire libre donde podría acumular suciedad o daño. Prueba escanear tu código QR generado con múltiples teléfonos y aplicaciones antes de impresión masiva para asegurar compatibilidad entre dispositivos. Para URLs, usa primero un acortador de enlaces para crear códigos QR más pequeños que son más fáciles de escanear; menos puntos de datos significan píxeles más grandes y mejor escaneo a distancia. Mantente con primer plano negro y fondo blanco a menos que la marca absolutamente requiera colores—algunas aplicaciones de escaneo luchan con combinaciones de bajo contraste o colores poco convencionales."}