{"p2":"Selecciona tu sistema de tamaño de zapato inicial: Hombres US, Mujeres US, UK, Europeo (EU) o centímetros (longitud de pie actual). Ingresa tu tamaño de zapato. Elige el sistema de tamaño al que deseas convertir. Tuttilo muestra el tamaño equivalente al instante, usando gráficos de conversión estándar empleados por fabricantes de calzado. Recuerda que estas conversiones son aproximaciones—las marcas varían ligeramente en su tamaño. La herramienta procesa todo localmente en tu navegador para mantener privadas tus medidas personales.","p3":"Los compradores en línea que compran zapatos de minoristas internacionales convierten tamaños para asegurar ajuste apropiado antes de pedir. Los viajeros que compran zapatos en el extranjero determinan rápidamente su tamaño en sistemas de tamaño desconocidos. Los compradores de regalos que miden pies de destinatarios en centímetros para pedir zapatos cuando no saben el tamaño declarado de la persona. Los minoristas que abastecen marcas internacionales convierten entre sistemas para etiquetado de estantes y gestión de inventario. Los atletas que piden zapatos deportivos especiales de fabricantes en diferentes países verifican compatibilidad de tamaño.","p4":"Los tamaños de Mujeres US típicamente son 1.5 tamaños más grandes que los tamaños de Hombres US para la misma longitud de pie—así que un tamaño Mujeres 8 iguala un tamaño Hombres 6.5. Los tamaños UK se ejecutan aproximadamente un tamaño más pequeño que tamaños US debido a diferentes puntos de partida en sus escalas de tamaño. Los tamaños Europeos se basan en el punto París (2/3 cm), haciéndolos más precisos pero menos intuitivos. Siempre mide ambos pies y usa la medida más grande, ya que la mayoría de las personas tienen pies de tamaño ligeramente diferente. Los conversores de tamaño de zapato muestran el equivalente más cercano, pero el ancho (angosto, medio, ancho) no se estandariza entre sistemas—pide de minoristas con políticas de devolución flexibles al comprar marcas internacionales."}