{"p2":"Selecciona tu unidad de velocidad inicial, como kilómetros por hora, millas por hora, metros por segundo, nudos o Mach. Ingresa tu valor de velocidad. Elige la unidad a la que deseas convertir. Tuttilo convierte al instante tu velocidad usando factores de conversión estándar, contabilizando diferencias entre unidades de velocidad y ritmo. La herramienta soporta todo desde velocidades de caminata hasta velocidades supersónicas. Todos los cálculos se ejecutan en tu navegador localmente, protegiendo privacidad de tus datos.","p3":"Los pilotos convierten velocidades del aire indicadas entre nudos y millas por hora para planificación de vuelo y comunicación con controladores. Los corredores interpretan velocidades de cinta de correr mostradas en millas por hora en su ritmo preferido de minutos por kilómetro. Los científicos que analizan movimiento en experimentos de física convierten entre metros por segundo y otras unidades para reportes estandarizados. Los viajeros que conducen internacionalmente convierten lecturas de velocímetro cuando autos rentados muestran unidades diferentes de señales de carretera. Los navegantes marítimos calculan velocidades de buques en nudos mientras coordinan con equipos en tierra usando mph o km/h.","p4":"Los nudos (millas náuticas por hora) permanecen estándar en aplicaciones de aviación y marítimas porque las millas náuticas se relacionan directamente con la geometría de la Tierra (1 milla náutica ≈ 1 minuto de latitud). El número de Mach representa velocidad relativa a la velocidad del sonido, que varía con la temperatura y presión del aire—Mach 1 al nivel del mar es aproximadamente 767 mph, pero más lento en altitudes más altas. Para conversiones de ritmo de carrera, recuerda que velocidades más altas significan números de ritmo más pequeños, que puede ser contraproducente. Al convertir velocidades de auto, nota que 100 km/h iguala aproximadamente 62 mph, una referencia útil para aproximaciones mentales rápidas en carreteras internacionales."}