{"p2":"La herramienta muestra un reloj en vivo mostrando el timestamp Unix actual en segundos y milisegundos, actualizándose cada segundo. Ingresa cualquier timestamp Unix en el campo convertidor para ver la fecha y hora correspondientes en formato legible en tu zona horaria local. Alternativamente, selecciona una fecha y hora usando el selector de datetime para obtener instantáneamente su equivalente en timestamp Unix. Alterna entre formatos de segundos y milisegundos dependiendo de si tu sistema usa tiempo Unix estándar o timestamps de estilo JavaScript. Todas las conversiones se calculan en tu navegador usando el objeto Date de JavaScript.","p3":"Los desarrolladores backend depuran archivos de registro que contienen timestamps Unix convirtiéndolos a fechas legibles para entender secuencias de eventos. Los administradores de base de datos que trabajan con columnas SQL TIMESTAMP convierten entre números enteros Unix y strings de fecha ISO para consultas. Los ingenieros de API prueban respuestas de endpoint que contienen timestamps verificando que los valores Unix correspondan a fechas y horas esperadas. Los administradores de sistema que investigan registros de servidor traducen timestamps Unix a fechas humanas para correlacionar eventos en múltiples sistemas de logging.","p4":"Recuerda que los timestamps Unix siempre están en UTC, así que cuando conviertas a formato legible, considera desplazamientos de zona horaria si tu aplicación muestra horas locales. Los timestamps de JavaScript usan milisegundos mientras que la mayoría de sistemas backend usan segundos, así que multiplica o divide por 1000 según corresponda. Cuando almacenes timestamps en bases de datos, prefiere números enteros Unix sobre strings de fecha para indexación eficiente y almacenamiento independiente de zona horaria. Si estás obteniendo fechas inválidas, verifica si tu timestamp está en segundos o milisegundos; pegar un timestamp basado en segundos en un campo basado en milisegundos producirá una fecha en 1970."}