{"p2":"Ingresa tu llave secreta TOTP (generalmente proporcionada como un string codificado en Base32 cuando configuras autenticación de dos factores) y haz clic en Generar. La herramienta calcula la contraseña de una sola vez basada en tiempo de 6 dígitos actual usando el algoritmo TOTP con HMAC-SHA1 y pasos de tiempo de 30 segundos. Un temporizador de cuenta regresiva muestra cuántos segundos permanecen antes de que el código expire y uno nuevo se genere. Los códigos generados coinciden con los de aplicaciones autenticadores como Google Authenticator o Authy cuando se usa la misma llave secreta. Todo el cálculo se ejecuta localmente en tu navegador usando la Web Crypto API.","p3":"Los desarrolladores probando sistemas de autenticación TOTP generan códigos manualmente para verificar que la lógica de validación del lado del servidor funciona correctamente. Los usuarios que perdieron acceso a su aplicación autenticador pero guardaron sus llaves secretas usan esto para generar códigos y recuperar acceso a cuenta. Los ingenieros de seguridad auditan implementaciones TOTP generando códigos esperados y comparándolos con lo que el sistema acepta. Los desarrolladores backend solucionan problemas de sincronización de tiempo generando códigos en timestamps específicos para probar tolerancia de desviación.","p4":"Los códigos TOTP solo son válidos para una ventana de tiempo estrecha (típicamente 30 segundos), así que asegúrate que tu reloj de sistema sea exacto o los códigos no validarán. Las llaves secretas son insensibles a mayúsculas pero no deben contener espacios o guiones; elimina formato si copiaste desde una fuente que incluye separadores. Guarda tu llave secreta en algún lugar seguro; si la pierdes y tu aplicación autenticador, necesitarás recuperación de cuenta. La mayoría de sistemas aceptan códigos del rango de tiempo actual y anterior para contabilizar desviación de reloj y velocidad de escritura del usuario. Esta herramienta es compatible con estándar RFC 6238 TOTP, así que códigos funcionan con cualquier servicio conforme."}