{"p2":"Pega tu URL de video YouTube, luego configura opciones de incrustar usando casillas y entradas: habilita autoplay para iniciar video inmediatamente en carga de página, establece loop para reproducción infinita, silencia audio por defecto (requerido para autoplay en la mayoría de navegadores), especifica un tiempo de inicio en segundos para saltarse intros, oculta controles de video para incrustaciones más limpias e intercambia modo responsivo para generar CSS de ancho fluido. La herramienta construye el código de incrustar iframe apropiado con todas tus opciones codificadas como parámetros URL. Copia el HTML completo y pégalo en tu página web. Toda generación de código ocurre en tu navegador.","p3":"Las páginas de aterrizaje incrustan videos demo de producto con autoplay y silencio habilitado para crear héroes de video de fondo silenciosos que capten atención sin disrumpir la experiencia de navegación. Los posts de blog incrustan videos tutoriales con tiempos de inicio específicos que saltan intros y saltan directamente a instrucción relevante. Los sitios de portafolio usan controles ocultos y configuración de loop para videos de fondo ambiental que se reproducen continuamente sin desorden de UI. Los cursos en línea incrustan videos de conferencia con tamaño responsivo para que los estudiantes vean en teléfonos, tabletas o computadoras de escritorio.","p4":"Autoplay con sonido solo funciona cuando los usuarios han interactuado con tu sitio primero—los navegadores lo bloquean de otra manera para prevenir experiencias molestas. Siempre combina autoplay con silencio para asegurar reproducción confiable. El parámetro rel=0 que una vez removió videos relacionados ya no funciona; YouTube ahora solo muestra videos relacionados del mismo canal al final del video. El tiempo de inicio usa segundos, no marcas de tiempo—para 1:30, ingresa 90 segundos. Las incrustaciones responsivas requieren divs contenedores con CSS de proporción de aspecto específica; copia el código provisto exactamente. El modo de privacidad mejorado (usando youtube-nocookie.com) previene YouTube de rastrear espectadores hasta que reproduzcan el video."}