{"p2":"Ingresa cualquier URL de canal YouTube o ID de canal. El analizador jala estadísticas de canal comprensivas via la API YouTube: conteo de suscriptor total, conteo de vista acumulativa a través de todos los videos, número total de videos publicados, fecha de creación de canal y vistas promedio calculadas por video. Algunos canales ocultan conteos de suscriptor por privacidad; la herramienta muestra esto cuando está disponible. Usa las métricas para evaluar crecimiento de canal, comparación de desempeño contra competidores o investigación de socios de colaboración potencial. Sin autenticación requerida—simplemente pega la URL y analiza. Todo procesamiento ocurre en tu navegador.","p3":"Los creadores aspirantes investigan canales establecidos en su nicho para establecer expectativas realistas de crecimiento y entender cómo la cantidad de video se relaciona con conteos de suscriptor. Las marcas que evalúan asociaciones de influencer verifican reclamos de suscriptor y evalúan tasas de compromiso comparando suscriptores contra vistas promedio por video. Los agentes de talento que rastrean creadores de contenido identifican canales en ascenso con proporciones de vista-a-suscriptor fuerte indicando audiencia activa o crecimiento de contenido viral. Los analistas competitivos rastrean estadísticas de canal competidor durante el tiempo para monitorear cambios de participación de mercado en nichos de contenido.","p4":"Las vistas promedio por video importan más que conteo de suscriptor—un canal con 10k suscriptores promediando 15k vistas tiene mejor compromiso que 100k suscriptores promediando 2k vistas, indicando audiencia activa o contenido viral. La edad del canal contextualiza conteos de suscriptor; 100k suscriptores en un año es crecimiento explosivo mientras 100k en diez años es modesto. Algunos canales compran suscriptores, visible cuando el conteo de suscriptor vastamente excede conteos de vista (la proporción debería ser aproximadamente 1:10 a 1:20 para canales saludables). Compara vistas totales contra conteo de video para estimar esfuerzo requerido para resultados similares en tu nicho. Los conteos de suscriptor ocultos a menudo indican canales más pequeños sensibles sobre parecer pequeños o creadores muy grandes evitando escrutinio."}