{"p2":"Escribe tu nicho de canal (como \"cocina,\" \"gaming,\" \"finanzas\") y añade palabras clave relevantes que describan tu estilo de contenido o ángulo único. Haz clic en generar para recibir 20 sugerencias de nombre creativas que mezclan tus entradas con arquetipos comunes de nombres YouTube—combinando palabras descriptivas con arquetipos de canal como \"Academia,\" \"Hub,\" \"Lab\" o \"Estudio.\" Cada nombre intenta equilibrar descubribilidad (usando palabras clave buscables) con memorabilidad (manteniéndolo corto y pegadizo). Regenera para ideas nuevas o mezcla y empareja elementos de diferentes sugerencias. Toda generación ocurre en tu navegador sin almacenar tus palabras clave.","p3":"Los creadores aspirantes hacen lluvia de ideas sobre identidades de canal antes de subir su primer video, probando diferentes estilos de nombre para ver qué resuena con su contenido planeado. Los que se rebrandifican que han superado un nombre específico de nicho exploran alternativas más amplias que permitan diversificación de contenido sin confundir suscriptores. Los empresarios multi-canal generan rápidamente nombres para canales secundarios en diferentes nichos sin gastar horas en parálisis de nombres. Los gerentes de marca que lanzan presencia YouTube oficial para compañías exploran variaciones de nombre que conecten identidad corporativa con cultura YouTube.","p4":"Los nombres más cortos (1-2 palabras, bajo 20 caracteres) son más memorables y más fáciles de decir en outros de video cuando pides suscripción. Evita números y caracteres especiales que compliquen compartición verbal—\"Tech Tips 4 U\" es más difícil de comunicar que \"TechTips\" o \"TechieTalk.\" Verifica disponibilidad de dominio incluso si no planeas un sitio web inicialmente; emparejar .com construye credibilidad después. Busca tu lista corta en YouTube antes de comprometerte para asegurar que no eres demasiado similar a canales principales existentes. Evita nombres de nicho hiper-específicos que te limiten—\"DroneRacingOnly\" te encierra mientras \"AerialAdventures\" permite crecimiento."}