{"p2":"Pega cualquier URL de video YouTube público en el analizador. La herramienta obtiene metadatos completos usando la API YouTube: conteo de vista, conteo de me gusta, conteo de comentarios, duración de video, fecha de carga, descripción de video, etiquetas, categoría, nombre de canal y conteo de suscriptores. Todas las métricas se muestran en un formato fácil de leer con indicadores de desempeño clave destacados. Usa estos datos para entender desempeño de video, ingeniería inversa de estrategias de contenido exitosas o recopilación de inteligencia competitiva. Sin login o clave API requerida—la herramienta maneja autenticación. Todas las solicitudes ocurren a través de tu navegador.","p3":"Los creadores de contenido analizan videos virales en su nicho para identificar patrones en títulos, etiquetas, descripciones y metadatos que se correlacionan con alto desempeño. Las agencias de marketing conducen investigación competitiva en competidores de clientes examinando sus videos con mejor desempeño, cronogramas de publicación y métricas de compromiso. Los periodistas investigando tendencias en línea extraen metadatos de videos relevantes para reportaje sin anotar manualmente estadísticas. Los especialistas en SEO invierten ingeniería de estrategias de etiqueta de videos exitosos para informar sus propios enfoques de optimización.","p4":"Las vistas, me gusta y comentarios se actualizan continuamente, así que las métricas pueden diferir de lo que ves en la página de video dependiendo de cuándo analices. Los videos más viejos pueden tener conteos de me gusta ocultos debido a configuraciones de privacidad del creador—el analizador solo puede mostrar lo que la API de YouTube proporciona. Las etiquetas son a menudo el insight SEO más valioso ya que se ocultan en la página de video pero recuperables via API; modelar tu estrategia de etiquetado en videos similares exitosos. La duración afecta recomendaciones de algoritmo; videos entre 8-15 minutos golpean un punto dulce para tiempo de visualización sin abrumar espectadores. Verifica fecha de carga para contextualizar métricas—100k vistas en una semana es viral mientras 100k en cinco años no es."}