{"s1":{"h":"Data Format Overview","p":"JSON (JavaScript Object Notation), XML (Extensible Markup Language), and YAML (YAML Ain't Markup Language) are three major data formats for storing and transmitting structured information. Each format has different syntax, strengths, and use cases. JSON emerged from JavaScript but achieved language-independent status. XML predates JSON and offers powerful features at cost of verbosity. YAML prioritizes human readability with minimal syntax. Understanding differences helps choosing appropriate format for specific applications, APIs, and data interchange scenarios."},"s2":{"h":"JSON Format Characteristics","p":"JSON uses simple syntax with curly braces for objects, square brackets for arrays, colons for key-value pairs. Compact representation minimizes file size and transmission bandwidth. Native support in JavaScript and broad support in other languages. JSON is valid when properly formatted—validation tools identify syntax errors. JSON doesn't support comments—documentation requires external or file-surrounding comments. JSON represents data types: strings (quoted), numbers, booleans, null, objects, arrays. JSON dominates web APIs and modern data interchange due to simplicity, efficiency, and ubiquitous language support."},"s3":{"h":"XML Format Characteristics","p":"XML uses angle-bracket tags (similar to HTML) with opening and closing tags enclosing content. XML is self-describing—tag names convey meaning. XML supports attributes within tags providing metadata. XML enables namespaces preventing naming conflicts in complex documents. XML validation against schemas ensures conformance to defined structure. XML supports comments and processing instructions. XML is verbose compared to JSON but provides powerful features for complex hierarchical data. XML dominated data interchange before JSON emergence. Enterprise systems and complex document formats (DOCX, XLSX) still use XML internally."},"s4":{"h":"YAML Format Characteristics","p":"YAML uses indentation (whitespace) to denote structure, enabling clean, readable syntax without excessive brackets. Lists use dashes, key-value pairs use colons. YAML is human-friendly—easy to read and write manually. Comments begin with # and extend to line end. YAML supports complex data types through intuitive syntax. YAML is less compact than JSON and less feature-rich than XML. YAML excels for configuration files, human-edited data, and scenarios prioritizing readability. YAML sensitivity to whitespace can cause errors if indentation is incorrect. Popular in DevOps tools (Kubernetes, Docker Compose, Ansible) and configuration management."},"s5":{"h":"When to Use Each Format","p":"Use JSON for web APIs, mobile applications, and any scenario requiring compact, efficient data interchange. JSON's simplicity and language independence make it universal standard for modern API development. Use XML for complex documents requiring validation, attributes, and namespaces—especially enterprise applications and document-centric systems. Use YAML for configuration files, infrastructure-as-code, and human-edited data prioritizing readability. YAML reduces configuration file complexity compared to JSON or XML. Choose format based on primary use case—data interchange, document structure, or human configuration."},"s6":{"h":"Format Conversion and Interoperability","p":"Converting between formats is generally straightforward—each format stores data as structured information convertible to others. JSON to XML adds tags around data, XML to JSON extracts data from tags. YAML shares data structure with JSON enabling easier conversion than XML. Most data-oriented languages provide libraries for multiple formats. Format-agnostic tools abstract underlying format from applications. Choosing format for API providers determines client implementation—JSON has become de facto standard for new APIs. Legacy systems may require XML compatibility. Multilingual teams benefit from YAML's readability for configuration and documentation."},"title":"JSON vs XML vs YAML: Comparação de Formatos de Dados e Casos de Uso","excerpt":"Compare os formatos de dados JSON, XML e YAML."}