{"s1":{"h":"Color Representation in Digital Media","p":"Three primary color formats represent colors in digital media: RGB (Red, Green, Blue) uses additive color mixing—combining light of different wavelengths. HEX (Hexadecimal) represents RGB values in compact notation convenient for web development. HSL (Hue, Saturation, Lightness) describes colors using human-friendly properties—hue (color), saturation (intensity), lightness (brightness). Each format excels in different contexts—RGB for display technologies, HEX for web coding, HSL for human color selection. Understanding each format enables choosing the best representation for specific tasks."},"s2":{"h":"RGB Format Explained","p":"RGB represents colors as combinations of Red, Green, and Blue values ranging 0-255 each. RGB(255, 0, 0) is pure red, RGB(0, 255, 0) is pure green, RGB(0, 0, 255) is pure blue. RGB(255, 255, 255) is white, RGB(0, 0, 0) is black. Mixing values creates intermediate colors—RGB(255, 0, 255) is magenta. CSS uses RGB format with syntax rgb(255, 0, 0) or rgba() including alpha (transparency). RGB directly corresponds to display hardware which produces images using red, green, and blue light. RGB provides 16.7 million possible colors (256³ combinations) enabling comprehensive color reproduction."},"s3":{"h":"HEX Format Explained","p":"HEX represents RGB values using hexadecimal notation: #RRGGBB where RR, GG, BB are hexadecimal values (00-FF). #FF0000 equals RGB(255, 0, 0) red. #00FF00 equals RGB(0, 255, 0) green. #0000FF equals RGB(0, 0, 255) blue. Hexadecimal uses 0-9 and A-F representing 0-15. HEX format is compact (6 characters) compared to rgb() notation. CSS supports 3-digit shorthand #FFF for #FFFFFF (white) when RR=GG=BB pairs are identical. HEX provides same 16.7 million colors as RGB. HEX is standard for web development due to convenience and universal support."},"s4":{"h":"HSL Format Explained","p":"HSL describes colors using human-intuitive properties: Hue (0-360 degrees on color wheel), Saturation (0-100% intensity), Lightness (0-100% brightness). Red is hue 0, green is hue 120, blue is hue 240. Saturation 0% produces gray (no color), 100% is pure color. Lightness 0% is black, 50% is medium, 100% is white. CSS syntax: hsl(0, 100%, 50%) produces red. HSL makes creating color variations intuitive—decrease saturation for muted tones, increase lightness for pastels. HSL is ideal for programmatically generating color schemes and understanding relationships between colors."},"s5":{"h":"Format Conversion and Relationships","p":"HEX and RGB are directly interchangeable—simply convert hex digits to decimal. FF = 255 decimal, 00 = 0 decimal, 80 = 128 decimal. Converting between RGB and HSL requires more complex mathematics but most tools automate conversion. Color pickers typically display values in multiple formats. Understanding conversions enables switching formats based on needs. Online converters quickly translate between formats. Some CSS preprocessors (SASS) handle format conversions automatically. Choosing format depends on convenience—RGB/HEX for final values, HSL for understanding and creating color variations."},"s6":{"h":"Choosing the Right Format","p":"Use HEX for web development—industry standard, compact notation, universally supported. Use RGB when interfacing with design software or APIs expecting RGB values. Use HSL when programmatically generating colors or understanding color relationships. Many modern workflows use color picker tools displaying multiple formats simultaneously, eliminating manual conversion. Understand these formats improve color literacy and enable better design decisions. CSS supports all three formats allowing flexibility within stylesheets. Choose format based on specific task requirements—no single format dominates all scenarios."},"title":"RGB vs HEX vs HSL: Guia Completo de Formatos de Cor em CSS","excerpt":"Domine os formatos de cor RGB, HEX e HSL."}