{"s1":{"h":"Video Containers vs Codecs","p":"Video files combine multiple components: video stream, audio stream(s), and metadata in container format. Containers are files holding video and audio streams—MP4, WebM, MKV, MOV are containers. Codecs (compression algorithms) compress video and audio—H.264, VP9 compress video; AAC, Vorbis compress audio. Container and codec are independent—MP4 can contain H.264 or H.265 video, AAC or MP3 audio. File extension (MP4, WebM) indicates container but not necessarily codecs. Understanding this distinction helps troubleshooting compatibility issues and choosing appropriate formats for different platforms."},"s2":{"h":"MP4 Format and H.264 Codec","p":"MP4 is industry standard container format supported by all modern devices and browsers. H.264 codec provides excellent compression enabling high-quality video at reasonable file sizes. MP4 with H.264 video and AAC audio works everywhere—best choice for maximum compatibility. H.264 licensing enables broad adoption but costs manufacturers. H.264 is older codec but remains excellent choice for compatibility and quality balance. Most cameras, phones, and editing software work natively with MP4/H.264. Cloud services and streaming platforms default to MP4/H.264. When format choice is critical, MP4/H.264 ensures compatibility across all platforms."},"s3":{"h":"WebM and Modern Alternatives","p":"WebM is open-source container format combining VP9 or VP8 video codec with Vorbis or Opus audio. Google developed WebM optimizing for web video. VP9 video offers 50% better compression than H.264 but slower encoding. WebM browser support is good but not universal (Safari, some mobile browsers lack support). WebM ideal for web-only projects where file size matters and compatibility is adequate. HEVC (H.265) offers 50% better compression than H.264 but slower encoding and higher licensing costs. HEVC gaining adoption but H.264 remains dominant. Choose between compatibility (H.264), efficiency (VP9 or HEVC), or user software support (codec/container combinations your audience has)."},"s4":{"h":"Video Compression Techniques","p":"Intraframe compression compresses individual frames independently—enables seeking/scrubbing. Interframe compression compresses differences between frames—increases efficiency but requires decoding reference frames. Keyframes appear periodically (typically every 2-10 seconds) enabling seeking. Bitrate controls data density—higher bitrate maintains quality but increases file size. Variable bitrate (VBR) uses lower bitrate for static scenes, higher for complex scenes, optimizing efficiency. Constant bitrate (CBR) maintains consistent bitrate but wastes data on static scenes. VBR generally produces better results. Two-pass encoding enables optimized compression but takes twice as long as single-pass."},"s5":{"h":"Choosing Video Formats for Platforms","p":"YouTube accepts MP4, MOV, AVI, WebM and converts to MP4 for playback. Netflix uses adaptive bitrate streaming serving different quality based on bandwidth. Vimeo accepts 23+ formats but transcodes to optimal playback format. Social media (Facebook, Instagram, Twitter) accept MP4 primarily. Choose MP4/H.264 for most scenarios—near-universal support and adequate quality. Use platform-specific recommendations when available—platforms optimize delivery. Mobile video may require different bitrates than desktop. Live streaming uses adaptive bitrate enabling quality adjustment to network conditions. Professional distribution formats differ from consumer playback formats."},"s6":{"h":"Video Quality Optimization","p":"Source quality matters—starting with high-quality source enables better results. Upscaling low-quality video won't improve quality. Bitrate affects quality more than resolution—high bitrate 1080p looks better than low bitrate 4K. Test different bitrates finding optimal balance between quality and file size. Hardware-accelerated encoding speeds processing but may have quality or option limitations. Encoding speed-to-quality balance depends on urgency—streaming can use fast encoding, archival should use maximum quality settings. Maintain original high-quality files for re-encoding with future codecs as standards evolve."},"title":"Entendendo Formatos de Vídeo: MP4, WebM, AVI e Mais Explicados","excerpt":"Aprenda a diferença entre contêineres de vídeo e codecs."}