{"s1":{"h":"Color Wheel and Color Relationships","p":"Color wheel visually represents color relationships organizing hues 0-360 degrees. Primary colors (red, yellow, blue in traditional theory; red, green, blue in light theory) form foundation. Secondary colors result from mixing two primary colors. Tertiary colors result from mixing primary and secondary colors. Color wheel enables understanding harmonious color combinations. Opposite colors (180 degrees apart) are complementary and provide maximum contrast. Adjacent colors (30 degrees apart) are analogous and naturally harmonious. Understanding color wheel enables creating visually pleasing palettes."},"s2":{"h":"Color Harmony Schemes","p":"Monochromatic schemes use single color with varying saturation and lightness. Monochromatic schemes are cohesive and calming. Complementary schemes use opposite colors creating vibrant, high-contrast designs. Analogous schemes use adjacent colors creating harmonious, easy-on-eyes designs. Triadic schemes use three colors 120 degrees apart providing balanced, colorful appearance. Tetradic schemes use two complementary pairs offering complex but balanced designs. Split-complementary schemes use color and two adjacent to opposite color. Each scheme conveys different moods—choose based on desired effect."},"s3":{"h":"Color Psychology and Emotion","p":"Colors trigger psychological responses affecting mood and behavior. Red conveys energy, passion, urgency. Blue conveys calmness, trust, stability. Green conveys growth, nature, health. Yellow conveys optimism, energy, caution. Orange conveys friendliness, enthusiasm. Purple conveys creativity, luxury, mystery. Understanding color psychology enables choosing palette conveying appropriate brand message. Cultural differences in color meaning require consideration for global audiences. Testing with target audience provides feedback on color perception. Effective color psychology in design influences user behavior and brand perception."},"s4":{"h":"Saturation and Value in Design","p":"Saturation measures color intensity (0% is gray, 100% is pure color). Muted colors (low saturation) convey sophistication and elegance. Vibrant colors (high saturation) convey energy and excitement. Value refers to lightness (0% is black, 100% is white). Light colors convey airiness and simplicity. Dark colors convey sophistication and weight. Proper saturation and value variation prevents flat, boring designs. Backgrounds typically use neutral or low saturation colors. Accent colors may use higher saturation for emphasis. Understanding saturation and value enables creating depth and hierarchy in designs."},"s5":{"h":"Accessibility Considerations","p":"Color choice affects accessibility for users with color blindness and low vision. Red-green color blindness affects 8% of males, 0.5% of females. Avoid relying solely on color to convey information. Use patterns, symbols, or text labels alongside color. Ensure sufficient contrast between foreground and background (WCAG guidelines: 4.5:1 for text). Color blindness simulators show how designs appear to users with color vision deficiencies. Accessible color palettes benefit all users particularly in diverse lighting conditions. Testing with accessibility tools ensures designs work for all users."},"s6":{"h":"Practical Color Selection for Web Design","p":"Start with primary brand color establishing color identity. Select complementary or analogous colors for supporting palette. Use neutral colors (grays, whites) for backgrounds and text. Reserve bright colors for accents and calls-to-action. Limit palette to 3-5 colors preventing overwhelming designs. Test colors in context (buttons, backgrounds, text) not in isolation. Ensure readability—avoid low-contrast text. Consider cultural meanings when designing for global audiences. Color trends change; timeless palettes remain relevant longer. Professional color palettes convey credibility and polish."},"title":"Fundamentos de Teoria das Cores para Designers Digitais: Guia 2026","excerpt":"Domine o círculo cromático, esquemas harmoniosos e psicologia das cores."}