{"s1":{"h":"Introduction aux formats de couleur CSS","p":"RGB, HEX et HSL sont trois façons différentes de représenter les couleurs en CSS et sur le web. Chaque format a ses propres avantages et est mieux adapté à différentes situations. Comprendre les trois vous rend plus efficace en design web et CSS."},"s2":{"h":"RGB : Combinaison de trois canaux","p":"RGB (Red, Green, Blue) mélange trois canaux de couleur, chacun avec une valeur de 0 à 255. Par exemple, rgb(255, 0, 0) est rouge pur. RGB est intuitif pour les développeurs car il représente directement comment les écrans affichent les couleurs. RGBA ajoute un canal alpha pour la transparence (0 à 1)."},"s3":{"h":"HEX : Format compact et populaire","p":"HEX utilise une notation hexadécimale où chaque paire de caractères représente les valeurs Red, Green et Blue. Par exemple, #FF0000 est rouge pur. HEX est compact et largement utilisé. #RRGGBB où RR, GG, BB sont des valeurs hexadécimales de 00 à FF. Les couleurs HEX à trois chiffres (#F00) sont des raccourcis pour (#FF0000)."},"s4":{"h":"HSL : Basé sur la perception humaine","p":"HSL (Hue, Saturation, Lightness) représente les couleurs d'une façon plus proche de la perception humaine. Hue est la position sur la roue chromatique (0-360 degrés), Saturation est l'intensité (0-100%), et Lightness est la luminosité (0-100%). HSL est souvent plus facile à manipuler pour créer des variations de couleur."},"s5":{"h":"Comparaison et quand utiliser chaque format","p":"RGB est idéal pour la programmation et les calculs de couleur. HEX est compact et largement supporté, idéal pour les feuilles de style. HSL est meilleur pour manipuler les couleurs et créer des variantes harmonieuses. Beaucoup de designers modernes préfèrent HSL pour son intuitibilité."},"s6":{"h":"Convertir entre les formats","p":"Vous pouvez convertir entre RGB, HEX et HSL en utilisant des formules mathématiques ou des outils en ligne. Les navigateurs modernes supportent tous les trois formats. Choisissez le format qui est le plus efficace pour votre flux de travail spécifique."},"title":"RGB vs HEX vs HSL : Guide Complet des Formats de Couleur en CSS","excerpt":"Maîtrisez les formats de couleur RGB, HEX et HSL."}